[
  {
    "title": "Merle Tabor Stern",
    "description": "Merle Tabor Stern passed away peacefully while surrounded by family on December 26, 2025, in Southern California. Born to Hannah and Daniel Tabor in Baltimore, Maryland, on September 15, 1942, Merle followed convention except when she didn’t. After marrying right out of college, teaching first grade, and having her first child in quick succession, Merle [...]",
    "source": "Ocregister",
    "publishedAt": "2026-01-04 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.ocregister.com/obituaries/merle-tabor-stern-corona-del-mar-ca/"
  },
  {
    "title": "Maria Margarita Snyder",
    "description": "Maria Margarita Snyder, 63, of Yuba City California, peacefully passed away, Monday, December 22, 2025. Maria was a beautiful and kind soul that always cared for others before herself and used her Reiki and deep spirituality to bring comfort, joy, and peace to others. Maria loved being a mother to her two children and was [...]",
    "source": "Daily Democrat",
    "publishedAt": "2026-01-04 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.dailydemocrat.com/obituaries/maria-margarita-snyder-yuba-city/"
  },
  {
    "title": "George Earl Meggers",
    "description": "George Earl Meggers, retired USAF Lt. Col., marked his passage from life on the eve of December 15, 2025 in Vacaville, CA, at the age of 78. With a highly-decorated 35-year military career as a pilot, his lust for life and adventure guided him to far reaches of the globe. To that point, the last [...]",
    "source": "The Reporter",
    "publishedAt": "2026-01-04 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.thereporter.com/obituaries/george-earl-meggers-vacaville-ca/"
  },
  {
    "title": "Jack Allen Samuelson",
    "description": "Jack Allen Samuelson passed away peacefully on December 9th surrounded by family at his treasured home overlooking Santa Cruz. He was 91 years old, just a month short of celebrating his 92nd birthday. Jack was a native of Santa Cruz, born January 14, 1934, at the “Old Dominican” hospital (now Branciforte Plaza) and just blocks [...]",
    "source": "Santacruzsentinel.com",
    "publishedAt": "2026-01-04 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.santacruzsentinel.com/obituaries/jack-allen-samuelson-santa-cruz/"
  },
  {
    "title": "John (Jack) Paul Brown",
    "description": "John (Jack) Paul Brown, 92, of San Pedro passed away peacefully surrounded by family on December 20, 2025. Jack was born on March 10, 1933 to Robert and Agnes Brown in Long Beach, California. Jack’s childhood memories of growing up in San Pedro included catching tadpoles at Averill Park, selling newspapers to the sailors coming [...]",
    "source": "Daily Breeze",
    "publishedAt": "2026-01-04 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.dailybreeze.com/obituaries/john-jack-paul-brown-san-pedro-ca/"
  },
  {
    "title": "Ann flynn",
    "description": "Ann Ghering Flynn died peacefully on Christmas Eve 2025. Born in Butler, PA to the late Leonard Ghering and Jenny Lind Ghering, she earned an undergraduate degree from Brown University and a master’s degree in social work from the University of Pennsylvania. After marriage, the family settled in South Pasadena, where she built a life [...]",
    "source": "Pasadenastarnews",
    "publishedAt": "2026-01-04 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.pasadenastarnews.com/obituaries/ann-flynn/"
  },
  {
    "title": "Best Quantum Computing Stocks To Watch Today – January 1st",
    "description": "D-Wave Quantum, IonQ, and Quantum Computing are the three Quantum Computing stocks to watch today, according to MarketBeat’s stock screener tool. Quantum computing stocks are publicly traded companies whose core business or significant operations involve developing quantum computers, related hardware and software, enabling technologies (like cryogenics or quantum-safe cryptography), or funds that track this industry. [...]",
    "source": "Watch List News",
    "publishedAt": "2026-01-04 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.watchlistnews.com/best-quantum-computing-stocks-to-watch-today-january-1st/10949391.html"
  },
  {
    "title": "Allspring Global Investments Holdings LLC Boosts Holdings in Ecolab Inc. $ECL",
    "description": "Allspring Global Investments Holdings LLC lifted its position in shares of Ecolab Inc. (NYSE:ECL – Free Report) by 40.2% during the third quarter, according to the company in its most recent Form 13F filing with the Securities and Exchange Commission. The institutional investor owned 110,340 shares of the basic materials company’s stock after purchasing an [...]",
    "source": "Defenseworld Net",
    "publishedAt": "2026-01-04 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.defenseworld.net/2026/01/04/allspring-global-investments-holdings-llc-boosts-holdings-in-ecolab-inc-ecl.html"
  },
  {
    "title": "Carol V. Gibson",
    "description": "Carol Veronica Gibson, of South Pasadena, passed away peacefully at home on Friday, August 29, 2025, surrounded by loved ones. She was 92.Carol is survived by her three children, Christopher Gibson, Paula Gibson, and Valerie Gibson; her daughter-in-law, Anne Gibson; and her four grandchildren, Jack Gallagher, Cole Gallagher, Ian Gallagher, and James Gibson.Born December 7, [...]",
    "source": "Whittier Daily News",
    "publishedAt": "2026-01-04 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.whittierdailynews.com/obituaries/carol-v-gibson-south-pasadena/"
  },
  {
    "title": "Sheralyn Rae Emmerling",
    "description": "In Loving Memory of Sheralyn Rae Emmerling, formerly Housman, August 11, 1935 – November 29, 2025 Sheralyn Rae Emmerling passed away peacefully at the age of 90. Born in Taylorville, Illinois, she lived a life marked by faith, compassion, and quiet strength. Sherry moved with her family in 1937 to Highland Park, California, where she [...]",
    "source": "Whittier Daily News",
    "publishedAt": "2026-01-04 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.whittierdailynews.com/obituaries/sheralyn-rae-emmerling-manhattan-beach-ca/"
  }
]