[
  {
    "title": "Sen. Patty Murray slams Trump’s abortion ban for veterans - Thu, 25 Dec 2025 PST",
    "description": "Sen. Patty Murray criticized a Trump administration overhaul to veterans’ abortion access this week after the Justice Department issued an opinion barring the federal government from providing abortion services to veterans and their dependents in cases of rape, incest or when the pregnancy threatens their health.",
    "source": "Spokesman",
    "publishedAt": "2025-12-25 20:09:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "http://www.spokesman.com/stories/2025/dec/25/sen-patty-murray-slams-trumps-abortion-ban-for-vet/"
  },
  {
    "title": "Lawmakers attempt to tackle NIL, giving it the 'old college try'",
    "description": "SCORE Act to regulate college athlete NIL deals faces uncertain future as Congress continues debates over treating student-athletes as employees.",
    "source": "Fox News",
    "publishedAt": "2025-12-25 20:09:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.foxnews.com/politics/house-pulls-nil-college-sports-bill-floor-gop-defections-democratic-opposition"
  },
  {
    "title": "Lions vs. Vikings score, live updates from Christmas: Detroit clinging to playoff hopes as Minnesota looks to play spoiler",
    "description": "Follow along as the Lions and Vikings face off on Christmas Day in Week 17.",
    "source": "Yahoo! News",
    "publishedAt": "2025-12-25 20:08:57",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://ca.sports.yahoo.com/news/lions-vs-vikings-score-live-updates-from-christmas-detroit-clinging-to-playoff-hopes-as-minnesota-looks-to-play-spoiler-200857102.html"
  },
  {
    "title": "“Doggie” stabbed to death during altercation with reputed wife",
    "description": "The dead man has been identified as 49-year-old Gavin Linden Melville , also called 'Doggie,' a labourer of the said address. The post “Doggie” stabbed to death during altercation with reputed wife appeared first on INews Guyana.",
    "source": "Inews Guyana",
    "publishedAt": "2025-12-25 20:08:53",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://inewsguyana.com/doggie-stabbed-to-death-during-altercation-with-reputed-wife/"
  },
  {
    "title": "Fintech Stocks To Follow Now – December 25th",
    "description": "Rocket Companies, Joint Stock Company Kaspi.kz, and DeFi Development are the three Fintech stocks to watch today, according to MarketBeat’s stock screener tool. Fintech stocks are shares of publicly traded companies that develop or apply technology to deliver financial services — for example digital payments, online lending, digital banking, robo‐advisors, insurtech, and blockchain infrastructure. For [...]",
    "source": "Markets Daily",
    "publishedAt": "2025-12-25 20:08:47",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.themarketsdaily.com/2025/12/25/fintech-stocks-to-follow-now-december-25th.html"
  },
  {
    "title": "Best Retail Stocks To Follow Now – December 25th",
    "description": "Amazon.com, Costco Wholesale, Walmart, PDD, Alibaba Group, Home Depot, and Carvana are the seven Retail stocks to watch today, according to MarketBeat’s stock screener tool. Retail stocks are publicly traded company shares that are primarily bought and sold by individual (non‐professional) investors using personal brokerage accounts rather than by institutional investors. These stocks are often [...]",
    "source": "Daily Political",
    "publishedAt": "2025-12-25 20:08:46",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.dailypolitical.com/2025/12/25/best-retail-stocks-to-follow-now-december-25th.html"
  },
  {
    "title": "Top Virtual Reality Stocks To Follow Today – December 25th",
    "description": "Meta Platforms, zSpace, and The Glimpse Group are the three Virtual Reality stocks to watch today, according to MarketBeat’s stock screener tool. Virtual reality stocks are shares of companies whose primary business involves developing, manufacturing, or enabling VR technologies and content—such as headset makers, motion-tracking sensors, graphics processors, game and application developers, and platform or [...]",
    "source": "Markets Daily",
    "publishedAt": "2025-12-25 20:08:46",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.themarketsdaily.com/2025/12/25/top-virtual-reality-stocks-to-follow-today-december-25th.html"
  },
  {
    "title": "Promising Restaurant Stocks To Add to Your Watchlist – December 25th",
    "description": "McDonald’s, Booking, and Chipotle Mexican Grill are the three Restaurant stocks to watch today, according to MarketBeat’s stock screener tool. Restaurant stocks are shares of publicly traded companies whose primary business is operating, franchising, or supplying restaurants—covering quick-service, fast-casual, and full-service chains. Investors evaluate them using metrics like same-store sales, unit growth, franchise margins, labor [...]",
    "source": "Markets Daily",
    "publishedAt": "2025-12-25 20:08:46",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.themarketsdaily.com/2025/12/25/promising-restaurant-stocks-to-add-to-your-watchlist-december-25th.html"
  },
  {
    "title": "Infrastructure Stocks To Research – December 25th",
    "description": "Coinbase Global, Alibaba Group, Marvell Technology, International Business Machines, Datadog, Vertiv, and Astera Labs are the seven Infrastructure stocks to watch today, according to MarketBeat’s stock screener tool. Infrastructure stocks are shares of companies that build, operate or maintain the physical systems and facilities a society needs — for example utilities, toll roads, airports, railways, [...]",
    "source": "Bbns",
    "publishedAt": "2025-12-25 20:08:46",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://baseballnewssource.com/2025/12/25/infrastructure-stocks-to-research-december-25th/10982947.html"
  },
  {
    "title": "Best Streaming Stocks To Keep An Eye On – December 25th",
    "description": "Spotify Technology, Confluent, Roku, Tencent Music Entertainment Group, Franco-Nevada, NetEase, and Logitech International are the seven Streaming stocks to watch today, according to MarketBeat’s stock screener tool. “Streaming stocks” are shares of companies whose primary business is delivering digital streaming content or services—such as video, music, live events, or game streaming—and that generate revenue from [...]",
    "source": "Markets Daily",
    "publishedAt": "2025-12-25 20:08:46",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.themarketsdaily.com/2025/12/25/best-streaming-stocks-to-keep-an-eye-on-december-25th.html"
  }
]