[
  {
    "title": "Shein Might Be Cheap, But Is It Legit?",
    "description": "Shein's low prices attract millions of shoppers, but behind the deals are questions about quality, ethics, and whether the brand is truly legit.",
    "source": "Bgr",
    "publishedAt": "2025-11-01 21:17:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.bgr.com/2007841/is-shein-legit/"
  },
  {
    "title": "Dodgers win World Series in absolutely epic Game 7 vs. Blue Jays - Sat, 01 Nov 2025 PST",
    "description": "TORONTO – Perhaps now we know why it took a quarter-century for a Major League Baseball team to repeat as World Series champions. Now that the Los Angeles Dodgers have done it, we understand how harrowing, hair-raising and humbling a feat it really is.",
    "source": "Spokesman",
    "publishedAt": "2025-11-01 21:17:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "http://www.spokesman.com/stories/2025/nov/01/dodgers-win-world-series-in-absolutely-epic-game-7/"
  },
  {
    "title": "Colombian President Criticizes OAS for Silence on US Actions in Caribbean Sea",
    "description": "BUENOS AIRES (Sputnik) - Colombian President Gustavo Petro on Saturday criticized the Organization of American States (OAS) for staying silent on actions of the United States in the Caribbean.",
    "source": "Sputnik News",
    "publishedAt": "2025-11-01 21:17:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://sputnikglobe.com/20251101/colombian-president-criticizes-oas-for-silence-on-us-actions-in-caribbean-sea-1123050959.html"
  },
  {
    "title": "Why Kourtney Kardashian Is Reportedly ‘Upset’ With Kim And Khloé Amid New Season Of Their Reality Show",
    "description": "The famous sisters are supposedly feuding yet again.",
    "source": "Cinemablend",
    "publishedAt": "2025-11-01 21:17:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.cinemablend.com/streaming-news/why-kourtney-kardashian-reportedly-upset-kim-khloe-new-season-reality-show"
  },
  {
    "title": "Poll: How would you grade UW-La Crosse's performance vs. UW-Stout",
    "description": "The Eagles picked up a quality win over an in-state foe with an efficient all-around performance. Here's your chance to grade how they performed against the Blue Devils.",
    "source": "La Crosse Tribune",
    "publishedAt": "2025-11-01 21:17:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://lacrossetribune.com/sports/college/football/article_5701af7e-8382-427e-aa27-3a0f1235af32.html"
  },
  {
    "title": "Two arrested after multiple people stabbed on train, police say",
    "description": "British Transport Police said they were responding to an incident on a train to Huntingdon, Cambridgeshire.",
    "source": "Shropshire Star",
    "publishedAt": "2025-11-01 21:16:50",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.shropshirestar.com/uk-news/2025/11/01/two-arrested-after-multiple-people-stabbed-on-train-police-say"
  },
  {
    "title": "'Guns-a-blazing': Trump threatens new 'fast, vicious, and sweet' foreign military strike",
    "description": "Donald Trump on Saturday threatened military action on foreign soil, escalating previous remarks about the nation.The president previously raised the possibility of sanctions against Nigeria for allegedly failing to rein in the persecution of Christians in what Trump now calls a \"disgraced country.\" Nigerian officials have forcefully denied all the allegations.Trump went even further over the weekend, specifically threatening to use a military solution to what he considers to be a problem with persecution.\"If the Nigerian Government continues to allow the killing of Christians, the U.S.A. will immediately stop all aid and assistance to Nigeria, and may very well go into that now disgraced country, 'guns-a-blazing,' to completely wipe out the Islamic Terrorists who are committing these horrible atrocities,\" Trump said on Truth Social Saturday. \"I am hereby instructing our Department of War to prepare for possible action. If we attack, it will be fast, vicious, and sweet, just like the terrorist thugs attack our CHERISHED Christians! WARNING: THE NIGERIAN GOVERNMENT BETTER MOVE FAST!\"See the full post here.",
    "source": "Raw Story",
    "publishedAt": "2025-11-01 21:16:45",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.rawstory.com/trump-threat-against-nigeria-military/"
  },
  {
    "title": "Who is singing the national anthems in World Series Game 7?",
    "description": "If you're wondering who's set to sing The Star-Spangled Banner and O Canada in Game 7, we've got you covered.",
    "source": "Yahoo! News",
    "publishedAt": "2025-11-01 21:16:43",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://ca.sports.yahoo.com/news/singing-national-anthems-world-series-211643494.html"
  },
  {
    "title": "'Guns-a-Blazing': Trump's Explosive Threat to Nigeria Over Christian Killings",
    "description": "Earlier, Trump had opened the door for sanctions to be imposed on Nigeria",
    "source": "Times Now News",
    "publishedAt": "2025-11-01 21:16:42",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.timesnownews.com/world/us/us-news/us-president-donald-trump-nigeria-warning-christian-killings-article-153087656"
  },
  {
    "title": "Youth Growth and Empowerment",
    "description": "In this great walk of life, the things that the youth of the nation need to know are in dire need of their grooming and learning in the digital era. Well-groomed young minds equipped with training represent one of the most prominent and powerful assets for any nation. Across the world, there are more than [...]",
    "source": "Daily Times - Latest Pakistan News, World, Busines",
    "publishedAt": "2025-11-01 21:16:42",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://dailytimes.com.pk/1393614/youth-growth-and-empowerment/"
  }
]