[
  {
    "title": "Russian general hospitalized in shooting, officials say",
    "description": "Russia's Investigative Committee said \"an unidentified individual fired several shots\" at Vladimir Alekseyev in Moscow.",
    "source": "Dw Akademie",
    "publishedAt": "2026-02-06 08:08:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.dw.com/en/russian-general-hospitalized-in-shooting-officials-say/a-75833448?maca=en-rss-en-all-1573-rdf"
  },
  {
    "title": "Stomp reunites passenger with Strides Premier cabby who drove him from JB to CGH — and they hug",
    "description": "A Strides Premier taxi driver has finally met the passenger he went the extra mile for — thanks to Stomp....",
    "source": "Stomp",
    "publishedAt": "2026-02-06 08:08:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.stomp.sg/stomp-gets-things-done/stomp-reunites-passenger-strides-premier-cabby-who-drove-him-jb-cgh-and-they"
  },
  {
    "title": "Pantus: Belarus may soon deploy domestic anti-drone air defense system",
    "description": "Belarus may soon produce a domestic anti-aircraft missile-gun system for combating unmanned aerial vehicles (UAVs), Chairman of the State Authority for Military Industry Dmitry Pantus said before the start of a board meeting of the agency in Minsk on 6 February.",
    "source": "Белта",
    "publishedAt": "2026-02-06 08:08:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://eng.belta.by/society/view/pantus-belarus-may-soon-deploy-domestic-anti-drone-air-defense-system-176607-2026/"
  },
  {
    "title": "Power Up with MSI: Eco Series AC EV Charger and EZgo 7 kW Portable EV Charger Launch in Thailand",
    "description": "BANGKOK, Thailand, Feb. 6, 2026 /PRNewswire/ -- MSI, a global leader in AI PCs and energy technology, has launched the MSI Eco Series AC EV Charger and EZgo 7 kW Portable EV Charger in Thailand. Designed, manufactured, and supported by MSI, the lineup delivers consistent quality and...",
    "source": "Pr Newswire Apac",
    "publishedAt": "2026-02-06 08:08:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.prnewswire.com/apac/news-releases/power-up-with-msi-eco-series-ac-ev-charger-and-ezgo-7-kw-portable-ev-charger-launch-in-thailand-302680896.html"
  },
  {
    "title": "Russian general hospitalized after 'several shots' in Moscow",
    "description": "Russian officials said the deputy chief of military intelligence, Vladimir Alekseyev, was targeted by \"an unidentified individual.\"",
    "source": "Dw Akademie",
    "publishedAt": "2026-02-06 08:08:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.dw.com/en/russian-general-hospitalized-after-several-shots-in-moscow/a-75833448?maca=en-rss-en-all-1573-rdf"
  },
  {
    "title": "TCL Elevates Olympic Winter Games for Fans and Athletes at Milano Cortina 2026, Empowering Audiences Worldwide with Vision of \"It's Your Greatness\"",
    "description": "TCL Edelweiss Land launches at Milan Central Station, showcasing innovation in the heart of the city MILAN, Feb. 6, 2026 /PRNewswire/ -- TCL, a leading global technology company and a Worldwide Olympic and Paralympic Partner, celebrated the opening of the Olympic Winter Games Milano Cortina 2026 with the launch of its \"It's Your Greatness\" campaign and the inauguration of its creative showcase, TCL Edelweiss Land, at the Piazza Duca d'Aosta in front of Milan Central Station. Key guests attended the opening on 5 February, including Kirsty Coventry, President of the International Olympic Committee, Kevin Wang, CEO, TCL Technology, and Dr. Yan, CTO of TCL Technology and CTO of TCL CSOT. The initiative comes at a time when technology partners are becoming increasingly important to global sporting events, with brands playing a more integral role in the infrastructure behind how the Olympic Games are delivered and experienced. TCL firmly believes in the power of sport to inspire and unite people across cultures and generations. As the world joins together to welcome the Olympic Winter Games, TCL's \"It's Your Greatness\" campaign will encourage people to find their own excellence—in tune with the event's official theme of \"IT's your vibe.\" Throughout the event, TCL technology will transform how fans enjoy the event, provide comfort and connection so athletes can perform at their best, and engage viewers and communities around the world to Inspire Greatness. TCL will help millions of fans to enjoy the Olympic Winter Games on-site and worldwide by providing TVs, digital signage, and technical assistance to the Olympic Broadcasting Services (OBS) so that media at the International Broadcasting Centre can bring Milano Cortina 2026 to global audiences. TCL's 'screen universe' and other innovations such as AI-enabled air conditioners will also be featured in a TCL space at the Milano Olympic Village, showing how technology gives fans more choice than ever in how they enjoy the Olympic Winter Games. TCL displays at the IBC help media bring Milano Cortina 2026 to global audiences TCL is also helping to ensure athletes participating in the Olympic Winter Games are ready for action. As they settle in, TCL's next-generation home appliances such as smart washing machines and dryers are helping them to enjoy a new level of comfort at the Anterselva and Livigno Olympic Villages, while TCL TVs help them relax and unwind. TCL is also supporting the \"Athlete Moment\", providing the display technology that will connect athletes with their loved ones for moments of celebration immediately after each event. TCL products are featured in a space at the Milano Olympic Village The idea behind \"It's Your Greatness\" reflects TCL's commitment to excellence, in close alignment with the Olympic values. Years of practice and months of intense training by hundreds of athletes culminate in Olympic events over the next two weeks where outstanding passion and dedication will inspire the world. These include the likes of Olympic champion and freestyle skier Eileen Gu, rising ice hockey star Jack Hughes and slalom specialist Alex Vinatzer, supported by TCL as part of Team TCL's 15 athletes from 8 countries participating in the Olympic Winter Games and Paralympic Winter Games. In his remarks at the opening of TCL Edelweiss Land, Kevin Wang, CEO, TCL Technology said \"TCL's latest innovations are playing a key role in the Olympic Winter Games. Today is a milestone in TCL's first year as a Worldwide Olympic Partner, a collaboration born from shared values of innovation and excellence. TCL has always believed in the power of sport to bring people together across cultures and generations, and this is just the beginning.\" TCL Edelweiss Land Showcases Cutting-Edge Innovation TCL Edelweiss Land extends the celebration of greatness, running from 5-22 February in the Piazza Duca d'Aosta in front of Milan Central Station. Spanning over 500 square meters, visitors can get hands-on with TCL's latest innovations, share photo-worthy moments and inspire themselves, their friends and their community to create the extraordinary. Designed around environmentally friendly principles and driven by creativity, the showcase's design reflects TCL's commitment to sustainability and to innovation. Kevin Wang, CEO, TCL Technology and Kirsty Coventry, President of the International Olympic Committee celebrate the opening of TCL Edelweiss Land Speaking at the event, Kirsty Coventry, President of the International Olympic Committee, said \"When I think of TCL as a TOP Partner, what stands out is how global they are. Their reach helps to spread the magic of the Olympic Winter Games to communities everywhere. TCL is also a technology leader, but it's not just about technology. TCL shares our values – inspiring greatness, connecting people, and bringing the Olympic Games closer to everyone. I'm very excited about the future of our partnership and TCL will play a leading role in shaping how the world experiences the Olympic Games.\" TCL Edelweiss Land showcases cutting-edge innovation TCL Edelweiss Land is open daily from 10 a.m. to 10 p.m., with distinctive zones featuring TCL's latest products, including the latest display technology developed by TCL CSOT. Visitors can also see smart home appliances and TCL RayNeo AR glasses that showcase the latest in augmented-reality technology. To further amplify the energy and excitement around the Olympic Winter Games, TCL has also collaborated with the Olympic Museum to bring a vibrant mural to the heart of Milan at Corso di Porta Romana 111. The design was developed by Zeina Rashid, a painter and Olympian who represented Jordan in table tennis in Athens 2004 and Beijing 2008, and who was selected for the project through the Olympian Artists Programme of the Olympic Museum. The inspiration came from her childhood memories of watching the Olympic Winter Games on television, which sparked her dreams about the Olympic Games. Her vision was then brought to life by mural artist Bublegum. The result is a lively tribute to the cultural heritage of the Olympic Games, celebrating how countless children around the world first discover the Olympic spirit through a screen that opens a window onto their future ambitions. About TCL Founded in 1981, TCL—short for \"The Creative Life\"—embodies creativity in every aspect of life. As a leading technology company, TCL is dedicated to delivering innovative solutions—including TVs, audio products, smart home devices, display technologies, and clean energy—that enhance customer experiences through TCL Industries and TCL Technology. As of now, with 47 R&D centers and 39 manufacturing bases globally, TCL operates in over 160 countries and regions, cementing its position as a globally competitive smart technology brand. To further inspire greatness, TCL has become an official Worldwide Olympic and Paralympic Partner in the Home Audiovisual Equipment and Home Appliances category.",
    "source": "Pr Newswire Apac",
    "publishedAt": "2026-02-06 08:08:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://en.prnasia.com/story/521641-0.shtml"
  },
  {
    "title": "'Unauthorised' new works at pub and hotel boarded up for almost 17 years",
    "description": "A pub and hotel that's steeped in history but has remained boarded up in a seaside town for almost 17 years has come under further scrutiny after concerns were raised.",
    "source": "East Anglian Daily Times",
    "publishedAt": "2026-02-06 08:08:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.eadt.co.uk/news/25827611.concerns-unauthorised-works-crown-hotel-lowestoft/"
  },
  {
    "title": "Power Up with MSI: Eco Series AC EV Charger and EZgo 7 kW Portable EV Charger Launch in Thailand",
    "description": "BANGKOK, Thailand, Feb. 6, 2026 /PRNewswire/ -- MSI, a global leader in AI PCs and energy technology, has launched the MSI Eco Series AC EV Charger and EZgo 7 kW Portable EV Charger in Thailand. Designed, manufactured, and supported by MSI, the lineup delivers consistent quality and long-term reliability, backed by up to USD 5 million in product liability insurance and a 5-year or 3-year warranty for Eco chargers. Built for everyday use, Eco Series enables dependable home and site charging, while EZgo adds portable flexibility—so drivers can charge with confidence anytime, anywhere. MSI Eco-Series AC EV Charger Built for Thailand's harsh outdoor conditions, the Eco Series features corrosion-resistant materials validated by IEC 60068-2-11 salt spray testing, built-in lightning surge protection, and an IP65 dustproof, splash-resistant design. Its heat- and ASTM G154–compliant UV-resistant construction supports temperatures up to 55°C. For safety and security, Eco chargers use UL94 V-0 flame-retardant materials, RDC-DD leakage detection with automatic power cut-off, and an NXP industrial-grade MCU with data encryption. A bright 5-inch display, dynamic LED status lighting, and three-sided cable entry enable easy, flexible installation. With the MSI aConnect App, users can monitor charging, adjust current, schedule sessions, manage RFID, enable Plug & Charge (business mode), and control charging remotely. Designed for Thailand's humid, changeable climate, the MSI EZgo 7 kW Portable EV Charger delivers flexible charging for home and travel. It features an IP66 water- and dust-resistant design and a rugged high-density PC housing validated by heavy-load roll-over testing to help withstand accidental vehicle run-overs. Comprehensive protections include over-temperature, grounding, leakage, over/under-voltage, lightning surge, ESD, and fire protection, with automotive-grade cables compliant with UL 2263 and UL 817. EZgo includes a travel case and wall-mount kit, plus CEE and Type O plugs (up to 7 kW via CEE) and a 6.8 m cable for easier reach. With the MSI aConnect App, users can monitor status, adjust current, and schedule charging, while a 1.8-inch display and multi-color LEDs provide clear at-a-glance updates. Where to buy: https://evse.msi.com/th-th/where-to-buy MSI EZgo Portable EV Charger",
    "source": "Pr Newswire Apac",
    "publishedAt": "2026-02-06 08:08:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://en.prnasia.com/story/521642-0.shtml"
  },
  {
    "title": "'Unauthorised' new works at pub and hotel boarded up for almost 17 years - Lowestoft Journal",
    "description": "'Unauthorised' new works at pub and hotel boarded up for almost 17 years Lowestoft Journal",
    "source": "Google News",
    "publishedAt": "2026-02-06 08:08:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxOeTFScDlna3FBWVFfOTNOMkRLbE9maFA0aTY1VWlfYVlYcnBiWlg2TERYZkJWRjgwWm5iUmZ4dy0yOW5hTjZucXFwc3ZPS0hwSERDNWlEanZPVmhucUs3NUhUV2JCS2VjdU42M0IybFpiZUF3VTEyUkJNZHRhcUhTQjN6WVVXYS1zdzhHZjNIeWVyTWVuLVBRaU9vV2J6NWFq?oc=5"
  },
  {
    "title": "Soon you can share WhatsApp Status only with Close Friends",
    "description": "WhatsApp is working on a new Close Friends feature that will allow users to share Status updates only with selected contacts. Spotted in the latest Android beta, the feature aims to give users more control over Status privacy.",
    "source": "News9live",
    "publishedAt": "2026-02-06 08:08:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.news9live.com/technology/tech-news/whatsapp-close-friends-status-feature-2927364"
  }
]