[
  {
    "title": "T3 Arena tier list - Heroes ranked from best to worst",
    "description": "Updated on January 2nd, 2026 - Version: 1.42.2337370Do you want to know the best heroes in T3 Arena? Then you are in the right place. Today, we will share our T3 Arena tier list with you. In it, we have ranked each available hero from best to worst. ... [MORE]",
    "source": "Pocketgamer",
    "publishedAt": "2026-01-02 08:06:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.pocketgamer.com/t3-arena/tier-list/"
  },
  {
    "title": "Why Greggs shares crashed 40% in 2025",
    "description": null,
    "source": "Yahoo! News",
    "publishedAt": "2026-01-02 08:06:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://uk.finance.yahoo.com/news/why-greggs-shares-crashed-40-080600455.html"
  },
  {
    "title": "Why Greggs shares crashed 40% in 2025",
    "description": "Greggs has more stores than it had a year ago and total sales are higher, so is a 40% discount an unmissable chance to buy the shares?The post Why Greggs shares crashed 40% in 2025 appeared first on The Motley Fool UK.",
    "source": "Fool Uk",
    "publishedAt": "2026-01-02 08:06:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.fool.co.uk/2026/01/02/why-greggs-shares-crashed-40-in-2025/"
  },
  {
    "title": "Inside a development built for seismic resilience",
    "description": "Natural calamities like earthquakes are unpredictable, but their most damaging effects can be reduced through preparedness and resilient design. To support this approach, Bamberton Center uses QuakeSafe seismic isolation technology to improve structural stability and strengthen its resistance to seismic activity.The 18-story office and commercial development in Arca South, Taguig City, is being built by Maxblocks Construction Corp. with four basement levels and base-isolation technology to reduce ground motion during earthquakes. The project is supported by QuakeSafe Phils. Inc., led by Ever Bilena founder Dioceldo Sy, which promotes earthquake-resilient building design in the country.Sy views the development as a practical example of preparedness, saying, “Building with resilience means planning for the unexpected. Our goal is to create spaces that are safe and resilient, where occupants feel secure and businesses can operate with confidence. By focusing on long-term durability, we help ensure that the investments people make today remain valuable tomorrow.\"**carousel[69574,69575]**QuakeSafe Phils. Inc. is a one-stop solutions provider that promotes seismic base isolation in local construction, covering design, consulting, supply, and project management. For Bamberton Center, the system uses 42 sets of high-damping rubber bearings from Bridgestone Japan to dissipate seismic energy before it moves through the structure. Supporting components such as flexible pipe connections and seismic gap covers help maintain the building’s functionality during strong ground motion.Bamberton Center reflects how the property sector can respond to growing safety concerns through resilient design. As Metro Manila continues to expand, developments that prioritize preparedness are helping shape a more responsible approach to urban growth.",
    "source": "Manila Bulletin",
    "publishedAt": "2026-01-02 08:06:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://mb.com.ph/article/10899955/property-and-living/inside-a-development-built-for-seismic-resilience"
  },
  {
    "title": "Met Office verdict on snow after maps show almost ALL of UK to be blanketed",
    "description": "The Met Office has warned Brits to prepare for a \"prolonged spell of very cold weather\" as the new year kicks off with a barrage of Arctic air.",
    "source": "Express",
    "publishedAt": "2026-01-02 08:06:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.express.co.uk/news/weather/2152579/met-office-verdict-snow-maps-almost-all-uk-blanketed"
  },
  {
    "title": "California sets up a showdown with Washington by reissuing licenses to migrant truckers",
    "description": "California has delayed its cancellation of thousands of commercial driver's licenses held by migrants, setting it up for another showdown with Washington.",
    "source": "Havasunews",
    "publishedAt": "2026-01-02 08:06:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.havasunews.com/news/nation/california-sets-up-a-showdown-with-washington-by-reissuing-licenses-to-migrant-truckers/article_4eea9953-6b94-47ad-8917-2f2a6ec94425.html"
  },
  {
    "title": "'India has right to defend': Jaishankar hits out at 'bad neighbours' — what he said on neighbourhood poli - Times of India",
    "description": "'India has right to defend': Jaishankar hits out at 'bad neighbours' — what he said on neighbourhood poli Times of IndiaGrow at home, engage abroad: External Affairs Minister Jaishankar tells students at IIT Madras event The Hindu'You'll say hello': On Bangladesh question, Jaishankar's ‘good and bad neighbours’ comparison Hindustan Times'You can’t ask for water and continue terrorism,' Jaishankar slams Pakistan, says nobody can tell India wh The Economic TimesIndia has every right to defend its people when it comes to 'bad neighbours': EAM S Jaishankar Deccan Herald",
    "source": "Google News",
    "publishedAt": "2026-01-02 08:06:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://news.google.com/rss/articles/CBMi_AFBVV95cUxNWm5GYm5LaHdCSnc2UjVYd0Z5UDRkQU9LTnJSX2d0Wk00NWo4cUFteXdKYmVlM21FLWNOVjBfR2hlVThKNmhVLTFGU3hId3ZCZUV2MzV0bUhjRXM2dFkxazVBVEZ1c0pIaHBSOEYxMTQydEx5SFlTcEFHUzV6TDR5bUZaS0NCcnZlV0s5MkdvRkpPX0NqRGJNbFRGVzJ6R1dVZjVXLTNzVnVUVEk0S3c0blpsWWNBQTZNVTQ3V2NLTmJOVnRiWXpXN1J1UWZVUzBIVE9qRmg2bm1MaXZjZ0ZhRDV2emRRQ21oaDFvRXZEU2gtUHFIbHMtQVRGVEM?oc=5"
  },
  {
    "title": "Travel disruption expected as snow and ice forecast across UK - The Guardian",
    "description": "Travel disruption expected as snow and ice forecast across UK The GuardianUK weather: Ice and snow expected to cause travel disruption in wintry start to 2026 BBCAmber warning for snow issued Met OfficeUK weather: Travel disruption expected as ice and snow grip UK BBCUK weather: Snow warnings upgraded to amber for some areas as country sees wintry start to the year Sky News",
    "source": "Google News",
    "publishedAt": "2026-01-02 08:06:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOMURKeUlXSGNnVHpLZ0laVHRWS25FSGhmRmVwY0lPVFlzUzM4SXItZEhZQV9zSkljS1R0ZTlTTTlzOEh3LXZ4bUhtcG1rMmZhVjNydEd1ZGxjckdTMWFKY2YzM1lXUlBvM3RlaENTV081X1FhQmxuaWJMU2R0bk9XYkNLejR6cnNCQ0hvS09PZUxZczZwN2xHNTlB?oc=5"
  },
  {
    "title": "U.K. house prices drop unexpectedly in December, Nationwide says",
    "description": "Economists polled by ‍Reuters had forecast a 0.1% monthly rise to leave ⁠prices 1.2% higher than ​in December ⁠2024.",
    "source": "The Hindu",
    "publishedAt": "2026-01-02 08:05:56",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.thehindu.com/news/international/uk-house-prices-drop-unexpectedly-in-december-nationwide-says/article70463226.ece"
  },
  {
    "title": "Kartik Aaryan admits to calling his ex girlfriends even after he is in a new relationship, Ananya Panday calls it a red flag: Great Indian Kapil Show",
    "description": "Kartik Aaryan and Ananya Panday will soon be seen on The Great Indian Kapil Show to promote Tu Meri Main Tera Main Tera Tu Meri.",
    "source": "The Indian Express",
    "publishedAt": "2026-01-02 08:05:52",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://indianexpress.com/article/entertainment/bollywood/kartik-aaryan-calls-ex-girlfriends-after-new-relationship-ananya-panday-red-flag-great-india-kapil-show-10451016/"
  }
]