[
  {
    "title": "What to Know About the Vote in Myanmar",
    "description": "Amid a ruinous civil war, the military government is holding elections that are widely seen as a sham, as the main opposition remains barred or jailed.",
    "source": "The New York Times",
    "publishedAt": "2025-12-27 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.nytimes.com/2025/12/27/world/asia/what-to-know-myanmar-vote.html"
  },
  {
    "title": "John Paul Kirk",
    "description": "It is with sadness and yet with deep gratitude for a long, well-lived life that we share the passing of John P. Kirk, Sr. our beloved husband, father, grandfather, and great-grandfather. John died peacefully at the age of 94, on December 9, 2025, encircled by family: his wife of 73 years and partner in everything, [...]",
    "source": "Daily Breeze",
    "publishedAt": "2025-12-27 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.dailybreeze.com/obituaries/john-paul-kirk-torrance-ca/"
  },
  {
    "title": "Jamie Oliver's turkey stew recipe is delicious way to use Christmas leftovers",
    "description": "If you're looking for a way to use up your leftover turkey, then Jamie Oliver has the perfect recipe for you - and it's a hearty stew that just takes 1 hour to cook",
    "source": "Essexlive News",
    "publishedAt": "2025-12-27 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.essexlive.news/news/celebs-tv/jamie-olivers-turkey-stew-recipe-10652231"
  },
  {
    "title": "Stock Market Investors Got a Warning From Fed Chair Jerome Powell in 2025. History Says This Will Happen in 2026.",
    "description": "The S&P 500 is trading at one of its most expensive valuations ever by a a key metric.",
    "source": "Fool",
    "publishedAt": "2025-12-27 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.fool.com/investing/2025/12/27/stock-market-earning-fed-chair-jerome-powell-2026/"
  },
  {
    "title": "Extend anti-terrorism strikes beyond Sokoto, Tambuwal urges",
    "description": "Sokoto South Senator, Aminu Tambuwal, has urged the Federal Government to ensure the expansion of the ongoing security operations against terrorists beyond the state.Tambuwal made the call on Friday when he appeared as a guest in an interview on Arise Television.The lawmaker stated that security collaboration should be more expansive and must not concentrate on one location alone.According to him, areas of concern across the country deserve equal attention, adding that terrorist activities are not restricted to one state.“Areas of concern like Borno, Zamfara, Katsina, Kaduna, and a host of other parts of the country should be covered by this operation so that we do not have a situation where a particular part of the country that has not been as widely reported but is having such major security challenges as these other states would not be part of the narrative.“I believe that the Nigerian government should seek greater collaboration with many more countries, including the US and others that are willing to support this fight; after all, it is a transnational issue,” Tambuwal said.Recall that on Christmas night, US President Donald Trump announced powerful and deadly strikes against the terrorists in the Northwest region.The United States Africa Command, AFRICOM, however, clarified that the air operations were carried out at the request of Nigerian authorities.The Nigeria’s Ministry of Foreign Affairs subsequently confirmed that the country collaborated with the United States on the strikes targeting ISIS terrorists in Sokoto.",
    "source": "Nigeria News",
    "publishedAt": "2025-12-27 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.nigerianeye.com/2025/12/extend-anti-terrorism-strikes-beyond.html"
  },
  {
    "title": "New rules on media transparency under consultation",
    "description": "The inclusion of institutional advertising via agencies and the obligation to indicate whether heads of management bodies or editors have held political positions are among the new features.",
    "source": "The Portugal News",
    "publishedAt": "2025-12-27 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.theportugalnews.com/news/2025-12-27/new-rules-on-media-transparency-under-consultation/936668"
  },
  {
    "title": "Linda Sue (Jordan) Schlosser",
    "description": "Linda Sue (Jordan) Schlosser March 16, 1950-December 15, 2025 passed away peacefully surrounded by her family at her home in San Pancho, Mexico. Survived by her husband of 41 years, Phil Schlosser, her mother Gerry, daughter Kelly Noel, son Kevin Noel and wife Jennifer and her grandchildren Trevor and Lena. She was preceded in death [...]",
    "source": "Marin Independent Journal",
    "publishedAt": "2025-12-27 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.marinij.com/obituaries/linda-sue-jordan-schlosser-san-pancho-mx/"
  },
  {
    "title": "Shoppers point out concerning trend as coffee prices hit decade-high levels: 'This is ridiculous'",
    "description": "Coffee is just one example of a much bigger issue.",
    "source": "Yahoo! News",
    "publishedAt": "2025-12-27 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.yahoo.com/news/articles/shoppers-point-concerning-trend-coffee-080500734.html"
  },
  {
    "title": "Joan Helen Rasinski",
    "description": "Joan Helen Rasinski, lovingly known to many as a woman of strength, grace, and deep family devotion, was born Joan Helen Rosinski on July 6, 1931, in Buffalo, New York. Her proud Buffalo roots and Polish heritage remained a touchstone throughout her life, even as her journey took her across the country to Southern California. [...]",
    "source": "Ocregister",
    "publishedAt": "2025-12-27 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.ocregister.com/obituaries/joan-helen-rasinski-corona-del-mar-ca/"
  },
  {
    "title": "Peter Stuart",
    "description": "Peter died peacefully on November 29, 2025 in Santa Cruz, California from complications of Parkinson’s disease. Born in San Jose, California, to MaryEllen and Robert Stuart, he lived around the world during his youth as a child of a military officer. Later, Peter lived over 20 years in Concord, California before retiring to Santa Cruz. [...]",
    "source": "Santacruzsentinel.com",
    "publishedAt": "2025-12-27 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.santacruzsentinel.com/obituaries/peter-stuart-santa-cruz-ca/"
  }
]