[
  {
    "title": "Caterpillar Inc. unveils Cat AI Assistant",
    "description": "Caterpillar Inc. has unveiled Cat AI Assistant, an AI-based solution that allows Cat customers to engage with Caterpillar’s equipment and portfolio of digital applications in new, powerful ways. With Cat AI Assistant, Caterpillar is making it easier for customers to buy, maintain, manage and operate their equipment – no matter where they are. The launch ...",
    "source": "Africanminingmarket",
    "publishedAt": "2026-01-07 08:06:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://africanminingmarket.com/caterpillar-inc-unveils-cat-ai-assistant/24553/"
  },
  {
    "title": "UK weather: ice warnings in place across country as heavy snow expected - The Guardian",
    "description": "UK weather: ice warnings in place across country as heavy snow expected The GuardianUK weather latest: Ice warnings for nearly all of UK as Scotland set for heavy snow BBCUK weather: Storm Goretti to hit with heavy snow this week Sky NewsMet Office issues yellow warning for heavy snow in the East BBCMore warnings for snow and ice before ‘multi-hazard’ event Thursday into Friday Met Office",
    "source": "Google News",
    "publishedAt": "2026-01-07 08:06:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxNTjk0Rzk1ZEF6Zk5CdEdoV1YzMW5pbTBQQWNzWVFPNUxvODNhQ0tMbUx6QzgyRE5IZkZkTl9sVmU4aENBMWZJaU5iQmtXNFh6LWNKQlhIbktTZTlCNVNRSjBXTGlJWTVfRHNvRmxTbzdTWjZHSVlGeDlUS2p4Mm9RU3FVOWJKbkhUcGo1b3ZyVWdUSGgxLUcwcnJHU28?oc=5"
  },
  {
    "title": "Calls for Portugal to integrate older workers",
    "description": "The OECD recommends that Portugal strengthen the integration of older workers, the long-term unemployed, and young people into the labour market.",
    "source": "The Portugal News",
    "publishedAt": "2026-01-07 08:06:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.theportugalnews.com/news/2026-01-07/calls-for-portugal-to-integrate-older-workers/940841"
  },
  {
    "title": "Kee Ming inks TA Securities underwriting ahead of ACE Market listing",
    "description": "KUALA LUMPUR: Kee Ming Group Bhd has signed an underwriting agreement with TA Securities Holdings Bhd to underwrite 24.38 million new shares ahead of its initial public offering (IPO) on the ACE Market of Bursa Malaysia Securities Bhd. Read full story",
    "source": "The Star",
    "publishedAt": "2026-01-07 08:06:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.thestar.com.my/business/business-news/2026/01/07/kee-ming-inks-ta-securities-underwriting-ahead-of-ace-market-listing"
  },
  {
    "title": "CCTV shows Lahore university student jumping from second floor; critical condition",
    "description": "LAHORE: Disturbing CCTV footage has emerged showing a female student attempting suicide by jumping from the second floor of the University of Lahore (UOL). Viewer discretion is advised. The student, identified as 24-year-old Fatima, a first-semester D-Pharmacy student, sustained multiple fractures to her legs, arms, and ribs, along with a severe head injury. Hospital authorities [...]",
    "source": "Daily Times - Latest Pakistan News, World, Busines",
    "publishedAt": "2026-01-07 08:05:57",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://dailytimes.com.pk/1431018/cctv-shows-lahore-university-student-jumping-from-second-floor-critical-condition/"
  },
  {
    "title": "UK weather: ice warnings in place across country as heavy snow expected",
    "description": "Storm Goretti forecast bring as much as 20cm of snowfall in some places amid freezing temperatures Ice warnings are in place across the UK before a storm that is expected to bring heavy snow later in the week.The Met Office has issued yellow ice warnings for most of the UK, including Northern Ireland, for Wednesday morning amid an Arctic air mass, which has brought wintry showers across the country. Continue reading...",
    "source": "Theguardiantheguardian",
    "publishedAt": "2026-01-07 08:05:55",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.theguardian.com/uk-news/2026/jan/07/uk-weather-ice-warnings-heavy-snow-storm-goretti"
  },
  {
    "title": "Wayne Rooney speaks out on returning to management as he lays out key conditions",
    "description": "One year on from his latest sacking, Wayne Rooney has lifted the lid on his intentions regarding a return to management, as well as other ventures he'd consider in future",
    "source": "Manchester Evening News",
    "publishedAt": "2026-01-07 08:05:54",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.manchestereveningnews.co.uk/sport/football/football-news/rooney-job-manager-manchester-united-33180106"
  },
  {
    "title": "'Medical booked' - Deal agreed for Man City, Liverpool and Man Utd target as Fabrizio Romano gives update",
    "description": "Manchester City have won the race to sign one of the Premier League's stand-out players with Manchester United missing out",
    "source": "Manchesterworld",
    "publishedAt": "2026-01-07 08:05:52",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.manchesterworld.uk/sport/football/manchester-united/medical-booked-deal-agreed-for-man-city-and-man-utd-target-as-fabrizio-romano-gives-update-5465615"
  },
  {
    "title": "Marvel Studios Unveil Gritty X-Men Return in Newest ‘Avengers: Doomsday’ Teaser",
    "description": "SummaryMarvel Studios releases the third teaser for Avengers: Doomsday, centering on the iconic X-Men lineupPatrick Stewart, Ian McKellen, and James Marsden reprise their roles as Professor X, Magneto, and CyclopsThe footage teases a devastating assault on the X-Mansion involving mutant-hunting SentinelsThe Multiverse Saga is reaching its fever pitch as Marvel Studios officially pulls the curtain back on the X-Men’s involvement in the upcoming Avengers: Doomsday. Following character-specific clips for Steve Rogers and Thor, the latest teaser pivots to Westchester, delivering a somber and high-stakes look at the mutants we’ve known for over two decades.The intersection of the Fox-Marvel era and the primary Marvel Cinematic Universe has moved beyond mere cameos. In the third of six planned miniature teasers released ahead of Avatar: Fire and Ash screenings, Marvel has confirmed that the \"Uncanny\" roster will play a pivotal role in the fight against Robert Downey Jr.’s Doctor Doom. This isn't just a nostalgia play; it's a cultural collision that effectively integrates the 2000s-era X-Men into the core Phase 6 narrative, setting the stage for a multiversal war with permanent consequences.The teaser opens on the haunting ruins of Xavier’s School for Gifted Youngsters, establishing a tone of loss and urgency. A voiceover from Ian McKellen’s Magneto ponders the inevitability of death, cutting to a poignant reunion between the Master of Magnetism and Patrick Stewart’s Charles Xavier. While the veterans provide the emotional weight, James Marsden’s Cyclops delivers the visual spectacle. Sporting a comic-accurate blue-and-yellow suit — a nod to the X-Men '97 aesthetic — Scott Summers is seen unleashing a massive, unrestrained optic blast against a towering Sentinel.Technical specs from the footage suggest a \"hail mary\" defense of the X-Mansion, with the production design leaning heavily into 90s-inspired costumes and gritty, practical destruction. Cultural insiders note that the shift from the grounded leather suits of the early 2000s to this vibrant, high-fidelity comic accuracy signals Kevin Feige’s intent to finally give these iterations of the characters the \"hero shots\" fans have demanded for years.By positioning the X-Men as a central pillar of the Doomsday campaign, Marvel is betting on the emotional gravity of these legacy heroes to anchor a film that must bridge the gap between two cinematic generations.Read more at Hypebeast",
    "source": "Hypebeast. Uk",
    "publishedAt": "2026-01-07 08:05:51",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://hypebeast.com/2026/1/marvel-studios-x-men-avengers-doomsday-teaser-stream"
  },
  {
    "title": "Goldman Sachs tops global M&A rankings with US$1.48 trillion in deals",
    "description": "The bank ranked No 1 in M&A fee revenue and overall value of the deals it worked on",
    "source": "The Business Times",
    "publishedAt": "2026-01-07 08:05:50",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.businesstimes.com.sg/international/global/goldman-sachs-tops-global-m-rankings-us1-48-trillion-deals"
  }
]