[
  {
    "title": "Okananwa, Poffenbarger help No. 9 Terps ease past Princeton, 84-68",
    "description": "Sara Oluchi Okananwa scored 20 points on 9-of-13 shooting, Saylor Poffenbarger added 19 points and No. 9 Maryland never trailed en route to an 84-68 victory over Princeton. Addi Mack added 15 points for the Terrapins (5-0) despite exiting for...",
    "source": "The Cumberland Times-news",
    "publishedAt": "2025-11-16 20:09:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.times-news.com/sports/okananwa-poffenbarger-help-no-9-terps-ease-past-princeton-84-68/article_51a2a44f-611d-5008-b6d7-e7bd434e70f6.html"
  },
  {
    "title": "Canada considers diversifying fighter jet purchases beyond F-35 deal: Defense minister",
    "description": "David McGuinty says government open to joint ventures including Swedish Gripen production Source linkThe post Canada considers diversifying fighter jet purchases beyond F-35 deal: Defense minister appeared first on Daily News World News Turkish Turkey.",
    "source": "Turks",
    "publishedAt": "2025-11-16 20:09:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://turks.us/canada-considers-diversifying-fighter-jet-purchases-beyond-f-35-deal-defense-minister/"
  },
  {
    "title": "US aircraft carrier arrives in the Caribbean in major buildup near Venezuela",
    "description": "The most advanced U.S. aircraft carrier has arrived in the Caribbean Sea in a display of American military power. The presence of the USS Gerald R. Ford on Sunday raises questions about what the new influx of troops and weaponry...",
    "source": "Romesentinel",
    "publishedAt": "2025-11-16 20:09:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.romesentinel.com/ap/washington/us-aircraft-carrier-arrives-in-the-caribbean-in-major-buildup-near-venezuela/article_43889089-3ca4-57d9-af31-5c38c51dc907.html"
  },
  {
    "title": "Discover the Magic of White River Wonderland in Batesville: Arkansas’s Ultimate Christmas Experience",
    "description": "Discover the Magic of White River Wonderland in Batesville: Arkansas’s Ultimate Christmas ExperienceBatesville transforms into the Christmas Capital of Arkansas with millions of lights, carriage rides, ice skating, and more.The post Discover the Magic of White River Wonderland in Batesville: Arkansas’s Ultimate Christmas Experience appeared first on Travel And Tour World.",
    "source": "Travel And Tour World",
    "publishedAt": "2025-11-16 20:08:57",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.travelandtourworld.com/news/article/discover-the-magic-of-white-river-wonderland-in-batesville-arkansass-ultimate-christmas-experience/"
  },
  {
    "title": "Packers’ Josh Jacobs ruled out vs. Giants with knee injury",
    "description": "The Green Bay Packers will try to defeat the New York Giants without their leading rusher.",
    "source": "Sportsnet",
    "publishedAt": "2025-11-16 20:08:56",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.sportsnet.ca/nfl/article/packers-josh-jacobs-ruled-out-vs-giants-with-knee-injury/"
  },
  {
    "title": "Calvin Ridley’s return for the Titans ends abruptly with ankle injury against Texans",
    "description": "Tennessee Titans wide receiver Calvin Ridley lasted all of one offensive play Sunday before hurting his right ankle and being carted off the sideline to the locker room.",
    "source": "Sportsnet",
    "publishedAt": "2025-11-16 20:08:56",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.sportsnet.ca/nfl/article/calvin-ridleys-return-for-the-titans-ends-abruptly-with-ankle-injury-against-texans/"
  },
  {
    "title": "England completes perfect World Cup qualifying campaign",
    "description": "Perfect England is heading to the World Cup with a 100 per cent qualifying record.A 2-0 win against Albania on Sunday made it eight wins from eight for Thomas Tuchel’s team, which also booked its place in next year’s tournament without conceding a goal.",
    "source": "Sportsnet",
    "publishedAt": "2025-11-16 20:08:54",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.sportsnet.ca/fifa-world-cup/article/england-completes-perfect-world-cup-qualifying-campaign/"
  },
  {
    "title": "Sinner beats Alcaraz to defend ATP Finals title before home fans",
    "description": "The final installment of the “Sincaraz” rivalry for 2025 went to Jannik Sinner.The second-ranked Sinner beat the top-ranked Carlos Alcaraz 7-6 (4), 7-5 for the ATP Finals trophy on Sunday in the sixth meeting this year between the two players who are dominating men’s tennis.",
    "source": "Sportsnet",
    "publishedAt": "2025-11-16 20:08:51",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.sportsnet.ca/atp/article/sinner-beats-alcaraz-to-defend-atp-finals-title-before-home-fans/"
  },
  {
    "title": "Coffee Giant to Brew up a Fresh Pot in Millington",
    "description": "7 Brew is continuing its local expansion with a location planned on the west half of U.S. 51 and north of Cuba Millington Road.",
    "source": "What Now Austin",
    "publishedAt": "2025-11-16 20:08:48",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://whatnow.com/memphis/restaurants/coffee-giant-to-brew-up-a-fresh-pot-in-millington/"
  },
  {
    "title": "Madam Yang Yang Pushes Local Talent, Innovation in Industrial Sector",
    "description": "Madam Yang Yang, Executive Officer of Zonda Tec Ghana Limited, has reaffirmed the company’s commitment to driving Ghana’s industrial growth through skills development, localisation, and strong community partnerships. Speaking in an interview with the media, Madam Yang outlined how Zonda Tec Ghana has evolved into a major force in the country’s heavy-duty automobile and equipment [...]The post Madam Yang Yang Pushes Local Talent, Innovation in Industrial Sector appeared first on Ghanamma.com.",
    "source": "Ghanamma",
    "publishedAt": "2025-11-16 20:08:47",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.ghanamma.com/2025/11/16/madam-yang-yang-pushes-local-talent-innovation-in-industrial-sector/"
  }
]