[
  {
    "title": "‘We have a legal obligation’: Assistant Commissioner defends immigration enforcement actions",
    "description": "As immigration enforcement faces increasing public scrutiny, Assistant Commissioner Neville Xuereb said that Malta's immigration police are carrying out checks they are legally required to perform, arguing that criticism of the inspections and street controls ignores binding obligations under Maltese and EU law.Videos circulating on social media have shown immigration officers boarding public buses to check IDs and passports.In an interview with The Malta Independent, Xuereb was asked to explain the legal basis for these operations and for a justification on carrying them out in confined public spaces used by commuters.Xuereb, who heads the immigration section within the Malta Police Force, insisted that these operations are legally grounded, intelligence-led and carried out with safeguards designed to minimise harm to vulnerable communities.\"All inspections carried out by immigration police tend to be a little bit subject to criticism,\" Xuereb said.\"However, there is a specific article in the Immigration Act that empowers the Principal Immigration officer to check persons who we may suspect to be irregularly staying,\" he said.According to Xuereb, immigration inspections are not arbitrary, nor are they driven by race, nationality or appearance, despite frequent accusations of racial profiling.Bus inspections, Xuereb explained, are among the most effective enforcement tools available to immigration police, particularly in a small country like Malta where public transport is heavily used by third-country nationals travelling to work.\"When it comes to inspections on public transport, those tend to be the most effective. We know that public transport is heavily used by third-country nationals,\" Xuereb said.However, he said that effectiveness does not override legal and ethical considerations.\"We need to be careful not to impinge on the civil liberties of other persons who are also on public transport,\" Xuereb said.In practice, this has led immigration police to refine how and where checks are carried out, often targeting bus stages or areas close to stops during early morning hours, when workers are commuting.\"These result to be the most effective in ensuring that we are upholding our legal obligations. In order to return illegally staying persons, you need to trace them first,\" Xuereb said.Accusations of racial profiling have been repeatedly levelled at immigration police, particularly in relation to bus checks and street inspections.Xuereb acknowledged the sensitivity of these claims and admitted that intelligence-led policing is easier to assert than to prove.\"It might be easy to say that checks are intelligence-led, but harder to prove,\" he said.However, he rejected the notion that targeting people based on race or nationality would be either practical or efficient.\"It would be much more difficult if you were to try to target a specific nationality or race. It is not even worth the work required,\" Xuereb said.His responsibility, he said, is to enforce the law consistently, regardless of nationality.\"Whether we are returning one nationality or another makes no difference to me,\" he said.While the vast majority of inspections are intelligence-driven, Xuereb said the immigration police are legally obliged to act on reports received from the public, even when those reports may later prove to be unfounded or motivated by ulterior interests.\"Some reports clearly have an ulterior motive. We need to be careful that our department is not used by certain classes of people,\" Xuereb said.Xuereb said immigration police deliberately avoid carrying out inspections in locations where enforcement could increase vulnerability or undermine access to essential services.\"We do not carry out inspections close to mosques. We do not carry out inspections close to health centres. We do not carry out inspections close to their own communities,\" he said.Inspections are also avoided near NGOs, lawyers' offices or organisations known to provide assistance to migrants, in line with guidance from the EU Fundamental Rights Agency.\"This would go against the advice of the Fundamental Rights Agency,\" Xuereb said, adding that such actions could further marginalise migrants who are already vulnerable. Public complaints and accountabilityAsked about redress mechanisms for individuals who believe they were unfairly treated during an immigration check, Xuereb said complaints are investigated through established oversight structures.\"There is a specific branch that investigates professional standards,\" he said, noting that complaints can also be referred to the Independent Police Complaints Board.While such complaints are relatively rare, Xuereb said body-worn cameras are being used more frequently during inspections to protect both officers and the public.\"They safeguard us and they safeguard the persons being spoken to,\" he said, adding that footage can be used in independent investigations where required.Comparisons between Malta's immigration enforcement and aggressive tactics used by foreign agencies - particularly in the United States - have drawn a sharp response from Xuereb.\"I am truly hurt by such comments. One cannot even imagine comparing certain tactics with our procedures,\" Xuereb said.He invited critics to observe immigration officers at work. \"Come and spend a week with us and see how we work. It is not even close,\" Xuereb said.Xuereb cited a case involving a family temporarily accommodated in a detention facility after being refused entry at the airport, which he said was misrepresented in the media.\"They were kept apart from all other detainees and had free movement within their area,\" he said, adding that lessons were learned and similar situations would now be handled in open centres, rather than closed ones.While responsibility for detention centre conditions lies with the Detention Service rather than the police, Xuereb said he has witnessed significant improvements over recent years.\"Conditions have improved enormously,\" he said, noting that facilities now include medical clinics, mental health support and specialised care.\"Detention will always be detention, but the levels of care have improved and this has been acknowledged at EU level,\" Xuereb said.The police, he added, are legally obliged to clearly communicate the basis for detention to the Detention Service, whether under asylum or return legislation.Contrary to claims that immigration enforcement erodes trust among migrant communities, Xuereb said the police's aim is to do the opposite.\"Our primary aim is to increase public trust,\" he said.Xuereb acknowledged that migrants' visibility of the police often comes through enforcement actions, but said that the immigration section also engages in outreach aimed at discouraging irregular stay and encouraging legal pathways.\"Living irregularly means living in constant uncertainty. We try to pass the message to seek legal avenues,\" Xuereb said.Xuereb acknowledged the emotional difficulty of enforcing return decisions against individuals who have lived and worked in Malta for years.\"I fully understand the situation of a person who has been living here for several years,\" he said.However, he stressed that such individuals were aware from the outset that return procedures were ongoing and had chosen not to cooperate.\"They could have returned in a legal manner and may already be here legally,\" he said, adding that enforcement is not discretionary.\"We will go hard on illegal status, but we assist those who collaborate,\" Xuereb said. Labour migration policy and enforcement pressuresThe government's labour migration policy, aimed at curbing reliance on third-country nationals, is still in its early stages but is already influencing enforcement dynamics, Xuereb said.\"The main concern we had was the ever-increasing number of residence permits,\" he said, adding that the police have visibility over applications and approvals through their checks.The policy, he said, could reduce Malta's use as a transit point and help prevent situations where migrants arrive for jobs that never materialise.He cited cases prosecuted as human trafficking where individuals were charged fees for non-existent employment. \"This is trafficking under our legislation,\" Xuereb said.Looking ahead, Xuereb identified the EU's entry-exit system, expected to come fully into operation in April, as one of the biggest upcoming challenges.\"With the entry-exit system, waiting times at the airport will increase. This is going to now exceed a minute, at least. I'm being conservative. Even with everything working perfectly, the waiting time at the airport is going to increase. I'm not talking for EU nationals. EU nationals are not subject to EES. Holders of residence permits and long-term visas are also exempt from EES, but whoever is visiting Malta from a third country for a short stay, these are all subject to EES,\" Xuereb said.Xuereb said that the police have been in talks with Malta International Airport on enhancing the possibilities of a quicker passage through border control, despite challenges.Xuereb reiterated that judicial proceedings and limited cooperation from third countries also remain persistent obstacles.\"Everybody thinks it's easy to return a person. It is not,\" he said.Xuereb appealed directly to third-country nationals who may be struggling with their legal status.\"We are not here simply as a deportation machine,\" he said.He urged migrants to approach the immigration police directly rather than living in fear or relying solely on legal intermediaries.\"If you take the initiative to regulate your own situation, we are here to assist,\" Xuereb said.The first part of the interview was carried yesterday",
    "source": "Malta Independent",
    "publishedAt": "2026-02-09 08:14:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.independent.com.mt/articles/2026-02-09/local-news/We-have-a-legal-obligation-Assistant-Commissioner-defends-immigration-enforcement-actions-6736287085"
  },
  {
    "title": "Superman Star David Corenswet’s NFL Biopic Sets Release Date",
    "description": "Paramount Pictures has reportedly locked in the release date for David Corenswet‘s next movie, an untitled NFL biopic revolving around John Tuggle. The upcoming film marks the actor’s next major project following his positively received turn as Superman in James Gunn’s successful film of the same name. Paramount sets release date for John Tuggle movie [...]The post Superman Star David Corenswet’s NFL Biopic Sets Release Date appeared first on ComingSoon.net - Movie Trailers, TV & Streaming News, and More.",
    "source": "Coming Soon",
    "publishedAt": "2026-02-09 08:14:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.comingsoon.net/movies/news/2093680-john-tuggle-movie-mr-irrelevant-release-date-david-corenswet"
  },
  {
    "title": "'I'm an Epstein survivor – it's time for entitled Andrew to do the right thing'",
    "description": "Marina Lacerda appeared on Good Morning Britain discussing the former Prince.",
    "source": "Express",
    "publishedAt": "2026-02-09 08:14:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.express.co.uk/showbiz/tv-radio/2168438/im-epstein-survivor-andrew-gmb"
  },
  {
    "title": "Zydus Life shares gain 5% as Q3 results beat estimates; Revenue, EBITDA up around 30% each",
    "description": "Zydus Life's third quarter results beat estimates across parameters.The company's revenue increased 30.3% to ₹6,865 crore from ₹5,269 crore in the third quarter of the previous fiscal. It was also above CNBC-TV18 poll's ₹6,294.3 crore.",
    "source": "Cnbctv18",
    "publishedAt": "2026-02-09 08:13:57",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.cnbctv18.com/market/zydus-life-share-price-q3-results-beat-estimates-net-profit-revenue-ebitda-margin-forex-gains-ws-l-19845556.htm"
  },
  {
    "title": "From Newcomer to Top 8 in 17 Months: OMODA & JAECOO Take UK Auto Market by Storm",
    "description": "LONDON – In record time of 17 months, OMODA & JAECOO have gone from industry newcomers to claiming a spot in UK’s Top 8 automarket brands. Their rapid rise shows bold strategy, innovative design, and growing consumer confidence, marking a breakthrough moment in the competitive UK automotive scene. In January 2026, the brand delivered a standout [...]The post From Newcomer to Top 8 in 17 Months: OMODA & JAECOO Take UK Auto Market by Storm appeared first on Daily Pakistan English News.",
    "source": "Daily Pakistan Global",
    "publishedAt": "2026-02-09 08:13:57",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://en.dailypakistan.com.pk/09-Feb-2026/from-newcomer-to-top-8-in-17-months-omoda-jaecoo-take-uk-auto-market-by-storm"
  },
  {
    "title": "'I didn't know he was trading': Market maker testifies in Goh Jin Hian's false trading trial",
    "description": "The prosecution called convicted market maker Huang Yiwen to the stand on the third day of the New Silkroutes Group false trading trial.",
    "source": "Channel Newsasia",
    "publishedAt": "2026-02-09 08:13:55",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.channelnewsasia.com/singapore/false-trading-market-maker-testify-against-goh-jin-hian-5917266"
  },
  {
    "title": "'I didn't know he was trading': Market maker testifies in Goh Jin Hian's false trading trial - CNA",
    "description": "'I didn't know he was trading': Market maker testifies in Goh Jin Hian's false trading trial CNAConvicted market maker Huang Yiwen testifies to ‘marking the close’ at Goh Jin Hian’s criminal trial The Straits Times'No need to break the bank to keep shares up': Goh Jin Hian criminal trial on market rigging begins AsiaOneGoh Jin Hian Trial February 05: False Trading Case Tests SGX Integrity MeykaGoh Jin Hian’s trial for market-rigging begins, following co-accused convictions The Online Citizen",
    "source": "Google News",
    "publishedAt": "2026-02-09 08:13:55",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxQNFE2QVlXbWhLZ0Z4dEt6S2N5bUpLM0hmc19QZmlTZ1hHcDN3MUVoTHFjX0NtSW44LUVEa0V0WUkycjZsZWFKNDNxcERDT0V5bjRQUWF1djZxNkxWaGt2aVYzODluTGI0QzV3ejExX1BNcnR4WlJYNXhRT2kxX25NVldQODBqVTNJb3Y2WHhjQm5odUpvbjQ0VWtNNm9MMkhnbGlPQUE3RXY?oc=5"
  },
  {
    "title": "The 50: Bhavya Calls Divya Agarwal 'Fake' And Gold Digger', Claims Actress 'Living Separately' From Her Husband Apurva Padgaonkar",
    "description": "Divya Agarwal got married to Apurva Padgaonkar on February 20, 2024, in a lavish traditional Marathi ceremony at her home in Mumbai. A few months later, she made headlines for deleting her wedding posts.",
    "source": "Republic World",
    "publishedAt": "2026-02-09 08:13:54",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.republicworld.com/entertainment/television/the-50-bhavya-calls-divya-agarwal-fake-and-gold-digger-claims-actress-living-separately-from-her-husband-apurva-padgaonkar"
  },
  {
    "title": "South Korean & US commences joint aerial exercise ‘Buddy Squadron’",
    "description": "WEB DESK The South Korean and the United States’ air forces have commenced a joint aerial exercise this week at Osan Air Base in Pyeongtaek. The Buddy Squadron exercise will run till Friday and is aimed at enhancing interoperability and integrated tactical capabilities between the two allies. This year, the number of participating aircraft per [...]",
    "source": "The Indian Awaaz",
    "publishedAt": "2026-02-09 08:13:52",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://theindianawaaz.com/south-korean-us-commences-joint-aerial-exercise-buddy-squadron/"
  },
  {
    "title": "Travel Woes Ahead: 100-Hour Snowstorm to Affect UK and European Destinations like London and New York",
    "description": "Travel Woes Ahead: 100-Hour Snowstorm to Affect UK and European Destinations like London and New YorkUK weather maps show heavy snow and blizzard-like conditions could last for over 100 hours, causing potential travel disruption. Here's what you need to know.The post Travel Woes Ahead: 100-Hour Snowstorm to Affect UK and European Destinations like London and New York appeared first on Travel And Tour World.",
    "source": "Travel And Tour World",
    "publishedAt": "2026-02-09 08:13:52",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.travelandtourworld.com/news/article/travel-woes-ahead-100-hour-snowstorm-to-affect-uk-and-european-destinations-like-london-and-new-york/"
  }
]