[
  {
    "title": "aaron1",
    "description": "Click here to view this image from theadvocate.com.",
    "source": "The Advocate",
    "publishedAt": "2025-12-16 23:18:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.theadvocate.com/aaron1/image_fb7f5c23-3d99-4c13-bc23-dfd6543b3767.html"
  },
  {
    "title": "A&M Consolidated High School hit by graffiti on Tuesday",
    "description": "A&M Consolidated was vandalized on Tuesday morning before school as unknown suspects painted graffiti around the front of the campus.",
    "source": "The Eagle",
    "publishedAt": "2025-12-16 23:18:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://theeagle.com/news/local/crime-courts/article_a3b7b22d-2181-42ee-ace1-da7ff985bfb9.html"
  },
  {
    "title": "Rivian Doesn't Need Nvidia for Self-Driving Cars. Should Nvidia Investors Be Worried?",
    "description": "Rivian's plan to ship an in-house autonomy chip is another sign that customers want options beyond Nvidia.",
    "source": "Fool",
    "publishedAt": "2025-12-16 23:18:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.fool.com/investing/2025/12/16/rivian-doesnt-need-nvidia-for-self-driving-cars-sh/"
  },
  {
    "title": "USC and Brown cancel men's basketball game after mass shooting on RI campus",
    "description": "LOS ANGELES (AP) — The men's basketball game between Brown and Southern California scheduled for Sunday in Los Angeles has been canceled. So has the women's game against Monmouth, which was set for Sunday in Rhode Island.",
    "source": "The Sun Chronicle",
    "publishedAt": "2025-12-16 23:18:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.thesunchronicle.com/zz/1/usc-and-brown-cancel-mens-basketball-game-after-mass-shooting-on-ri-campus/article_5c4051a7-7ecc-56a5-814a-9cca45728356.html"
  },
  {
    "title": "Pulaski Lady Thunder win Holiday Hoopfest",
    "description": "The Pulaski Lady Thunder seventh grade squad was able to defeat multiple AAU teams in the Richmond Heat Holiday Hoopfest tournament over the weekend, claiming the seventh grade title. Coached by Tony Bowling and Sean Ross, this team made up of mostly fifth and sixth graders playing up proved that the future of Pulaski basketball is very bright. In the championship game against the Harlan ...",
    "source": "Yahoo! News",
    "publishedAt": "2025-12-16 23:18:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://sports.yahoo.com/articles/pulaski-lady-thunder-win-holiday-231800810.html"
  },
  {
    "title": "Venezuela EXPLODES: Pro-Maduro Rallies Sweep Caracas After Trump Seizes Oil Tanker | Watch",
    "description": "Thousands of Venezuelans poured into the streets of Caracas, defiantly rejecting U.S. pressure and President Donald Trump’s warnings that President Nicolás Maduro’s time in power is limited. The mass march, held on the anniversary of Venezuela’s constitution, featured anti-imperialist chants, national flags, and speeches condemning U.S. sanctions, oil seizures, and expanding military operations in the Caribbean. Protesters insisted that Venezuela’s leadership is decided by its people, not Washington. The demonstrations come amid rising tensions following U.S. maritime strikes, tanker interceptions, and new sanctions, fueling fears of escalation between Caracas and Washington.",
    "source": "The Times Of India",
    "publishedAt": "2025-12-16 23:17:59",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://timesofindia.indiatimes.com/videos/international/venezuela-explodes-pro-maduro-rallies-sweep-caracas-after-trump-seizes-oil-tanker-watch/videoshow/126019820.cms"
  },
  {
    "title": "Rapper Kay Flock sentenced to 30 years in prison for conviction in shootings",
    "description": "New York, Dec 17 (AP) Rapper Kay Flock was sentenced Tuesday to 30 years in prison for a series of",
    "source": "The Week",
    "publishedAt": "2025-12-16 23:17:59",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.theweek.in/wire-updates/international/2025/12/17/fes10-us-rapper-kay-flock-sentencing.html"
  },
  {
    "title": "Late change: Steve Smith out as Australia bat first",
    "description": null,
    "source": "Yarrawonga Chronicle",
    "publishedAt": "2025-12-16 23:17:59",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.yarrawongachronicle.com.au/cricket/late-change-steve-smith-out-as-australia-bat-first/"
  },
  {
    "title": "Primary Care Alberta warning against children swallowing button batteries",
    "description": "Primary Care Alberta is reminding about the risks button batteries can pose to children if swallowed.As the holiday season gets into full swing, many ...",
    "source": "Lethbridge News Now",
    "publishedAt": "2025-12-16 23:17:55",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://lethbridgenewsnow.com/2025/12/16/primary-care-alberta-warning-against-children-swallowing-button-batteries/"
  },
  {
    "title": "'Nice-ish retired lady' Susie Wiles ripped by ex-Trump official as president runs amok",
    "description": "The bombshell leak of damning comments made by longtime Donald Trump strategist Susie Wiles, who, among other things, said the president has an \"alcoholic's personality,\" are a key demonstration of how powerless she and the rest of Trump's inner circle are to restrain his basest impulses, former Homeland Security staffer Miles Taylor told MS NOW's Nicolle Wallace on Tuesday.\"Miles, I'm dying to know what you think,\" said Nicolle.\"Well, a couple of things,\" said Taylor, who famously wrote the New York Times op-ed describing a \"resistance\" within Trump's first administration. \"I mean, Nicolle, when I first read this, my immediate reaction was, okay, Susie Wiles is admitting what we have long known about Donald Trump, that the guy wears his heart on his sleeve. But as you noted, she also blew his cover that he wears lawlessness as a badge of honor. I mean, she just gave that up completely and in ways that can materially affect some of the cases that they have against Trump's enemies.\"In fact, Taylor argued, Wiles' outright admissions that the Trump Justice Department's criminal prosecutions of opponents like New York Attorney General Letitia James are vindictive — and \"she'll give people like Letitia James and others some of the legal support they need to make a direct connection between the president's official abuses of power and the actions being taken against them.\"\"But piece number two, Nicolle, I really felt like comparing her to my former boss, John Kelly,\" said Taylor. \"She seems a lot more like a bystander in the Oval Office, a lot more like a bystander. She comes off in these interviews like a nice-ish retired lady who says, 'yeah, Mr. President, that might be bad,' but doesn't really do anything to stop it. In fact, says avowedly that her agenda, even if she doesn't agree with it, is to go make the things happen, seemingly implying that the lawlessness is something she puts up with.\"She then went even further, Taylor added. \"That quote you said earlier, Nicolle, that Donald Trump has a view in her words, that there is nothing he cannot do. Nothing. Zero. That's just a full admission that this man doesn't believe he can be stopped by anything. Not by the law, not by the Constitution. And her job is to make that happen. That's scary as hell. And John Kelly's view was diametrically opposite of Susie Wiles' view. His view was, 'No, I cannot and should not tell the president he can do illegal things, and I should help him create off-ramps from doing illegal things and to comply with his duties under the U.S. Constitution.'\" - YouTube youtu.be",
    "source": "Raw Story",
    "publishedAt": "2025-12-16 23:17:54",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.rawstory.com/susie-wiles-2674405334/"
  }
]