[
  {
    "title": "How Costa Rica’s 2026 Tax Changes Benefit Digital Nomads and Expats",
    "description": "Independent workers across Costa Rica will soon have a simpler way to handle their income taxes. Starting January 1, 2026, a reform to the Income Tax Law lets them deduct 25% of their gross income without needing receipts or other proof. This change, part of Law No. 10667 approved earlier this year, aims to cut [...]The post How Costa Rica’s 2026 Tax Changes Benefit Digital Nomads and Expats appeared first on The Tico Times | Costa Rica News | Travel | Real Estate.",
    "source": "Tico Times",
    "publishedAt": "2025-12-21 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://ticotimes.net/2025/12/21/how-costa-ricas-2026-tax-changes-benefit-digital-nomads-and-expats"
  },
  {
    "title": "Richmond police ask for public's help finding missing 17-year-old",
    "description": "The teen was last seen on Saturday, Dec. 20, 2025 around 11 a.m.",
    "source": "Richmond News",
    "publishedAt": "2025-12-21 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.richmond-news.com/local-news/richmond-bc-police-ask-publics-help-finding-missing-teen-11654907"
  },
  {
    "title": "LauraLynn's home service praised for helping Kerry family through 'extremely stressful time'",
    "description": "The Falveys in Annascaul were one of the first families to sign up when the community regional service was launched, and they are now one of the more than 100 families in Munster who have since benefitted",
    "source": "Irish Examiner",
    "publishedAt": "2025-12-21 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.irishexaminer.com/news/munster/arid-41760506.html"
  },
  {
    "title": "Arne Slot BLOCKS early Liverpool transfer",
    "description": "Arne Slot has reportedly blocked an early Liverpool transfer. The boss has said no to the deal ahead of January.Liverpool’s January transfer plans will be in full swing as the window prepares to ope...",
    "source": "Yahoo! News",
    "publishedAt": "2025-12-21 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://ca.sports.yahoo.com/news/arne-slot-blocks-early-liverpool-201000185.html"
  },
  {
    "title": "How To Master The Wall-To-Wall Carpet Trend Without Looking Dated",
    "description": "If you're looking to bring back carpet into the home, this modern, cozy wall-to-wall carpeting option might just be right for you and your family.",
    "source": "Yahoo! News",
    "publishedAt": "2025-12-21 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://ca.style.yahoo.com/master-wall-wall-carpet-trend-201000603.html"
  },
  {
    "title": "Gamecocks have another coaching vacancy to fill; Move could affect explosive player",
    "description": "South Carolina has another spot to fill on its football coaching staff. Sterling Lucas is on the move to another spot in the SEC, and the fear is that some players may follow him.",
    "source": "Postandcourier",
    "publishedAt": "2025-12-21 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.postandcourier.com/sports/carolina/gamecocks-sterling-lucas-defense-assistant-coach-lsu/article_661fc9d0-d9d2-4f80-8508-1ba1c7c1b16c.html"
  },
  {
    "title": "\"Dollar Store Obama\": House Oversight Chair James Comer Torches Hakeem Jeffries",
    "description": "\"Dollar Store Obama\": House Oversight Chair James Comer Torches Hakeem Jeffries Authored by Steve Watson via Modernity.news,House Oversight Committee Chairman James Comer isn’t backing down from his probe into the massive Somali-led fraud draining Minnesota’s social services, slamming Democrat Minority Leader Hakeem Jeffries for shielding the scandal with personal attacks.With federal investigations now revealing losses potentially exceeding $9 billion across multiple state-run programs, Comer’s takedown highlights how unchecked immigration policies have enabled epic taxpayer rip-offs under Democrat watch.Comer launched the investigation earlier this month, targeting widespread fraud in Minnesota’s welfare and social services exploited by Somali immigrants. In a letter to Governor Tim Walz and Attorney General Keith Ellison, he demanded answers on the theft of billions from state and federal coffers.?BREAKING: Rep. Comer UNLEASHES on Hakeem Jeffries after Jeffries attacks him over the Tim Walz fraud investigation:“Everyone sees how he tries to imitate Obama! They wonder why he’s got the nickname, ‘DOLLAR STORE OBAMA!’ He’s a low-IQ.” ?pic.twitter.com/A93lNqpd8r— Jack (@jackunheard) December 20, 2025“The Committee on Oversight and Government Reform is investigating reports of widespread fraud in Minnesota’s social services programs. The Committee has serious concerns about how you as the Governor, and the Democrat-controlled administration, allowed millions of dollars to be stolen. The Committee also has concerns that you and your administration were fully aware of this fraud and chose not to act for fear of political retaliation,” Comer wrote.He added, “The Committee therefore requests documents and communications showing what your administration knew about this fraud and whether you took action to limit or halt the investigation into this widespread fraud.”The probe follows reports of schemes like the Feeding Our Future scandal, where fraudsters siphoned off funds meant for child nutrition, autism services, and housing aid. Federal prosecutors recently charged six more defendants in related autism and housing frauds, with one pleading guilty, as part of an ongoing crackdown.Latest updates from U.S. attorneys indicate fraud in 14 Minnesota programs could top $9 billion, swamping state resources and prompting Treasury probes into potential terrorism ties. Governor Tim Walz, facing heat, admitted accountability but vowed fixes amid mounting charges.When pressed on Walz and Ellison’s cooperation, Jeffries dodged the question and unleashed insults, labeling Comer “a joke, an embarrassment, an unserious individual, and a malignant clown.”Comer fired back hard, dismissing the barbs and turning the tables on Jeffries’ hypocrisy.“That’s the third time he’s called me a clown. Look, everyone that watches his interviews and sees how he tries to imitate Obama, they wonder why he’s got the nickname Dollar Store Obama. Look, he’s a low-IQ individual who has to resort to name-calling; that’s what he criticizes Donald Trump over. I don’t care what he calls me. He can come to Kentucky and campaign against me. I’ll pay for his gas bill,” Comer said.“But at the end of the day, to defend Tim Walz is going to be a huge mistake for the Democrats because everyone in Minnesota knows that this fraud has been taking place for a long time. All I’m doing is my job, getting the backs of the taxpayers. If Hakeem Jeffries doesn’t like it, he can go fly a kite because, at the end of the day, the American people expect their tax dollars to be spent wisely.”Adding fuel to the fire, Trump advisor Stephen Miller framed the scandal’s scale on Fox News, comparing it to Somalia’s GDP and blasting the importation of criminal elements.“Well, first of all, regarding the situation in Minnesota, by the way, not just Minnesota — we have Somali refugees that were dumped here by Democrats in Ohio and Massachusetts. Let me just say we should not be shocked. When you import a population whose primary occupation is pirate, that they are going to come here and steal everything we have,” Miller said.“Somalia has this giant coastline, and the only industry they have created, after hundreds of years is piracy, stealing what anyone going through who has actually built something has made. So, yes, the pirates have stolen all of our money, and they have to go home, Jesse. That’s the situation we’re in right now,” Miller further urged.Miller continued: “So he has presided over — this corrupt, incompetent loser has presided over the largest theft of American taxpayer dollars in history. It’s never been equal before. The amount of money that’s been stolen is larger than the entire GDP of Somalia. In other words, the Somalians they brought here have theft and more than all the Somalians in Somalia have ever created for themselves in all the time that has existed up until now.”“So there needs to be a lot of people going to jail. And I can promise you, the Department of Justice is launching an investigation that is commensurate in force and in purpose with the scope, scale, size and magnitude of this controversy,” Miller declared.Stephen Miller on the Somalis ripping off Americans in Minnesota:“The pirates have stolen our money and they have to go home, Jessie.”This whole clip is great. Enjoy.pic.twitter.com/dxQfLsowuO— Paul A. Szypula ?? (@Bubblebathgirl) December 20, 2025This explosive exchange underscores the failures of open-border policies, where America First priorities get trampled by globalist agendas that prioritize foreign grifters over hardworking Americans.Your support is crucial in helping us defeat mass censorship. Please consider donating via Locals or check out our unique merch. Follow us on X @ModernityNews. Tyler DurdenSun, 12/21/2025 - 15:10",
    "source": "Zerohedge",
    "publishedAt": "2025-12-21 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.zerohedge.com/political/dollar-store-obama-house-oversight-chair-james-comer-torches-hakeem-jeffries"
  },
  {
    "title": "Andrew Tate running away from Jake Paul fight - 'I'm not ready'",
    "description": "Andrew Tate shut down the possibility of facing Jake Paul after the social media stars were both defeated in their boxing matches.",
    "source": "Daily Express Us",
    "publishedAt": "2025-12-21 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.the-express.com/sport/boxing/194059/andrew-tate-jake-paul-fight"
  },
  {
    "title": "Pittsburgh Steelers vs. Detroit Lions: Inactives for Week 16 matchup",
    "description": "The Pittsburgh Steelers have released their list of inactives for Sunday’s Week 16 road game against the Detroit Lions. Pittsburgh, looking to improve upon its 8-6 record and extend its lead in the AFC North, will be down some key players in Detroit.",
    "source": "Yardbarker",
    "publishedAt": "2025-12-21 20:09:56",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.yardbarker.com/nfl/articles/pittsburgh_steelers_vs_detroit_lions_inactives_for_week_16_matchup/s1_17236_43234280"
  },
  {
    "title": "Opposition Blames EVMs, EC for Their Defeat",
    "description": "Maharashtra Congress president Harshwardhan Sapkal alleged that the ruling parties won due to Election Commission’s ‘blessing’ and the verdict does not reflect people’s mandate.",
    "source": "Andhrabhoomi",
    "publishedAt": "2025-12-21 20:09:53",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.deccanchronicle.com/nation/opposition-blames-evms-ec-for-their-defeat-1925517"
  }
]