[
  {
    "title": "Buium, Demko lead Canucks to 2-1 win over Devils as post-Hughes era begins",
    "description": "Vancouver visits the New York Rangers on Tuesday",
    "source": "Burns Lake",
    "publishedAt": "2025-12-14 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://burnslakelakesdistrictnews.com/2025/12/14/buium-demko-lead-canucks-to-2-1-win-over-devils-as-post-hughes-era-begins/"
  },
  {
    "title": "Gunman Who Killed 3 Americans In Syria Was Member of Syrian Government Forces",
    "description": "Gunman Who Killed 3 Americans In Syria Was Member of Syrian Government Forces Authored by Dave DeCamp via AntiWar.comThe gunman who killed two members of the Iowa National Guard and an American civilian interpreter in an attack in Palmyra, central Syria, on Saturday was a member of the Syrian government’s security forces, according to the Syrian Interior Ministry.The Syrian Observatory for Human Rights (SOHR) first reported that the attacker was a member of the security forces and called for the Syrian government, which is led by Hayat Tahrir al-Sham, an offshoot of al-Qaeda, to get rid of members who have an \"ISIS ideology.\"The Syrian Interior Ministry claimed that, before the attack, Syrian authorities had \"decided to fire him\" for having \"extremist Islamist ideology\" and had planned to do so on Sunday. \"We discovered him in December and were going to dismiss him, but we didn’t make it in time because it was a holiday,\" said ministry spokesman Nour al-Din al-Baba, according to The Cradle.US Army Sergeant with a translator & two Syrian soldiers during a training in Syria on April 30, 2025. US Army photoA Syrian security official told AFP that the attacker had been in the security forces \"for more than 10 months and was posted to several cities before being transferred to Palmyra.\"According to Wael Essam, a Palestinian journalist who has covered the conflict in Syria for many years, the perpetrator has been identified as Tariq Satouf al-Hamd from the Aleppo countryside. Essam said that al-Hamd was previously a member of ISIS, but after the fall of former President Bashar al-Assad, he traveled to Idlib, the former home base of HTS, and joined the General Security.The attack occurred when US military officers were meeting with Syrian Interior Ministry officials while US and Syrian troops stood guard at a base near the city of Palmyra. According to The Wall Street Journal, a lone gunman appeared in a window and opened fire on the US and Syrian soldiers, and he was pursued by Syrian troops and killed. However, according to Essam’s report, the attacker blew himself up.\"The attacker tried to reach the meeting room in the headquarters of the General Security in Palmyra (formerly the Military Security headquarters) where senior officers are present, and in the corridor he clashed with the American guards and the translator and blew himself up,\" Essam wrote on X.Essam also suggested that other members of the Syrian security forces were involved in the attack. \"Security sources confirmed to me that Syrian intelligence, along with the Coalition forces, arrested six elements from the General Security at the headquarters in Palmyra, accused of coordinating the operation with him, and it is said that they are from the group that moved with him from the desert to the General Security in Idlib,\" he said.He added that Syrian authorities were “unable to identify his previous affiliation with the organization (ISIS), and there are hundreds like him, due to the large numbers who joined and which the security apparatus needed after the fall of the regime.”President Trump and other US officials have called the incident an \"ISIS attack\" and have left out the detail that the perpetrator was a member of the Syrian military, which the US has allied itself with despite HTS’s al-Qaeda past, and as of Sunday, ISIS hasn’t taken credit for the shooting.\"This was an ISIS attack against the US, and Syria, in a very dangerous part of Syria, that is not fully controlled by them,\" Trump wrote on Truth Social.He added that Syrian President Ahmed al-Sharaa is \"extremely angry\" about the attack. Trump recently hosted Sharaa at the White House despite his past as an al-Qaeda leader and ally of Abu Bakr al-Baghdadi, the founder of ISIS.The Syrian government itself has contradicted the below Trump claims...Trump on Syria:We had 3 great patriots terminated by bad people.It was not the Syrian government, it was ISIS.The Syrian government fought by our side. pic.twitter.com/oIO0ntdHvL— Clash Report (@clashreport) December 14, 2025Both Trump and US Secretary of War Pete Hegseth vowed there would be retaliation for the attack, and according to the SOHR, there’s been an escalation of US operations in the region, including surveillance flights and arrests of people on suspicion of \"affiliating with ISIS and/or adopting its ideology.\"The Syrian government has also announced its escalating operations against Syria. During Sharaa’s visit to the Oval Office, his government officially joined the US-led anti-ISIS coalition despite its al-Qaeda links and many of its soldiers having a similar ideology to ISIS, putting US troops operating in Syria at risk of insider attacks. Tyler DurdenSun, 12/14/2025 - 15:10",
    "source": "Zerohedge",
    "publishedAt": "2025-12-14 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.zerohedge.com/geopolitical/gunman-who-killed-3-americans-syria-was-member-syrian-government-forces"
  },
  {
    "title": "Buium, Demko lead Canucks to 2-1 win over Devils as post-Hughes era begins",
    "description": "Vancouver visits the New York Rangers on Tuesday",
    "source": "Kimberley Bulletin",
    "publishedAt": "2025-12-14 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://kimberleybulletin.com/2025/12/14/buium-demko-lead-canucks-to-2-1-win-over-devils-as-post-hughes-era-begins/"
  },
  {
    "title": "Buium, Demko lead Canucks to 2-1 win over Devils as post-Hughes era begins",
    "description": "Vancouver visits the New York Rangers on Tuesday",
    "source": "Saanich News",
    "publishedAt": "2025-12-14 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://saanichnews.com/2025/12/14/buium-demko-lead-canucks-to-2-1-win-over-devils-as-post-hughes-era-begins/"
  },
  {
    "title": "Buium, Demko lead Canucks to 2-1 win over Devils as post-Hughes era begins",
    "description": "Vancouver visits the New York Rangers on Tuesday",
    "source": "Campbell River Mirror",
    "publishedAt": "2025-12-14 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://campbellrivermirror.com/2025/12/14/buium-demko-lead-canucks-to-2-1-win-over-devils-as-post-hughes-era-begins/"
  },
  {
    "title": "Buium, Demko lead Canucks to 2-1 win over Devils as post-Hughes era begins",
    "description": "Vancouver visits the New York Rangers on Tuesday",
    "source": "The Abbotsford News",
    "publishedAt": "2025-12-14 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://abbynews.com/2025/12/14/buium-demko-lead-canucks-to-2-1-win-over-devils-as-post-hughes-era-begins/"
  },
  {
    "title": "Clemson Tigers Miss Out on Former G-League Guard",
    "description": "Clemson missed out on a former G-League guard on Friday, a decision that emphasizes the NCAA’s changing stance on pro experience and roster construction.",
    "source": "Si",
    "publishedAt": "2025-12-14 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.si.com/college/clemson/basketball/clemson-tigers-miss-out-former-g-league-guard"
  },
  {
    "title": "Bison rally defense, win shootout thriller vs. Kansas City",
    "description": "A fast start, steady goaltending and a perfect shootout lifted the Bison to a 3-2 win over the Kansas City Mavericks Mavericks at Grossinger Motors Arena.",
    "source": "Pantagraph",
    "publishedAt": "2025-12-14 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://pantagraph.com/sports/hockey/minor/bison/article_b6407522-55c1-435e-bff3-a856ae56f99a.html"
  },
  {
    "title": "Bison rally defense, win shootout thriller vs. Kansas City",
    "description": "A fast start, steady goaltending and a perfect shootout lifted the Bison to a 3-2 win over the Kansas City Mavericks Mavericks at Grossinger Motors Arena.",
    "source": "Herald & Review",
    "publishedAt": "2025-12-14 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://herald-review.com/sports/hockey/minor/bison/article_0f7e4c71-85fa-5ba2-9497-6edc884f9695.html"
  },
  {
    "title": "Hugo Ekitike regen is coming to join Liverpool's first-team",
    "description": "Hugo Ekitike's regen is coming to Liverpool's first-team very soon. It's fair to say that right now the Frenchman is becoming a fan favourite at Anfield. Ekitike has grown and grown in stature since j...",
    "source": "Yahoo! News",
    "publishedAt": "2025-12-14 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://sports.yahoo.com/articles/hugo-ekitike-regen-coming-join-201000973.html"
  }
]