[
  {
    "title": "Police probe as Mercedes set ablaze in SW Delhi",
    "description": null,
    "source": "The Times Of India",
    "publishedAt": "2026-01-11 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://timesofindia.indiatimes.com/city/delhi/police-probe-as-mercedes-set-ablaze-in-sw-delhi/articleshow/126469202.cms"
  },
  {
    "title": "Target's 'Elegant' 3-Piece Duvet Set Is 'Perfect in Every Way'",
    "description": "It looks so high-end.",
    "source": "Capjournal",
    "publishedAt": "2026-01-11 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.capjournal.com/arena/lifestyle_entertainment/targets-elegant-3-piece-duvet-set-is-perfect-in-every-way/article_187ba55c-eb76-5852-8091-ac9d8008f9e6.html"
  },
  {
    "title": "Sarri: Just one Lazio target this season",
    "description": "Maurizio Sarri admits it was ‘not easy’ to beat Hellas Verona away and hopes Lazio will sign ‘two or three players’ in the summer to make a further step forward.The Biancocelesti secured a 1-0...",
    "source": "Yahoo! News",
    "publishedAt": "2026-01-11 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://ca.sports.yahoo.com/news/sarri-just-one-lazio-target-201000814.html"
  },
  {
    "title": "Roob's Observations after an excruciating Eagles loss to end season",
    "description": "This is a game you can’t lose. At home with a healthy roster coming off a week of rest against a team with an endless array of injuries to key players that had to fly across the country and play on the road and lost one of the greatest tight ends ever in the second quarter? With a six-point lead going into the fourth quarter? Yeah, you can’t lose that game.But the Eagles did.The Eagles’ season is over thanks to an excruciating 23-19 loss to the underdog 49ers in a wild-card round game at the Linc. Defense? Not good enough. Offense? Not good enough. Coaching? Not good enough.Terrible loss. Awful way to end the season.This was Nick Sirianni’s first home playoff loss and only the Eagles’ eighth home postseason loss all-time in 29 games.Ouch.1. Nineteen points. Why should we have expected any more than that? Why should we have expected an offense that hasn’t scored more than 19 points against a winning team since Week 3 against the Rams to suddenly become functional? Once again, the offense just was not good enough, and when you have this kind of talent across the board and you underachieve week after week you have to look at the offensive coaches. Not just Kevin Patullo but all of them starting with Nick Sirianni. The Eagles had so many opportunities in the second half – drives that began at their own 48, the 49ers’ 46, then their own 35, 38 and 35 – and managed just two field goals? That’s inexcusable. What is this offense? What are they trying to do? They like talking about identity, but hey don’t have an identity. Except hoping the defense bails them out after another terrible performance. I don’t know how you have this kind of talent on offense and you can be this consistently unproductive and just boring. And unless there are major changes this offseason, starting with the play caller, there’s no reason to believe it’s going to change.2. Last play of the game. Fourth-and-11 on the 49ers’ 21-yard-line. Season on the line. Biggest play of the season. Eagles call timeout, Kevin Patullo and Nick Sirianni huddle together with Jalen Hurts, and all they can come up with is a play where nobody is open and Hurts throws into triple coverage, trying to squeeze the ball into an impossible window to Dallas Goedert. It’s just unbelievable to me that in that situation – with the freaking season on the line – that’s the best they could come up with. A play where nobody was open and they had no chance to convert. You have all offseason to come up with a play to use in that situation. OTAs, training camp, four months of the season. And that’s what you come up with? A play that has no shot to work? That’s a situation offensive coaches should relish, and when you look around the NFL you see other teams converting those kinds of situations. That was such an opportunity for an unforgettable moment, and the Eagles just came up incredibly small.3. It’s easy to put this all on the offense, and they deserve a big chunk of the blame. But with the game on the line late in the fourth quarter and the Eagles holding a 19-17 lead, the Eagles’ vaunted defense gave up a 10-play, 66-yard touchdown drive. The defense did some good things against the undermanned 49ers, got a couple takeaways, but ultimately they came up small, allowing two 4th-quarter touchdowns on long drives in a game When it mattered the most, this group underachieved. The Eagles never would have won 11 games or reached the playoffs without this defense playing at an elite level the second half of the season, but on Sunday they just weren’t good enough when they had to be. They gave up 361 yards, 6-for-11 on third down and gave up big plays to guys who really have no business making big plays in a playoff game against the Eagles at the Linc – Demarcus Robinson and Jauan Jennings. It’s one thing getting beat by Christian McCaffrey and George Kittle, but Demarcus Robinson and Jauan Jennings? Can’t happen. The Eagles got the two interceptions by Quinyon Mitchell, but they couldn’t pressure Brock Purdy, allowed a touchdown on a halfback option and allowed 13 points in the fourth quarter of a home playoff game. Great year for the defense but not a great finish.4. What on Earth is going on with A.J. Brown? If you want to call yourself the best in the league, you catch those passes. Biggest game of the year and you drop three passes? And then get into some sort of altercation with your coach on the sideline? What happened to him? Terrible sequence late in the second quarter when he had two opportunities to make big plays on perfect deep balls from Jalen Hurts but seemed to slow down on the first one instead of making a full effort to the ball and then just missed the second one. Although there could have been DPI on Renardo Green, he still should have caught it. Either one would have been a big gain when the Eagles could have used it, but he came up empty both times. Then he had a terrible drop on the Eagles’ final drive, although Dallas Goedert picked him up with a 15-yard catch and run for a first down on fourth down. Brown finished with just three catches for 25 yards. He’s got to be better than this. And yeah I would not be surprised if he’s not here next year. Great player and we’ll have plenty of time to talk about his future, but it just kind of seems like it’s run its course here. If this was his last game in an Eagles uniform, it might have been his worst.5. He made his two field goals, but Jake Elliott missed a PAT after the Eagles’ first touchdown, and you never know how the game would have played out, but on that final drive you’re down by four when you quite likely could have been down by three if he made a PAT. In the immortal words of Andy Reid, “We can all count.” Elliott was one of the worst kickers in the NFL this year and he’s an NFL-worst 5-for-15 from 50 yards and out over the last two years. And he’s now missed four PATs in the last two postseasons. He’s been a hell of a kicker for this team since 2017, but the Eagles are going to have to figure out who’s going to be kicking for this team in 2026. Because I’m not sure you can run it back again with Elliott.6. I don’t think Jalen Hurts was terrible, and his numbers would have looked a lot better if A.J. caught a few of the balls he dropped and if DeVonta Smith caught the one he dropped in the fourth quarter. And Saquon Barkley had a drop as well. And I don’t think he got a ton of help from his play caller either. But I just expect more from Hurts, and really that goes for the whole second half of the season. He wasn’t bad, his numbers were generally good and he won some games. But he was rarely great, and after last year and really the first several years of his career you expect greatness. This is a quarterback who has always raised his level in the biggest moments, when the lights shine the brightest. Big runs or clutch passes. We saw it sporadically this year but not consistently. And we didn’t see it Sunday, although he obviously didn’t get a ton of help against the 49ers. He’s been so good in the postseason that it’s kind of shocking when he’s not. He wasn’t awful, but he had to be better.7. I really expected the Eagles’ pass rushers to have a big day against the 49ers. The way they’ve been playing the second half of the season – 31 sacks over the last 10 games – was really encouraging. But the Eagles only had one sack Sunday and it was from Jalen Carter. Their edge rushers were neutralized throughout, finishing with no sacks and one quarterback hit by Nolan Smith. The defensive line was the heart of this team over the past couple months, and the Eagles needed some of that pressure Sunday. There were times Brock Purdy was struggling to get anything going and it just felt like the d-line was one big hit or one big sack from really getting to Purdy, but it never happened. Jaelan Phillips is a free agent, Brandon Graham is expected to go back into retirement and Nolan Smith has one more year left on his rookie deal. The draft is still 3 1⁄2 months away, but sitting here tonight it just seems like edge makes the most sense in the first round. In a game like this, you need pass rush and the Eagles had it at times this year but not Sunday. Something they’ll have to address this offseason.8. The Eagles were one of the worst 4th-quarter teams in the NFL this year during the regular season, getting outscored 124-88. So the fact that they got outscored 13-3 in the fourth quarter Sunday shouldn’t be concerning. But it’s just another reflection on the coaching staff not having this team ready to play 60 minutes. Including the 13-3 Sunday, and this team was outscored 137-91 in the fourth quarter, which is embarrassing. The fourth quarter is when games are won and lost, and week after week the Eagles came up small in the fourth quarter. They lost four games this year that they led going into the fourth quarter, only the second time in franchise history they’ve done that. Shouldn’t happen once. Happened four times, including in the biggest game of the season. Inexcusable.9. I did not have 1st-team all-pro Quinyon Mitchell having his worst series of the year to open the postseason on my Bingo card. Q, who’s been one of the two or three-best corners in the NFL this year, allowed a 61-yard completion to Demarcus Robinson of all people on the 49ers’ second snap, then gave up a TD to Robinson two plays later. Robinson hadn’t had a catch that long since 2018 with the Chiefs and had only 276 yards and one TD during the regular season. He had more yards on that catch than in any entire game this year. And that was the longest reception Mitchell has ever allowed and only the second touchdown this year. But good for Q for forgetting about that and bouncing back with two interceptions. He now has four career postseason interceptions before his first regular-season interception. That first series was a nightmare for Q. The 61-yarder was the longest catch he’s ever allowed in two seasons. But he responded like you’d expect from an all-pro. Mitchell joins Roynell Young, Herm Edwards, Eric Allen and Damon Moore as the fifth Eagle with two INTs in a playoff game, and his four career postseason INTs are 2nd-most in franchise history, behind only Herm Edwards, who had five. Q always talks about having a short memory as a cornerback, and he certainly had that on Sunday.10. We have plenty of time to look at the future, but the biggest question facing the Eagles looking ahead is whether the window is closing on them being a championship contender. It’s not an easy question. There’s a lot of talent on this team, although it didn’t always feel like it, and I still think their roster is among the best in the NFC. And I don’t see a team in the NFC that’s head and shoulders better than the Eagles are. But for the Eagles to go on another Super Bowl run, they need elite coaching, which they didn’t have much of the season on offense, and they need Jalen Hurts to be elite, which he wasn’t always this year. They need Vic Fangio to come back with some reinforcements, but the pieces are in place for this to remain a top defense. A lot of fantastic young talent, although we didn’t see it Sunday. The Eagles have reached the playoffs five straight years, which speaks volumes to Roseman’s ability to replenish the roster with draft picks and a free agent or two and Sirianni’s ability to build a winning culture year after year as the roster has changed. If Howie can keep working his magic, Sirianni can continue to get 100 percent buy-in from his players and the Eagles can find a play caller who can get the most out of Hurts, there’s no question they can be among the class of the NFC in 2026. But there are some very important decisions to be made in the coming weeks and months, and if they make the wrong ones, the window could begin to close faster than anyone would like.",
    "source": "Nbc10 Philadelphia",
    "publishedAt": "2026-01-11 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.nbcphiladelphia.com/news/sports/nfl/philadelphia-eagles/roobs-observations-49ers-wild-card-jalen-hurts-brock-purdy/4331353/"
  },
  {
    "title": "Arne Slot now just one step away from being FIRED",
    "description": "Arne Slot's Liverpool future has been under constant scrutiny this season.The Dutchman led the Reds to the Premier League title last term and, although they started the 2025-26 season off well, things...",
    "source": "Yahoo! News",
    "publishedAt": "2026-01-11 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://ca.sports.yahoo.com/news/arne-slot-now-just-one-201000832.html"
  },
  {
    "title": "Millionaire’s pool house prompts row in Cotswolds - The Telegraph",
    "description": "Millionaire’s pool house prompts row in Cotswolds The Telegraph",
    "source": "Google News",
    "publishedAt": "2026-01-11 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxQWElOak1ubFFxSFNvV2loMVZsclNhRGFsbjJMZ2VsYkRZZzNRY1lqLTUwOWNDU1BMWkVLaXhGMWFGVmsyaEdXc3IyQmpoc3F6TnB6b1U3ZWYwZ2RHc082MFUyWGxRM1BlQnAyMTZ3UUhmcFYwNFZ0eHpMOUVSUkNUZnVVS3VhdVhyZ2JRUEhMYlp4WkZlMFE?oc=5"
  },
  {
    "title": "Ukraine planning further talks with United States – Zelensky",
    "description": "Ukraine is planning a schedule of meetings and further negotiations with the United States.",
    "source": "Ukrinform",
    "publishedAt": "2026-01-11 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.ukrinform.net/rubric-polytics/4079210-ukraine-planning-further-talks-with-united-states-zelensky.html"
  },
  {
    "title": "Street fight turns bloody as innocent bystander shot in the face",
    "description": "Street fight turns bloody as innocent bystander shot in the faceA bystander was shot in the face after a violent confrontation between two men went out of control in San Antonio.According to the San Antonio Police Department, officers responded to the 9100 block of Perrin Beitel Road after...",
    "source": "The News International",
    "publishedAt": "2026-01-11 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.thenews.com.pk/latest/1388057-street-fight-turns-bloody-as-innocent-bystander-shot-in-the-face"
  },
  {
    "title": "Manuel Neuer showers Michael Olise with praise after dominant display for Bayern Munich against VfL Wolfsburg",
    "description": "Olise starred in FC Bayern’s huge 8-1 win.",
    "source": "Bayern Munich",
    "publishedAt": "2026-01-11 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.bavarianfootballworks.com/bayern-munich-bundesliga/159093/manuel-neuer-showers-michael-olise-with-praise-after-dominant-display-for-bayern-munich-against-vfl-wolfsburg"
  },
  {
    "title": "8.42 lakh people currently receiving social security pensions: HP govt",
    "description": null,
    "source": "The Times Of India",
    "publishedAt": "2026-01-11 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://timesofindia.indiatimes.com/city/chandigarh/8-42-lakh-people-currently-receiving-social-security-pensions-hp-govt/articleshow/126469201.cms"
  }
]