[
  {
    "title": "Top crypto price predictions: Dash, Monero, Internet Computer (ICP)",
    "description": "The crypto market held steady today, Jan. 15, as investors reacted to the withdrawal of the Market Structure Bill, commonly known as CLARITY. Bitcoin was trading at $96,747, while the market capitalization of all tokens jumped to over $3.26 trillion. This article provides a forecast for top altcoins like Dash (DASH), Monero (XMR), and Internet [...]",
    "source": "Invezz",
    "publishedAt": "2026-01-15 08:06:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://invezz.com/news/2026/01/15/top-crypto-price-predictions-dash-monero-internet-computer-icp/"
  },
  {
    "title": "NI traffic alerts: M2 crash causing rush hour delays",
    "description": "Here’s the latest traffic and travel news from around Northern Ireland.",
    "source": "Belfast Telegraph",
    "publishedAt": "2026-01-15 08:06:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.belfasttelegraph.co.uk/news/northern-ireland/ni-traffic-alerts-m2-crash-causing-rush-hour-delays/a2042410450.html"
  },
  {
    "title": "Concern over lack of diet advice on weekends at Essex hospital after woman's death",
    "description": "Suzanne Pemberton died on September 16, 2024, at Colchester General Hospital from pneumonia and sepsis.",
    "source": "The Gazette",
    "publishedAt": "2026-01-15 08:06:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.gazette-news.co.uk/news/25767023.concern-weekend-cover-colchester-hospital/"
  },
  {
    "title": "Star Wars: Battlefront 2 – Community Project KYBER Brings New Content to the Game on PC",
    "description": "The project also includes 24/7 servers and immersive features such as proximity voice chat and stats tracking.KYBER, a custom server platform and mod launcher for Star Wars: Battlefront 2, has released its first content update of 2026 on PC. The update is available right now, allowing players to start playing immediately. At KYBER, we like pineapple on our pizza🍍🍕 In other ...",
    "source": "In Ign",
    "publishedAt": "2026-01-15 08:06:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://in.ign.com/star-wars-battlefront-sequel/250929/news/star-wars-battlefront-2-community-project-kyber-brings-new-content-to-the-game-on-pc"
  },
  {
    "title": "More turmoil for Bangladesh cricket: BPL match delayed as players take a firm stand against BCB",
    "description": "Amidst standoff with Bangladesh Cricket Board, no players reached the venue Match 25 of the Bangladesh Premier League (BPL) 2025-26 at the Shere Bangla National Stadium, Dhaka.",
    "source": "News9live",
    "publishedAt": "2026-01-15 08:06:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.news9live.com/sports/cricket-news/more-turmoil-for-bangladesh-cricket-bpl-match-delayed-as-players-take-a-firm-stand-against-bcb-2919801"
  },
  {
    "title": "Karnataka Vs Vidarbha Live Cricket Score, Vijay Hazare Trophy Semi-Final: Follow Scorecard And Match Action From Bengaluru",
    "description": "KAR vs VID Live Score, Vijay Hazare Trophy Semi-Final Match Updates: Follow all the action from Karnataka Cricket Team vs Vidarbha Cricket Team contest in Bengaluru.",
    "source": "News 18",
    "publishedAt": "2026-01-15 08:06:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.news18.com/cricket/karnataka-vs-madhya-pradesh-live-score-vijay-hazare-trophy-semi-final-kar-vs-vid-vht-match-today-toss-latest-scorecard-updates-liveblog-9832516.html"
  },
  {
    "title": "Malta-flagged oil tanker damaged in Black Sea drone attack",
    "description": "A Malta-flagged oil tanker was damaged by drones in the Black Sea this week, and Russia has blamed Ukraine for the attack, international media report.The tanker, called Matilda, is owned by a Greek company and was chartered by a Kazakh oil firm. It was sailing near the Russian port of Anapa in the Krasnodar region on January 13 when it was struck. No crew members were injured, and the ship later reached waters near Romania on Thursday.Russia's Foreign Ministry said the ship was hit by two Ukrainian drones. Greece condemned the attack and said its foreign minister would raise the issue with European partners. Kazakhstan also criticised the strike.The tanker was preparing to load oil when it was attacked. A fire broke out on board but was quickly put out. The ship's owners told Reuters that the damage can be repaired.Another tanker, Delta Harmony, was also reported to have been hit. Both vessels were heading toward the Yuzhnaya Ozereyevka oil terminal, which handles oil from Kazakhstan for international markets as well as some Russian crude.Ukraine has recently increased its drone attacks on Russian facilities as part of its effort to pressure Moscow during the war. The same oil terminal was targeted in November, and Kazakhstan's oil exports fell the following month.",
    "source": "Malta Independent",
    "publishedAt": "2026-01-15 08:06:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.independent.com.mt/articles/2026-01-15/local-news/Malta-flagged-oil-tanker-damaged-in-Black-Sea-drone-attack-6736286363"
  },
  {
    "title": "High Pollution, Winter And Poor Lifestyle Fuel Autoimmune Diseases In Women: AIIMS Doctor",
    "description": "The prevalence of autoimmune diseases is increasing, especially in women, and the ongoing winter season, along with high pollution, may be worsening the symptoms, said an expert from the All India Medical Sciences.",
    "source": "Ndtv",
    "publishedAt": "2026-01-15 08:06:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.ndtv.com/health/high-pollution-winter-and-poor-lifestyle-fuel-autoimmune-diseases-in-women-aiims-doctor-10754233"
  },
  {
    "title": "Duchess Sophie strengthens Princess Anne message with meaningful visit",
    "description": "Duchess Sophie strengthens Princess Anne message with meaningful visitThe Duchess of Edinburgh dove right into royal duties after Buckingham Palace released a heartfelt letter from Princess Anne about a challenging year.Sophie, who is dubbed as the ‘secret weapon’ for...",
    "source": "Geo Tv",
    "publishedAt": "2026-01-15 08:06:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.geo.tv/latest/645234-duchess-sophie-strengthens-princess-anne-message-with-meaningful-visit"
  },
  {
    "title": "Elon does it again",
    "description": "By building an eco-friendly lithium refinery in Texas in record time, Tesla’s maverick CEO Elon Musk has dramatically reduced America’s reliance on Chinese refiners.",
    "source": "News9live",
    "publishedAt": "2026-01-15 08:06:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.news9live.com/opinion-analysis/elon-does-it-again-2919812"
  }
]