[
  {
    "title": "Angry Birds 2 will send Red into outer space to celebrate in-game space event, literally",
    "description": "Now that the Angry Birds 2 Space event is underway, you'll soon get to see Red launched into outer space - and literally too, it seems. It's all kind of hush-hush at the moment, but you can tune in to the livestream at 12:00 PM PST to find out just how Red's intergalactic adventure will go. This all comes as part of the festivities since players have now hit the \"50.5 billion gathered feathers milestone\". It's pretty out-of-this-world, I'd say, so it's no surprise Rovio wants to keep the celebrations going by doing something incredibly intriguing. They will, apparently, \"send Red to the edge of Earth’s atmosphere and slingshot him back to Earth\" - and as for what that entails, exactly, we don't have to wait too long to find out. ... [MORE]",
    "source": "Pocketgamer",
    "publishedAt": "2025-11-07 08:04:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.pocketgamer.com/angry-birds-2/outer-space-launch/"
  },
  {
    "title": "iQIYI Concludes First Virtual Production Open Day, Showcasing How AI and Technology are Transforming Filmmaking",
    "description": "BEIJING, Nov. 7, 2025 /PRNewswire/ -- iQIYI, China's leading online entertainment platform, successfully hosted its inaugural Virtual Production Open Day on November 2 in Hengdian, Zhejiang Province, attracting nearly 200 seasoned film and television professionals. Liang ZHU, Vice President of iQIYI and Head of Intelligent Production, shared iQIYI's pragmatic approach to virtual production – developing efficient, user-friendly tools for content creators. The event further underscored iQIYI's pioneering leadership in technological innovation and industrialization. iQIYI is rapidly transforming China's content production landscape through virtual production technology. In 2025, the company's virtual production projects surged by 125% year-over-year, underscoring its growing influence. Notably, iQIYI achieved its first full-cycle collaboration on a major theatrical ...Full story available on Benzinga.com",
    "source": "Benzinga",
    "publishedAt": "2025-11-07 08:04:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.benzinga.com/pressreleases/25/11/n48712397/iqiyi-concludes-first-virtual-production-open-day-showcasing-how-ai-and-technology-are-transformin"
  },
  {
    "title": "Scores",
    "description": "High school basketball",
    "source": "Nwaonline",
    "publishedAt": "2025-11-07 08:04:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.nwaonline.com/news/2025/nov/07/scores/"
  },
  {
    "title": "Prince Harry's visa row back in spotlight as Andrew asked to testify in US",
    "description": "The Duke of Sussex's visa row has been dragged back into the spotlight after the latest development with his uncle Andrew Mountbatten Windsor.",
    "source": "Express",
    "publishedAt": "2025-11-07 08:04:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.express.co.uk/news/royal/2130852/prince-harrys-visa-row-andrew"
  },
  {
    "title": "Bears basking in glory of historic title run",
    "description": "Moscow, which earned its first-ever girls soccer state title last month, celebrated Thursday with a long parade and special event at Bear Den in Moscow",
    "source": "Dnews",
    "publishedAt": "2025-11-07 08:04:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.dnews.com/sports/bears-basking-in-glory-of-historic-title-run-d16af976"
  },
  {
    "title": "Workato Launches AI Lab in Singapore to Accelerate Applied AI Innovation and Talent Development",
    "description": "Supported by the Digital Industry Singapore (DISG), the AI Lab aims to advance Singapore's leadership in building an AI-enabled workforce for the future SINGAPORE, Nov. 7, 2025 /PRNewswire/ -- Workato®, the leader in agentic orchestration, announced today the launch of the Workato AI Lab in Singapore, marking a major milestone in its commitment to nurturing AI talent and driving real-world innovation through industry-academia collaboration. A strategic initiative supported by the Digital Industry Singapore (DISG), the AI Lab underscores Workato's commitment to accelerating AI adoption for businesses both locally and across the region. (L to R) Philbert Gomez, Executive Director and SVP, Digital Industry Singapore, Amlan Debnath, COO and Co-founder of Workato, Minister Josephine Teo, Minister for Digital Development and Information and Minister-in-charge of the Cyber Security Agency and Smart Nation Initiative and June Lee, SVP and GM, APAC, Workato The lab will focus on translational AI research, enabling the development of deployable solutions that address real-world business challenges. It will serve as a hub for collaboration between Workato, Institutes of Higher Learning (IHLs), and industry partners. Ee Shan Sim, Head of Workato's AI Lab Singapore, said: \"The launch of the AI Lab marks a significant step in Workato's ongoing commitment to advancing AI innovation through close collaboration with industry, public sector partners, and academia. By working together with postgraduate students, researchers, and business leaders, we are co-developing practical AI solutions that address real-world challenges and help shape the workforce of the future. This initiative is about creating meaningful connections between research and enterprise, ensuring that Singapore remains at the forefront of applied AI and talent development.\" \"We welcome Workato's decision to establish its first AI Lab outside of the US, in Singapore,\" said Philbert Gomez, Senior Vice President, Head and Executive Director, Digital Industry Singapore. \"This initiative will foster greater collaboration between Singapore's institutes of higher learning and industry partners, accelerating the translation of AI research into innovative applications. The co-development of automation and agentic AI solutions across multiple industry sectors will reinforce Singapore's position as a global leader in AI, and create exciting opportunities for our local workforce.\" AI Singapore to empower next generation of AI leaders The Lab is designed to create 65 high-value skilled jobs, foster breakthrough innovation, and deepen public-private partnerships within the Singapore AI ecosystem. By collaborating closely with Institutes of Higher Learning (IHLs), the AI Lab will advance applied AI research and practical solution deployment, providing thousands of students and educators with direct access to advanced AI automation tools and opportunities to participate in real-world industry projects. This initiative directly addresses the skills gap, equipping the workforce to meet evolving global hiring demands and ensuring Singapore remains at the forefront of digital transformation. The Lab will drive advancements in autonomous agents and multi-agent orchestration, enabling intelligent systems that can collaborate, adapt, and learn to address complex business challenges. By serving as a bridge between research and enterprise, it will translate breakthrough ideas into practical, deployable AI solutions that deliver measurable impact for organizations. Through close collaboration with academia, industry partners, government, and community, the Lab will also accelerate innovation in applied AI and cultivate a new generation of talent equipped with the skills and experience to thrive in an AI-powered economy. \"The launch of our AI Lab in Singapore marks a pivotal step toward realizing our vision of an AI-powered enterprise future. As we advance autonomous agents and multi-agent orchestration, we're not just building new technology—we're deepening the connection between people, processes, and technology. Singapore's vibrant innovation ecosystem and rich talent base make it the ideal hub to accelerate applied AI,\" said Vijay Tella, CEO and Co-founder, Workato. \"Through this Lab, we're uniting industry, academia, government and community to shape the next generation of intelligent, connected enterprises.\" The launch of the AI Lab builds on Workato's broader initiative—the AI Institute Alliance—which was unveiled during the World of Workato (WOW) 2025 conference in September. The alliance includes partnerships with leading education institutions such as Nanyang Polytechnic, Republic Polytechnic, Temasek Polytechnic, Singapore Polytechnic, Ngee Ann Polytechnic, Singapore University of Social Sciences, and the National University of Singapore. Through this alliance, Workato has already equipped over 3,000 students and educators with automation and integration skills. The AI Lab will deepen this impact by offering hands-on experience in building AI agents, digital twins, and generative AI applications for business transformation. Workato, recognized worldwide as the leading Agentic Orchestration company, empowers organizations to unify data, processes, and experiences through its AI-driven platform. With a strong and growing presence in Singapore and a global workforce exceeding 1,000 employees, Workato continues to set new benchmarks in business automation and workforce development, supporting over 12,000 customers worldwide. About Workato Workato transforms technology complexity into business opportunity. As the leading Agentic Orchestration company, Workato empowers enterprises to connect and unify data, processes, applications, and experiences. Its AI-driven platform enables teams to navigate complex workflows in real-time, driving efficiency and agility. Trusted by more than 12,000 global customers, Workato empowers organizations of every size to unlock new value and lead in today's fast-changing world. Learn how Workato helps businesses of all sizes achieve more at workato.com. ContactsKye Vern LeeWe. Communications on behalf of WorkatoWE-SGWorkato@we-worldwide.com",
    "source": "Pr Newswire Apac",
    "publishedAt": "2025-11-07 08:04:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://en.prnasia.com/story/510757-0.shtml"
  },
  {
    "title": "Workato Launches AI Lab in Singapore to Accelerate Applied AI Innovation and Talent Development",
    "description": "Supported by the Digital Industry Singapore (DISG), the AI Lab aims to advance Singapore's leadership in building an AI-enabled workforce for the future SINGAPORE, Nov. 7, 2025 /PRNewswire/ -- Workato®, the leader in agentic orchestration, announced today the launch of the Workato AI Lab...",
    "source": "Pr Newswire Apac",
    "publishedAt": "2025-11-07 08:04:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.prnewswire.com/apac/news-releases/workato-launches-ai-lab-in-singapore-to-accelerate-applied-ai-innovation-and-talent-development-302608463.html"
  },
  {
    "title": "Museum curator made a habit of monitoring flashes on the moon",
    "description": "Daichi Fujii has logged about 60 impacts on the Moon since 2011, giving astronomers fresh data on asteroid strike rates.",
    "source": "Jpost",
    "publishedAt": "2025-11-07 08:04:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.jpost.com/archaeology/article-872917"
  },
  {
    "title": "PM Shehbaz departs for Azerbaijan on two-day official visit",
    "description": "Prime Minister Shehbaz Sharif boards a Pakistan Air Force plane in this undated picture. — X/@PakPMO/FilePrime Minister Shehbaz Sharif departed for Azerbaijan on a two-day official visit from November 7-8 to take part in the celebrations marking the fifth anniversary of...",
    "source": "Geo Tv",
    "publishedAt": "2025-11-07 08:04:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.geo.tv/latest/632486-pm-shehbaz-departs-for-azerbaijan-on-two-day-official-visit"
  },
  {
    "title": "Asking Eric: Older brother not sure what to do with younger sibling’s constant ‘larger than life’ tales",
    "description": "He's tried to give advice, but his younger brother always bristles.",
    "source": "Oregon Local News",
    "publishedAt": "2025-11-07 08:04:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.oregonlive.com/entertainment/2025/11/asking-eric-older-brother-not-sure-what-to-do-with-younger-siblings-constant-larger-than-life-tales.html"
  }
]