[
  {
    "title": "Why California’s shifting population trends require a new ‘social contract’",
    "description": "Falling birth rates and lower migration are reducing the number of young people, while older residents age in place. USC Price’s Dowell Myers looks as the “top heavy” age imbalance and cope with it.",
    "source": "University Of Southern California",
    "publishedAt": "2025-11-19 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://today.usc.edu/why-californias-shifting-population-trends-require-a-new-social-contract/"
  },
  {
    "title": "KLN Secures Four Distinguished Honours in Sustainability and Excellence",
    "description": "HONG KONG, Nov. 19, 2025 /PRNewswire/ -- KLN Logistics Group Limited ('KLN'; Stock Code 0636.HK) has been awarded four prestigious accolades, including The Asset Corporate Sustainability Leadership Awards for the eighth consecutive year, receiving the Platinum Award this year ('The Asset...",
    "source": "Pr Newswire Apac",
    "publishedAt": "2025-11-19 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.prnewswire.com/apac/news-releases/kln-secures-four-distinguished-honours-in-sustainability-and-excellence-302619868.html"
  },
  {
    "title": "Allworth Financial LP Buys 1,544 Shares of e.l.f. Beauty $ELF",
    "description": "Allworth Financial LP increased its position in shares of e.l.f. Beauty (NYSE:ELF – Free Report) by 1,642.6% during the 2nd quarter, according to its most recent filing with the Securities and Exchange Commission (SEC). The fund owned 1,638 shares of the company’s stock after acquiring an additional 1,544 shares during the quarter. Allworth Financial LP’s [...]",
    "source": "Defenseworld Net",
    "publishedAt": "2025-11-19 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.defenseworld.net/2025/11/19/allworth-financial-lp-buys-1544-shares-of-e-l-f-beauty-elf.html"
  },
  {
    "title": "KLN Secures Four Distinguished Honours in Sustainability and Excellence",
    "description": "HONG KONG, Nov. 19, 2025 /PRNewswire/ -- KLN Logistics Group Limited ('KLN'; Stock Code 0636.HK) has been awarded four prestigious accolades, including The Asset Corporate Sustainability Leadership Awards for the eighth consecutive year, receiving the Platinum Award this year ('The Asset Awards'), the Environmental, Social and Governance (ESG) Leading Enterprise 2025 by Bloomberg Businessweek/Chinese Edition (the 'Bloomberg Awards') for the seventh time, the Asia-Pacific Logistics Company of the Year Award at the 2025 Frost & Sullivan Asia-Pacific Best Practices Awards (the 'Frost & Sullivan Awards') for the ninth consecutive year, and the Outstanding ESG and Sustainable Enterprise Award for Listed Companies from the Hong Kong Economic Journal ESG & Sustainability Awards of Excellence 2025 (the 'HKEJ Awards'). These accolades highlight KLN's exceptional commitment to ESG principles and sustainable practices, alongside its leadership in operational excellence, global reach, and innovative logistics solutions. The Asset Awards, the Bloomberg Awards, and the HKEJ Awards commended KLN's dedication to integrating sustainability into its core operations, while the Frost & Sullivan Awards praised its market-leading performance, resilience, and customer-centric approach in the dynamic industry. Ellis Cheng, Executive Director and Chairman of the Sustainability Committee of KLN, said, \"We are deeply honoured to receive these four prestigious awards, which reflect our unwavering dedication to sustainability and innovation in logistics. Moving forward, we will continue to seek improvements, setting the bar while driving the industry toward a more sustainable future.\" The Asset Awards, organised annually by The Asset since 2000, represent Asia's longest-running ESG awards program. The ESG Leading Enterprises 2025 accolade, presented by Bloomberg Businessweek/Chinese Edition, promotes sustainable business practices that benefit both the environment and society, whereas the Frost & Sullivan Awards honour innovative companies in the Asia Pacific with market-leading performance and unrivalled customer service. Meanwhile, the inaugural HKEJ Awards, organised by the Hong Kong Economic Journal, were held to recognise outstanding enterprises excelling in ESG practices. -End- About KLN Logistics Group Limited (Stock Code 0636.HK) KLN (formerly Kerry Logistics Network Limited) is an Asia-based, global 3PL with a highly diversified business portfolio and extensive coverage in Asia. It offers a broad range of supply chain solutions from integrated logistics, international freight forwarding (air, ocean, road, rail and multimodal) and e-commerce to industrial project logistics and infrastructure investment. With a global presence across 58 countries and territories, KLN has established a solid foothold in half of the world's emerging markets. Its diverse infrastructure, extensive coverage in international gateways and local expertise span across the Chinese Mainland, India, Southeast Asia, the CIS, Middle East, LATAM and other locations. KLN generated a revenue* of close to HK$60 billion in 2024. It is listed on the Hong Kong Stock Exchange and is a constituent of the Hang Seng Corporate Sustainability Benchmark Index. * For continuing operations only About The Asset's Corporate Sustainability Leadership Awards The Asset's Corporate Sustainability Leadership Awards offer a rigorous benchmarking service for listed companies with regard to corporate sustainability. The criteria used to assess the companies include a range of metrics of financial performance, which are also a proxy for gauging management acumen. Companies are also evaluated according to the quality of their governance, social responsibility, environmental responsibility and investor relations. About Bloomberg Businessweek's ESG Leading Enterprises As one of the most influential business magazines in Hong Kong with a global vision and Greater China connection, the Chinese Edition of Bloomberg Businessweek maintains a keen focus on the development of ESG. It collaborates with Deloitte in co-presenting the ESG Leading Enterprises campaign. By recognising Hong Kong-listed companies and asset management companies with outstanding ESG performance, the campaign aims to encourage enterprises pursuing excellence in ESG practices, ultimately fostering a sustainable business culture to create a positive impact on the environment and society. About Frost & Sullivan's Company of the Year Recognition Frost & Sullivan's Company of the Year Recognition is its top honour, recognising the market participant that exemplifies visionary innovation, market-leading performance, and unmatched customer care. About The Hong Kong Economic Journal's Outstanding ESG and Sustainable Enterprise Award for Listed Companies The Hong Kong Economic Journal's Outstanding ESG and Sustainable Enterprise Award for Listed Companies recognises listed companies that have integrated sustainability into their core strategy, and have demonstrated exceptional performance in their green transformation.",
    "source": "Pr Newswire Apac",
    "publishedAt": "2025-11-19 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://en.prnasia.com/story/512591-0.shtml"
  },
  {
    "title": "Tosca Theresa Pardini",
    "description": "Tosca Theresa Pardini, beloved mother, Nonna, great grandmother, and cherished friend, passed away peacefully on Sunday, November 16, surrounded by the love of her family. On a dark, cloudy day, as the Frank Sinatra song “Fly Me to the Moon” played softly, a single ray of sunshine broke through and gently touched her beautiful face [...]",
    "source": "Marin Independent Journal",
    "publishedAt": "2025-11-19 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.marinij.com/obituaries/tosca-theresa-pardini-ross-ca/"
  },
  {
    "title": "This Bollywood Superstar’s Wife, A Padma Shri, Used To Send Love Notes With His Lunch Box",
    "description": "Since there were no phones available during that time, this superstar’s wife would send small notes in his tiffin.",
    "source": "News 18",
    "publishedAt": "2025-11-19 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.news18.com/photogallery/movies/this-bollywood-superstars-wife-a-padma-shri-used-to-send-love-notes-with-his-lunch-box-9717650.html"
  },
  {
    "title": "Best Solar Stocks To Add to Your Watchlist – November 17th",
    "description": "Canadian Solar, First Solar, Nextpower, Sunrun, Enphase Energy, SolarEdge Technologies, and Solaris Energy Infrastructure are the seven Solar stocks to watch today, according to MarketBeat’s stock screener tool. Solar stocks are shares of companies whose primary business involves the solar energy industry—such as manufacturers of photovoltaic panels and inverters, battery and component suppliers, project developers, [...]",
    "source": "Defenseworld Net",
    "publishedAt": "2025-11-19 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.defenseworld.net/2025/11/19/best-solar-stocks-to-add-to-your-watchlist-november-17th.html"
  },
  {
    "title": "Erik Moren",
    "description": "Erik’s beautiful spirit lives on in our hearts. Survived by his mom, Carolyn, brothers Anders (Jenny) and Mikael (Leah), and two children, Odin (8) and Everly (6). Predeceased by his father, Ulf (2024) and mother, Margaret (1982). everloved.com/Erik-Moren",
    "source": "Marin Independent Journal",
    "publishedAt": "2025-11-19 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.marinij.com/obituaries/erik-moren-thousand-oaks-ca/"
  },
  {
    "title": "Is There a The Morning Show Season 4 Episode 11 Release Date & Time?",
    "description": "Viewers are wondering if there’s a The Morning Show Season 4 Episode 11 release date and time. The popular drama series has recently released its 10th episode, leaving fans eager to know whether the season is over. Here’s all you need to know. The Morning Show Season 4 Episode 11 release date and time explained [...]The post Is There a The Morning Show Season 4 Episode 11 Release Date & Time? appeared first on ComingSoon.net - Movie Trailers, TV & Streaming News, and More.",
    "source": "Coming Soon",
    "publishedAt": "2025-11-19 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.comingsoon.net/guides/news/2063208-is-there-a-the-morning-show-season-4-episode-11-release-date-time"
  },
  {
    "title": "HDFC Life Insurance Company Ltd eases for fifth straight session",
    "description": "HDFC Life Insurance Company Ltd is quoting at Rs 759.55, down 0.3% on the day as on 13:19 IST on the NSE. The stock jumped 12.63% in last one year as compared to a 11.43% rally in NIFTY and a 18.48% spurt in the Nifty Financial Services index.",
    "source": "Business Standard",
    "publishedAt": "2025-11-19 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.business-standard.com/markets/capital-market-news/hdfc-life-insurance-company-ltd-eases-for-fifth-straight-session-125111900600_1.html"
  }
]