[
  {
    "title": "Dear Abby: I feel my wife’s family is being immature when they shut out nephew’s ex after divorce",
    "description": "He'd like to keep in contact with this woman but was told he couldn't.",
    "source": "Oregon Local News",
    "publishedAt": "2026-01-06 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.oregonlive.com/advice/2026/01/dear-abby-i-feel-my-wifes-family-is-being-immature-when-they-shut-out-nephews-ex-after-divorce.html"
  },
  {
    "title": "Gerald Jerry Walter Clark",
    "description": "Gerald Walter Clark (Jerry) of Dallas, Texas passed from this world on November 27, 2025 at 95 years of age. He had moved to Dallas after he lost his home in the Camp Fire that destroyed the town of Paradise, California. He had been left with nothing after fleeing the flames and came to Texas [...]",
    "source": "Chicoer",
    "publishedAt": "2026-01-06 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.chicoer.com/obituaries/gerald-jerry-walter-clark/"
  },
  {
    "title": "Elaine Pace",
    "description": "On December 19, 2025, Elaine Marie Overbaugh Pace, 94, passed into everlasting life surrounded by her devoted family. Elaine grew up in McSherrystown, Pennsylvania with her loving parents Clarence and Helen Overbaugh, six brothers and eight sisters. Growing up, she was hailed “Elaine the Fair.” After graduating from Delone High School, Elaine continued her education [...]",
    "source": "Los Angeles Daily News",
    "publishedAt": "2026-01-06 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.dailynews.com/obituaries/elaine-pace-sherman-oaks-ca/"
  },
  {
    "title": "'Emily in Paris' season 6 renewal sparks debate online",
    "description": "Netflix creates excitement by confirming 'Emily in Paris' season 6 in new teaserNetflix has officially confirmed the renewal of most-loved show Emily in Paris for season 6. After the surprising end of the fifth season, fans were eagerly waiting to hear the announcement of the new...",
    "source": "Geo Tv",
    "publishedAt": "2026-01-06 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.geo.tv/latest/643516-emily-in-paris-season-6-renewal-sparks-debate-online"
  },
  {
    "title": "What cancer screenings should older adults get?",
    "description": "A USC medical oncologist explains what cancers older adults should be screened for, when to start routine screenings — and possibly when to stop.",
    "source": "University Of Southern California",
    "publishedAt": "2026-01-06 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://today.usc.edu/what-cancer-screenings-should-older-adults-get/"
  },
  {
    "title": "S. Korea begins talks with China on deepening ‘panda cooperation’",
    "description": "The talks have raised expectations that South Korea could receive additional pandas from China.",
    "source": "Straitstimes",
    "publishedAt": "2026-01-06 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.straitstimes.com/asia/east-asia/s-korea-begins-talks-with-china-on-deepening-panda-cooperation"
  },
  {
    "title": "Michael Schliebe",
    "description": "Michael Edward Schliebe, cherished husband, brother, and friend, after a short battle with esophageal cancer, died on December 7, 2025, at his home in Puyallup, WA. His wife, Cyndy, was by his side when God called Mike to glory. He was 70 years old. Milton Edward and Shirley Ann Schliebe (Davis) welcomed their baby boy [...]",
    "source": "Ocregister",
    "publishedAt": "2026-01-06 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.ocregister.com/obituaries/michael-schliebe-puyallup-wa/"
  },
  {
    "title": "Education officials address K to 12 concerns, vow reforms to improve employability and flexibility",
    "description": "Top education officials on Tuesday, January 6, said key reforms are underway to address long-standing concerns surrounding the K to 12 Program, particularly on graduate employability, curriculum relevance, and alignment across basic, technical, and higher education.In a Malacañang press briefing, Department of Education (DepEd) Secretary Sonny Angara, Commission on Higher Education (CHED) Chairperson Shirley Agrupis, and Technical Education and Skills Development Authority (TESDA) Secretary Jose Francisco “Kiko” Benitez addressed concerns on the K to 12 Program after President Ferdinand Marcos Jr. earlier expressed frustration over the program’s undelivered promises, especially its goal of making senior high school (SHS) graduates job-ready.DepEd: Streamlined curriculum, stronger industry linkageAngara said the K to 12 curriculum has been significantly streamlined in response to criticism that it was overly congested.“Iyong curriculum inayos natin dahil iyong criticism masyadong cluttered—33 subjects. Ginawa na lang natin five required subjects, tapos iyong rest parang electives na noong bata (We revised the curriculum because the criticism was that it was too cluttered with 33 subjects. We reduced it to just five required subjects, and the rest became electives for students),” he explained.Angara also underscored the need to address emerging demands in the age of artificial intelligence (AI).“So, kasi in the age of AI, kailangan may flexibility tayo. Puwede siyang mag-vocational sa skills, puwede rin siyang mag-academic subjects, puwede niyang haluin iyon (Because in the age of AI, we need flexibility. A student can take vocational skills, academic subjects, or even combine the two),” he added.Angara also announced a major upgrade in industry immersion, increasing work immersion hours from a maximum of 300 to 640 hours—nearly equivalent to one semester.This, he said, will directly address concerns that SHS graduates are not job-ready.CHED: Bridging programs to fix course-track mismatchAgrupis said addressing K to 12 issues is a priority agenda following the first-ever joint Management Committee (ManCom) meeting among CHED, DepEd, and TESDA.She pointed out that one major challenge lies in the readiness of students entering higher education, particularly when their SHS track does not match their chosen college course.“Ang challenge namin dito sa K to 12 is iyong readiness ng estudyante na pupunta sa pinili niyang kurso (Our challenge in K to 12 is the readiness of students to pursue the course they have chosen),” Agrupis said.She cited cases where students from the Accountancy, Business, and Management (ABM) track enroll in engineering programs, resulting in course-track mismatches.“So, ang immediate na ginagawa namin is may bridging program (What we immediately do is provide a bridging program),” she added.To address this, CHED is implementing bridging programs and discussing standardized evaluation and cut-off scores for incoming freshmen.These measures aim to harmonize assessments between higher education institutions and TESDA, ensuring students are properly guided based on their competencies.TESDA: Focus on employability and skills certificationBenitez said TESDA’s primary concern is ensuring that senior high school graduates are employable upon completion of the K to 12 program.“From our side, the major issue with the K to 12, for TESDA at least, is whether or not those who graduate from senior high school are employable,” Benitez said.“So, if the issue is whether or not senior high school students moving forward will be employable, masasabi naman po ng TESDA at least that we can certify that—as many of them who are willing to take the assessment will be employable,” he added.To address this, Benitez said TESDA rolled out free national competency assessments for SHS students starting in 2025, backed by funding from the President and Congress.“Nearly 190,000 senior high school students have already been assessed and certified with National Certificates (NC) II and III, aligned with their chosen SHS tracks,” Benitez said, adding that funding for the free assessments will continue in 2026.According to TESDA, graduates who pass the assessment can be certified as job-ready, helping fulfill the original promise of the K to 12 program.Seamless pathways across education sectorsBenitez added that TESDA and CHED are strengthening the recognition of prior learning and aligning curricula to ensure students can shift between technical-vocational training and higher education without being locked into a single pathway.This, he said, supports the goal of creating seamless pathways, with multiple entry and exit points within the formal education system.“We are grateful to DepEd for making the senior high school curriculum much, much more flexible, which also allows for this seamless pathway,” Benitez said.Education leaders agreed that these reforms—coupled with increased funding and closer inter-agency coordination—are key to ensuring that the K to 12 program finally delivers on its promise of producing flexible, skilled, and employable Filipino graduates.",
    "source": "Manila Bulletin",
    "publishedAt": "2026-01-06 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://mb.com.ph/article/10900384/philippines/national/education-officials-address-k-to-12-concerns-vow-reforms-to-improve-employability-and-flexibility"
  },
  {
    "title": "Food reporter shares the money-saving hack she uses to score deals on grocery staples: 'Half the price of the grocery store'",
    "description": "\"I've seen their inventory increase.\"",
    "source": "Yahoo! News",
    "publishedAt": "2026-01-06 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.yahoo.com/news/articles/food-reporter-shares-money-saving-080500183.html"
  },
  {
    "title": "Roseann Anderson",
    "description": "Roseann Anderson (Mrs. Bruce C. Anderson) of Pasadena, California joined her husband and other family members in Heaven on Saturday, December 27, 2025.She was born to Arthur and Ellen (Bunyan) Turgeon, and grew up in Shreveport, Louisiana. She graduated as class valedictorian at Webster College in St. Louis, Missouri, and began teaching in Houston, Texas, [...]",
    "source": "Whittier Daily News",
    "publishedAt": "2026-01-06 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.whittierdailynews.com/obituaries/roseann-anderson-pasadena-ca/"
  }
]