[
  {
    "title": "Prime minister congratulates Oman's foreign minister",
    "description": "DOHA: Prime Minister and Minister of Foreign Affairs HE Sheikh Mohammed bin Abdulrahman bin Jassim Al Thani has congratulated Foreign Minister of Oman HE Sayyid Badr bin Hamad al B...",
    "source": "Qatar Tribune",
    "publishedAt": "2025-11-17 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.qatar-tribune.com/article/204898/latest-news/prime-minister-congratulates-omans-foreign-minister"
  },
  {
    "title": "TEACHING AWARDS TRUST LAUNCHES NEW 'EDUCATION INSIGHTS' EVENT SERIES",
    "description": "New initiative in partnership with Nord Anglia Education brings together educators and global thought leaders to explore themes shaping the future of educationDavid Olusoga OBE, Floella Benjamin DBE, and Musharaf Asghar, Former 'Educating Yorkshire', student amongst line up of influential speakersLONDON, Nov. 17, 2025 /PRNewswire/ -- The Teaching Awards Trust, supported by Nord Anglia Education, is proud to launch Education Insights, a brand new series of education-focused regional events. Starting in January 2026, the events will connect teachers, school leaders, and local decision-makers with leading voices from sport, technology, business, and politics to explore the defining issues shaping young people's lives and how to unlock their full potential.The series opens on 27 January in Manchester with 'A Focus on Resilience', with former 'Educating Yorkshire' student Musharaf Asghar delivering the keynote address. The programme continues throughout February with four further events exploring critical education themes, including future skills and metacognition (helping young people understand how they learn best).Each event will feature a panel of world-class experts who bring both insights and a passion for young people's development. From BAFTA-winning historian David Olusoga OBE and Adrianne Chapman, Vice Principal at the world-renowned BRIT School, to Baroness Floella Benjamin OM DBE DL, speakers will deliver valuable insights to inspire debate, new thinking, and meaningful cross-sector collaboration. The series concludes on 12 February in London.The event series is organised by independent charity, The Teaching Awards Trust, in partnership with Nord Anglia Education, the international schools group. The Teaching Awards Trust recognises the transformative power of educators through key education events, including the National Teaching Awards and National Thank a Teacher Day.Mary Palmer, Chief Executive of the Teaching Awards Trust, says: \"Education is at the heart of the national agenda, both politically and socially. Through these events, supported by Nord Anglia Education, we will shine a light on the incredible contributions of the profession on the ground, every day. By creating a space that showcases best-in-class examples and encourages knowledge sharing, we aim to inspire not only those within the profession but also those who might be considering a future ...Full story available on Benzinga.com",
    "source": "Benzinga",
    "publishedAt": "2025-11-17 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.benzinga.com/pressreleases/25/11/n48891967/teaching-awards-trust-launches-new-education-insights-event-series"
  },
  {
    "title": "Robert MacIntyre offers brutally honest verdict on DP World Tour display",
    "description": "Robert MacIntyre was left frustrated after his final round at the DP World Tour Championship, despite carding a four-under 68 to finish tied eighth in Dubai",
    "source": "Daily Express Us",
    "publishedAt": "2025-11-17 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.the-express.com/sport/golf/190786/robert-macintyre-dp-world-tour"
  },
  {
    "title": "Gabelli Utility Trust Q3 2025 Commentary",
    "description": "The Gabelli Utility Trust is a diversified, closed-end management investment company whose primary objectives are long-term growth of capital and income. Read more here.",
    "source": "Seeking Alpha",
    "publishedAt": "2025-11-17 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://seekingalpha.com/article/4844491-gabelli-utility-trust-q3-2025-commentary"
  },
  {
    "title": "Prepayments (CK93) - Totalkredit A/S",
    "description": "To the Nasdaq Copenhagen",
    "source": "Globe Newswire",
    "publishedAt": "2025-11-17 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.globenewswire.com/news-release/2025/11/17/3188841/0/en/Prepayments-CK93-Totalkredit-A-S.html"
  },
  {
    "title": "Dothan girls wrestlers place second at 16-team tournament",
    "description": "The Wolves earned 114 points, edging out Dadeville (112.5) for the runner-up spot.",
    "source": "Dothaneagle",
    "publishedAt": "2025-11-17 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://dothaneagle.com/sports/high-school/wrestling/article_d0afe110-bda9-4d9e-b4fc-7e0bfe479429.html"
  },
  {
    "title": "TEACHING AWARDS TRUST LAUNCHES NEW 'EDUCATION INSIGHTS' EVENT SERIES",
    "description": "New initiative in partnership with Nord Anglia Education brings together educators and global thought leaders to explore themes shaping the future of education David Olusoga OBE, Floella Benjamin DBE, and Musharaf Asghar, Former 'Educating Yorkshire', student amongst line up of...",
    "source": "Pr Newswire",
    "publishedAt": "2025-11-17 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.prnewswire.com/news-releases/teaching-awards-trust-launches-new-education-insights-event-series-302616247.html"
  },
  {
    "title": "Tom Brady offers priceless advice to new colleague before FOX NFL Sunday debut",
    "description": "Drew Brees made his debut in the FOX broadcast booth in Week 11, and the future Hall of Fame quarterback received some valuable advice from his co-worker Tom Brady",
    "source": "Daily Express Us",
    "publishedAt": "2025-11-17 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.the-express.com/sport/american-football/190787/tom-brady-drew-brees-fox"
  },
  {
    "title": "Brad Binder relieved ‘tough year’ in MotoGP is done and dusted",
    "description": "Red Bull KTM rider fails to finish inside top 10 for the first time since his rookie season.",
    "source": "The Citizen",
    "publishedAt": "2025-11-17 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.citizen.co.za/motoring/brad-binder-admits-motogp-season-was-tough/"
  },
  {
    "title": "Weekend win in OT pushes Rebels into third place (KIJHL)",
    "description": "The Castlegar Rebels used an overtime win at home on Saturday night to seize sole possession of third place in the Murdoch Division of the KIJHL.The Rebels pulled out a come-from-behind 3-2 win at home in front of 350 fans at the Castlegar and District Community Centre over the Fernie Ghostrider...",
    "source": "Castanet",
    "publishedAt": "2025-11-17 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.castanet.net/news/KIJHL/584448/Weekend-win-in-OT-pushes-Rebels-into-third-place"
  }
]