[
  {
    "title": "Author Introduces Faith-Based Guide to Group Decision-Making and Unity",
    "description": "New book offers biblical grounding practical steps for Christians seeking wisdom together ESSEX JUNCTION, Vt., Feb. 9, 2026 /PRNewswire/ -- In \"Make Smart Choices (Not Foolish Ones)—Together!,\" Dr. Selle examines why group decisions so often lead to tensions and misunderstanding, even...",
    "source": "Pr Newswire",
    "publishedAt": "2026-02-09 20:20:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.prnewswire.com/news-releases/author-introduces-faith-based-guide-to-group-decision-making-and-unity-302682824.html"
  },
  {
    "title": "Not Clear Whether Vaccines Cause Autism, Needs More Research; NIH Director Says",
    "description": "Not Clear Whether Vaccines Cause Autism, Needs More Research; NIH Director Says Authored by Zachary Stieber via The Epoch Times,The director of the National Institutes of Health said in a new interview that there’s a dearth of high-quality research into vaccines and autism and that the health agency is funding research that will determine the causes of autism.Dr. Jay Bhattacharya, the NIH’s director, told EpochTV’s “American Thought Leaders” in an interview released on Feb. 10 that he has read studies that have found no connection between the measles, mumps, and rubella vaccine and autism. Bhattacharya sees the studies as robust.“For other vaccines, there actually isn’t this kind of rich literature,” he said.“‘Do vaccines cause autism’ is a poorly formed question,” Bhattacharya added later. “Do I believe that we know that there are some vaccines that cause autism? The answer—I don’t think that’s true. Do we know for a fact that every single vaccine in the combination it is given doesn’t cause autism? Also, I don’t know that we know that. These are things that are worthy of research.”A small number of studies have found indications that autism can be caused by vaccines, while others have identified no increased risk in autism following receipt of the measles shot.Bhattacharya, during a Senate Health Committee hearing on Feb. 3, told Sen. Bernie Sanders (I-Vt.) that he does not believe autism is caused by the measles vaccine. Sanders pressed for a broader answer.“I have not seen a study that suggests any single vaccine causes autism,” Bhattacharya said.President Donald Trump has directed health officials to study autism, noting that more kids than ever are being diagnosed with the disorder. One of the efforts, led by the NIH, is called the Autism Data Science Initiative and involves investing more than $50 million in projects aimed at pinpointing autism causes.Health Secretary Robert F. Kennedy Jr. has also said that the government is looking into potential links between autism and vaccines.“We’ve invested a tremendous amount of money in trying to understand the etiology of autism, because there’s millions of families around the country that have children that ... they would love to be able to help, but we don’t really have great answers, both for the cause and how to sort of reverse whatever problems there are. And of course, there’s a whole range of phenotypes ... ranging from very, very severe autism to much milder, and so you can have different answers and different biology,” Bhattacharya told The Epoch Times.“We need to have better science underlying all of these conditions, and that’s something I’m investing in to make sure that the next generation of folks who have these conditions will have better answers provided to them.”A baby after receiving a vaccine for hepatitis B and other diseases, in an undated illustration photograph. Riccardo Milani/Hans Lucas/AFP via Getty ImagesBhattacharya also said he views the NIH’s role as funding research that will provide answers to key questions.“Even if some people think that the question is already settled, if there’s a lot of the population that doesn’t agree, then, in my view, the right, respectful thing to do is to—rather than just to censor them or argue with them to marginalize them—is to provide more, better, scientific answers to the questions that they have,” he said.Some organizations, such as the American Medical Association, say existing literature makes clear that vaccines do not cause autism. Certain groups maintain that all or many autism cases are caused by genetic factors.The Centers for Disease Control and Prevention, which for years said that vaccines do not cause autism, said in 2025 that the available evidence does not support that stance.Kennedy has said multiple times that the available studies are poorly designed and do not disprove a vaccine-autism link.Some parents of children with autism say that their children were harmed by vaccines, and the government vaccine injury program has paid families who suffered problems associated with autism following vaccination. Researchers with Children’s Health Defense, founded by Kennedy, said in a Jan. 31 paper that epidemiological and other evidence demonstrate that aluminum in vaccines can trigger autism in certain people.“I don’t know the answer,” Bhattacharya said in the new interview. “I don’t understand how people can so confidently say they know what the answer [is] for a biological condition that is so heterogeneous and [has] so many different hypotheses. That’s the way I’ve been approaching it.”The CDC recently downgraded recommendations for six vaccines to shared clinical-decision making, or advising parents to consult with doctors before having their children vaccinated, while keeping in place routine recommendations for the measles vaccine and seven other shots. Bhattacharya said that he favors vaccinating children with most of the vaccines recommended by the government, because they protect against infectious diseases.“Now it may be that for some kids with different kinds of susceptibility in different areas, there’s going to be some risk, and you have to take that into account,” he said. “And so there should be a sort of a shared decision-making kind of thing for vaccinations.” Tyler DurdenMon, 02/09/2026 - 15:20",
    "source": "Zerohedge",
    "publishedAt": "2026-02-09 20:20:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.zerohedge.com/medical/not-clear-whether-vaccines-cause-autism-needs-more-research-nih-director-says"
  },
  {
    "title": "One arrested after police raid on West Kelowna ‘problem property’",
    "description": "Illegal drugs and weapons were also seized during the search warrant",
    "source": "Summerland Review",
    "publishedAt": "2026-02-09 20:20:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://summerlandreview.com/2026/02/09/one-arrested-after-police-raid-on-west-kelowna-problem-property/"
  },
  {
    "title": "One arrested after police raid on West Kelowna ‘problem property’",
    "description": "Illegal drugs and weapons were also seized during the search warrant",
    "source": "Keremeos Review",
    "publishedAt": "2026-02-09 20:20:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://keremeosreview.com/2026/02/09/one-arrested-after-police-raid-on-west-kelowna-problem-property/"
  },
  {
    "title": "Neuroinflammation and Disability Progression: Evolving Insights in Multiple Sclerosis",
    "description": null,
    "source": "Pharmacy Times",
    "publishedAt": "2026-02-09 20:20:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.pharmacytimes.com/view/neuroinflammation-and-disability-progression-evolving-insights-in-multiple-sclerosis"
  },
  {
    "title": "Visa overstays by Nigerians could affect travel opportunities for others — US Mission",
    "description": "The US Mission noted that strengthening compliance with visa rules is important to protect access for responsible travellers, including...The post Visa overstays by Nigerians could affect travel opportunities for others — US Mission appeared first on Tribune Online.",
    "source": "Tribune",
    "publishedAt": "2026-02-09 20:20:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://tribuneonlineng.com/visa-overstays-by-nigerians-could-affect-travel-opportunities-for-others-us-mission/"
  },
  {
    "title": "One arrested after police raid on West Kelowna ‘problem property’",
    "description": "Illegal drugs and weapons were also seized during the search warrant",
    "source": "Eagle Valley News",
    "publishedAt": "2026-02-09 20:20:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://eaglevalleynews.com/2026/02/09/one-arrested-after-police-raid-on-west-kelowna-problem-property/"
  },
  {
    "title": "New Bull Market Highs Break $50,000",
    "description": "As the majority of market commentary focuses on the collapse of AI tech-related stocks, there’s a new bull market making new highs. Read more here...",
    "source": "Seeking Alpha",
    "publishedAt": "2026-02-09 20:20:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://seekingalpha.com/article/4867833-new-bull-market-highs-break-50000"
  },
  {
    "title": "One arrested after police raid on West Kelowna ‘problem property’",
    "description": "Illegal drugs and weapons were also seized during the search warrant",
    "source": "The Similkameen Spotlight",
    "publishedAt": "2026-02-09 20:20:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://similkameenspotlight.com/2026/02/09/one-arrested-after-police-raid-on-west-kelowna-problem-property/"
  },
  {
    "title": "Wilson Named ACC Co-Rookie Of The Week",
    "description": "Caleb Wilson wins the honor for a third time this season.",
    "source": "Official Athletics Website",
    "publishedAt": "2026-02-09 20:20:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://goheels.com/news/2026/2/9/mens-basketball-wilson-named-acc-co-rookie-of-the-week"
  }
]