[
  {
    "title": "India pencil in top men, women cricketers for Asian Games",
    "description": "India is sending its top men's and women's cricket teams to the Asian Games in Japan, aiming for Olympic qualification in 2028. Suryakumar Yadav and Harmanpreet Kaur will captain the T20 squads. This move signifies cricket's growing importance in multi-sport events, with the BCCI prioritizing established players due to a clear international calendar.",
    "source": "Yahoo! News",
    "publishedAt": "2026-02-20 08:07:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://sports.yahoo.com/articles/india-pencil-top-men-women-080700129.html"
  },
  {
    "title": "Luckfox 16-inch 4K 120Hz portable touch monitor offers 100% sRGB coverage",
    "description": "This new 16-inch portable touchscreen monitor from Luckfox promises sharp visuals and smooth motion with its 3840 × 2400 (4K) IPS panel, 120Hz refresh rate, and 178-degree viewing angle. According to the manufacturer, the display can be used with laptops, smartphones, single-board computers, and game consoles, though performance will depend on the connected device.",
    "source": "Notebookcheck",
    "publishedAt": "2026-02-20 08:07:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.notebookcheck.net/Luckfox-16-inch-4K-120Hz-portable-touch-monitor-offers-100-sRGB-coverage.1230164.0.html"
  },
  {
    "title": "‘Devastating at First’: Tim Gunn on Not Returning for Project Runway Season 21",
    "description": "Many wondered why Tim Gunn did not return for the new season of Project Runway. Gunn co-hosted the show with Heidi Klum for several seasons. He is now explaining what happened, sharing details in a recent podcast appearance. Tim Gunn talks about why he wasn’t involved in Project Runway Season 21 Speaking on Chelsea Handler’s [...]The post ‘Devastating at First’: Tim Gunn on Not Returning for Project Runway Season 21 appeared first on Mandatory.",
    "source": "Mandatory",
    "publishedAt": "2026-02-20 08:07:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.mandatory.com/news/1733033-project-runway-season-21-tim-gunn-absence-devastated"
  },
  {
    "title": "UK kitchen furniture firm slumps into administration - family business for 30 years",
    "description": "A notice of intention to appoint administrators was filed on February 4, 2026, per court records.",
    "source": "Express",
    "publishedAt": "2026-02-20 08:07:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.express.co.uk/news/uk/2173275/newcastle-furniture-company-administration-imperial-cabinet"
  },
  {
    "title": "🗞️ Headlines: Football fights for space on a historic front page",
    "description": "No, these are not the covers of sports newspapers from Norway or Canada. The milestone that shook Spanish sports yesterday after winning a gold medal at the Winter Olympics more than half a century la...",
    "source": "Yahoo! News",
    "publishedAt": "2026-02-20 08:07:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://sports.yahoo.com/articles/headlines-football-fights-space-historic-080700254.html"
  },
  {
    "title": "Uzbekistan becomes Kazakhstan’s top trade partner within OTS in 2025",
    "description": "In 2025, Uzbekistan emerged as the top player in trade turnover among the member states of the Organization of Turkic States (OTS), leaving no stone unturned in its dealings with Kazakhstan.",
    "source": "Trend",
    "publishedAt": "2026-02-20 08:07:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.trend.az/casia/kazakhstan/4155629.html"
  },
  {
    "title": "39 poachers arrested in Similipal, weapons seized",
    "description": "Mayurbhanj: Forest authorities arrested 39 poachers Thursday in the southern division of the Similipal Tiger Reserve, officials said. Authorities recovered nine country-made rifles, 20 bows, and a large quantity of gunpowder and other arms from them. The poachers have been identified as residents of villages under the Udala police station limits, the deputy director of [...]",
    "source": "Orissa Post",
    "publishedAt": "2026-02-20 08:06:57",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.orissapost.com/39-poachers-arrested-in-similipal-weapons-seized/"
  },
  {
    "title": "Trump Orders Release Of Secret US Government Files On UFOs And Aliens",
    "description": "Trump said that the order was prompted by “tremendous interest” from the public.",
    "source": "Says",
    "publishedAt": "2026-02-20 08:06:57",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://says.com/my/news/trump-orders-release-ufo-alien-files"
  },
  {
    "title": "'No security threat around Ekushey February programmes'",
    "description": "There is no security threat surrounding this year’s Ekushey February observance in the capital, according to the commissioner of Dhaka Metropolitan Police ( DMP).Commissioner Sheikh Md Sajjat Ali said on Friday that around 15,000 police personnel would be deployed in and around the Central Shaheed Minar to ensure the safe and orderly observance of Shaheed Day and International Mother...Details",
    "source": "দৈনিক ইত্তেফাক | The Daily Ittefaq",
    "publishedAt": "2026-02-20 08:06:55",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://en.ittefaq.com.bd/15405/no-security-threat-around-ekushey-february"
  },
  {
    "title": "Thai Authorities Investigate Couple Over Public Sex With Onlookers On Popular Beach",
    "description": "The couple’s behaviour was deemed inappropriate given the public setting.",
    "source": "Says",
    "publishedAt": "2026-02-20 08:06:55",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://says.com/my/news/thai-authorities-investigate-couple-over-public-sex-with-onlookers-on-popular-beach"
  }
]