[
  {
    "title": "Milan and Inter new stadium: possible matchday revenue revealed",
    "description": "Reports in Italy suggest that Milan and Inter hope to earn circa €180m from stadium revenue once they’ve built their new arena, replacing the iconic Stadio Meazza.Milan and Inter have bought the S...",
    "source": "Yahoo! News",
    "publishedAt": "2025-12-22 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://ca.sports.yahoo.com/news/milan-inter-stadium-possible-matchday-080500546.html"
  },
  {
    "title": "Rolling Fenerbahçe face acid test as Beşiktaş step into Cup opener",
    "description": "Fenerbahçe and Beşiktaş will renew one of Turkish football’s fiercest rivalries Tuesday night when they collide in the opening match of the Ziraat Turkish Cup C Group, with both si...",
    "source": "Daily Sabah",
    "publishedAt": "2025-12-22 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.dailysabah.com/sports/football/rolling-fenerbahce-face-acid-test-as-besiktas-step-into-cup-opener"
  },
  {
    "title": "Actor Ken Watanabe closes cafe he opened to support Tohoku reconstruction",
    "description": "The actor began visiting evacuation centers in affected areas soon after the March 2011 disaster and opted to open the cafe to offer a place where people could enjoy chatting.",
    "source": "The Japan Times",
    "publishedAt": "2025-12-22 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.japantimes.co.jp/news/2025/12/22/japan/ken-watanabe-cafe-closes/"
  },
  {
    "title": "\"The things they've never had since Andrew Bogut\" - Udonis Haslem believes Warriors need a true big man to get back on track",
    "description": "Udonis Haslem says the Golden State Warriors' main need right now is a big man who, like Andrew Bogut before could man the middle and protect the paint.",
    "source": "Capjournal",
    "publishedAt": "2025-12-22 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.capjournal.com/arena/basketball_network/the-things-theyve-never-had-since-andrew-bogut---udonis-haslem-believes-warriors-need/article_856d52ec-d3a9-50ce-bcfd-e57278f561ea.html"
  },
  {
    "title": "5 Thoughts: Texas A&M 118, East Texas A&M 77",
    "description": "Between a women's basketball victory earlier in the afternoon and a volleyball national title in Kansas City, Bucky McMillan and the Aggies contributed to a perfect 3-0 Sunday by blowing the doors off East Texas A&M at Reed Arena, 118-77.",
    "source": "Texags",
    "publishedAt": "2025-12-22 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://texags.com/s/72602/5-thoughts-texas-am-118-east-texas-am-77"
  },
  {
    "title": "7,374 Shares in The Allstate Corporation $ALL Bought by Abner Herrman & Brock LLC",
    "description": "Abner Herrman & Brock LLC acquired a new stake in The Allstate Corporation (NYSE:ALL – Free Report) during the 3rd quarter, according to its most recent disclosure with the SEC. The fund acquired 7,374 shares of the insurance provider’s stock, valued at approximately $1,583,000. A number of other large investors have also recently added to [...]",
    "source": "Defenseworld Net",
    "publishedAt": "2025-12-22 08:04:58",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.defenseworld.net/2025/12/22/7374-shares-in-the-allstate-corporation-all-bought-by-abner-herrman-brock-llc.html"
  },
  {
    "title": "Abner Herrman & Brock LLC Buys New Shares in Realty Income Corporation $O",
    "description": "Abner Herrman & Brock LLC purchased a new position in Realty Income Corporation (NYSE:O – Free Report) during the third quarter, according to its most recent Form 13F filing with the Securities and Exchange Commission. The firm purchased 10,000 shares of the real estate investment trust’s stock, valued at approximately $608,000. Several other hedge funds [...]",
    "source": "Defenseworld Net",
    "publishedAt": "2025-12-22 08:04:58",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.defenseworld.net/2025/12/22/abner-herrman-brock-llc-buys-new-shares-in-realty-income-corporation-o.html"
  },
  {
    "title": "Trump doctors check 'how bad he's doing' as cognitive decline continues: psychologist",
    "description": "Frequent check-ups for Donald Trump could point to \"monitoring\" a health problem rather than finding it, a psychologist has claimed. Dr. John Gartner believes the three Montreal Cognitive Assessments is to monitor an existing condition that could indicate just how rapid the president's cognitive decline is. Dr. Garter, speaking to The Daily Beast, says Trump \"gave the game away\" when boasting about his brilliant health aboard Air Force One. Speaking in April this year, Trump says he \"got every answer right\" on the cognitive test. He would repeat this claim in October, saying he had passed a \"very hard\" test which \"a low IQ person\" would not manage to pass. He said at the time, \"They have Jasmine Crockett, a low IQ person. AOC is low IQ. You give her an IQ test, have her pass, like, the exams that I decided to take when I was at Walter Reed.\"\"I took– Those are very hard– They're really aptitude tests, I guess, in a certain way, but they're cognitive tests. Let AOC go against Trump. Let Jasmine go against Trump. I don't think Jasmine– The first couple questions are easy: a tiger, an elephant, a giraffe, you know.\" \"When you get up to about five or six and then when you get up to 10 and 20 and 25, they couldn't come close to answering any of those questions.\" Dr. Gartner believes these tests are to monitor an existing dementia condition than track for signs of it starting. He claimed, \"You know, he kind of gave the game away again, as he often does. You could maybe justify giving someone the MoCA once, just on their age, just as part of a physical. If you’re giving it to him three times, that means you’re not assessing dementia. That means you’re monitoring dementia.\"\"Because if you keep feeling like, no, he’s still got the symptoms, we’ve got to see how bad he’s doing now, we’ve got to check again, see how bad he’s doing now—I think they’re giving him cognitive tests and M.R.I.s every six months to monitor the progress of his dementia, and/or strokes.\"Dr. Gartner has since suggested there has been a \"change of some kind\" in the president that can be linked to his mental decline. He added, \"We have to judge people against their own baseline, and if somebody doubles their rate of speed, that’s a mental status change of some kind.\"",
    "source": "Raw Story",
    "publishedAt": "2025-12-22 08:04:57",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.rawstory.com/donald-trump-cognitive-2674818893/"
  },
  {
    "title": "Abner Herrman & Brock LLC Buys Shares of 12,375 Old Republic International Corporation $ORI",
    "description": "Abner Herrman & Brock LLC purchased a new position in Old Republic International Corporation (NYSE:ORI – Free Report) during the 3rd quarter, according to its most recent 13F filing with the SEC. The firm purchased 12,375 shares of the insurance provider’s stock, valued at approximately $526,000. A number of other institutional investors have also made [...]",
    "source": "Defenseworld Net",
    "publishedAt": "2025-12-22 08:04:57",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.defenseworld.net/2025/12/22/abner-herrman-brock-llc-buys-shares-of-12375-old-republic-international-corporation-ori.html"
  },
  {
    "title": "AA Financial Advisors LLC Buys 37,001 Shares of FS KKR Capital Corp. $FSK",
    "description": "AA Financial Advisors LLC increased its stake in shares of FS KKR Capital Corp. (NYSE:FSK – Free Report) by 24.9% during the third quarter, according to the company in its most recent disclosure with the Securities & Exchange Commission. The firm owned 185,859 shares of the company’s stock after acquiring an additional 37,001 shares during [...]",
    "source": "Defenseworld Net",
    "publishedAt": "2025-12-22 08:04:57",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.defenseworld.net/2025/12/22/aa-financial-advisors-llc-buys-37001-shares-of-fs-kkr-capital-corp-fsk.html"
  }
]