[
  {
    "title": "Under the Patronage of the Minister of Industry and Mineral Resources - Inauguration of the First Edition of the \"Future Minerals Pioneers\" Bootcamp",
    "description": "RIYADH, Saudi Arabia, Jan. 8, 2026 /PRNewswire/ -- Under the patronage of His Excellency Mr. Bandar bin Ibrahim AlKhorayef, the Minister of Industry and Mineral Resources, His Excellency Eng. Khalid bin Saleh Al-Mudaifer, the Vice-Minister of Industry and Mineral Resources for Mining...",
    "source": "Pr Newswire Uk",
    "publishedAt": "2026-01-08 08:06:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.prnewswire.co.uk/news-releases/under-the-patronage-of-the-minister-of-industry-and-mineral-resources---inauguration-of-the-first-edition-of-the-future-minerals-pioneers-bootcamp-302656230.html"
  },
  {
    "title": "Indian Hotels Company Signs Taj Mohali, A 225-Key Luxury Hotel with Wellness Facilities and Largest Event Venue in the Region",
    "description": "Indian Hotels Company Signs Taj Mohali, A 225-Key Luxury Hotel with Wellness Facilities and Largest Event Venue in the RegionIndian Hotels Company announces the signing of Taj Mohali, a 225-key hotel offering luxury amenities, wellness facilities and the largest event venue in the region, marking a new phase in hospitality growth.The post Indian Hotels Company Signs Taj Mohali, A 225-Key Luxury Hotel with Wellness Facilities and Largest Event Venue in the Region appeared first on Travel And Tour World.",
    "source": "Travel And Tour World",
    "publishedAt": "2026-01-08 08:06:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.travelandtourworld.com/news/article/indian-hotels-company-signs-taj-mohali-a-225-key-luxury-hotel-with-wellness-facilities-and-largest-event-venue-in-the-region/"
  },
  {
    "title": "How 5 Cougs, 12 Zags have fared in the NBA so far this season",
    "description": "The Grizzlies have relied on a pair of Cougs while the reigning NBA champions enjoy the sharp services of a former Zag",
    "source": "Dnews",
    "publishedAt": "2026-01-08 08:06:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.dnews.com/sports/how-5-cougs-12-zags-have-fared-in-the-nba-so-far-this-season-ef646538"
  },
  {
    "title": "New Docs Detail RFK Jr.'s Role in Central Park Bear Dump",
    "description": "Robert F. Kennedy Jr.'s long-ago Central Park bear stunt has resurfaced, thanks to city records that show how baffled officials were by the mystery cub he dumped under a bush near West 69th Street. Documents obtained by Wired from New York City's Parks & Rec Department, including previously unpublished...",
    "source": "Newser",
    "publishedAt": "2026-01-08 08:06:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.newser.com/story/381576/new-docs-detail-rfk-jrs-role-in-central-park-bear-dump.html"
  },
  {
    "title": "Russia sends chilling nuclear attack threat to the UK as WW3 fears skyrocket",
    "description": "\"There is no doubt that the response must be firm and swift\" warned one furious Kremlin mouthpiece",
    "source": "Express",
    "publishedAt": "2026-01-08 08:06:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.express.co.uk/news/world/2155045/Russia-UK-nuclear-attack-Marinera-oil-tanker"
  },
  {
    "title": "BIR files tax raps vs. Wawao Builders over ghost project in Bulacan",
    "description": "In line with the whole-of-government effort to combat corruption in infrastructure projects exposed by President Ferdinand R. Marcos Jr.",
    "source": "Sunstar",
    "publishedAt": "2026-01-08 08:05:59",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.sunstar.com.ph/manila/bir-files-tax-raps-vs-wawao-builders-over-ghost-project-in-bulacan"
  },
  {
    "title": "UK armed forces helped US mission to seize Russian tanker, MoD says",
    "description": "British armed forces provided support to the United States in its operation to seize a Russian-flagged oil tanker in the North Atlantic on Wednesday, the Ministry of Defence (MoD) has confirmed",
    "source": "Rfi",
    "publishedAt": "2026-01-08 08:05:56",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.rfi.fr/en/international/20260108-british-armed-forces-helped-united-states-mission-to-seize-russian-flagged-tanker-marinera-defence-ministry-says"
  },
  {
    "title": "UK armed forces helped US mission to seize Russian tanker, MoD says",
    "description": "The US Coast Guard stopped the tanker which was being shadowed by a Russian submarine on Wednesday, after pursuing it for more than two weeks across the Atlantic as part of Washington's efforts to blockVenezuelanoil exports.Britainsaid its armed forces gave \"pre-planned operational support, including basing\" following a US request for assistance.It said a military vessel provided support for the US forces",
    "source": "The Uk News",
    "publishedAt": "2026-01-08 08:05:56",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "http://theuknews.com/news/278797280/uk-armed-forces-helped-us-mission-to-seize-russian-tanker-mod-says"
  },
  {
    "title": "Delhi Police identify 30 in Turkman Gate stone pelting case, to summon SP MP",
    "description": "New Delhi, Jan 8, 2026 Delhi Police on Thursday said they have identified 30 people involved in the violence that erupted during the municipal corporation’s demolition drive near the Faiz-e-Ilahi Mosque in the Turkman Gate area. The identification was made on the basis of CCTV footage, body-worn camera recordings of police personnel, and several viral [...]The post Delhi Police identify 30 in Turkman Gate stone pelting case, to summon SP MP appeared first on Yes Punjab News.",
    "source": "Yes Punjab News",
    "publishedAt": "2026-01-08 08:05:54",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://yespunjab.com/delhi-police-identify-30-in-turkman-gate-stone-pelting-case-to-summon-sp-mp/"
  },
  {
    "title": "Chicago soybeans slip on South America outlook; wheat gains on US Plains dryness",
    "description": "BEIJING: Chicago soybean futures fell on Thursday, pressured by competition from global suppliers such as Brazil, which is expecting a bumper crop this year.The most-active soy contract on the Chicago Board of Trade (CBOT) fell 0.33% to $10.63-1/2 a bushel by 0443 GMT. Prices had earlier drawn support from China’s continued purchases of US soybeans.Beijing’s total purchases of the latest US crop are now estimated at between 8.5 million metric tons and nearly 10 million tons, according to traders and analysts.However, expectations of a large Brazilian soybean harvest weighed on Chicago prices.“Soybean prices are still being tempered by expectations of a large crop in South America,” said Claire Adams, an agricultural analyst at Bendigo Bank Agribusiness.On Wednesday, Sergio Mendes, head of grain traders lobby Anec, said in an interview that sales of US soybeans to China will partly dent demand for the Brazilian product this year from the world’s largest importer.CBOT wheat gained 0.1% to $5.18-1/2 a bushel.Tensions in the Black Sea region drew focus away from ample global wheat supplies, Adams said. Russian strikes late on Wednesday knocked out power supplies in almost all of two southeastern Ukrainian regions, the energy ministry said.Weather concerns across some US growing regions also lent support to wheat, Adams added. CBOT corn dipped 0.17% to $4.46 a bushel.The US Department of Agriculture is scheduled to release estimates for US winter wheat plantings on January 12, along with data on last year’s corn and soybean yields.Traders said they expected the agency to cut its estimate for average US corn yields due to late-season dryness.In Argentina, a key global food exporter, the Rosario Grains Exchange (BCR) forecasts a record 2025/26 corn harvest of 61 million tons and a soybean harvest of 47 million tons.",
    "source": "Business Recorder",
    "publishedAt": "2026-01-08 08:05:54",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.brecorder.com/news/40401212/chicago-soybeans-slip-on-south-america-outlook-wheat-gains-on-us-plains-dryness"
  }
]