[
  {
    "title": "Richard Branson announces death of his wife, Joan",
    "description": "“She was my best friend, my rock, my guiding light, my world,” the billionaire businessman said of his partner of 50 years.",
    "source": "News",
    "publishedAt": "2025-11-25 20:08:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.news.com.au/entertainment/celebrity-life/celebrity-deaths/richard-branson-announces-death-of-his-wife-joan/news-story/c99f21e64ecb13a6b42bccb593e92914?from=rss-basic"
  },
  {
    "title": "Strictly Come Dancing star breaks silence after concern fifth contestant would quit",
    "description": "Alex Kingston has shared a big update with fans.",
    "source": "Express",
    "publishedAt": "2025-11-25 20:08:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.express.co.uk/showbiz/tv-radio/2138655/strictly-come-dancing-star-breaks-silence-quit"
  },
  {
    "title": "US 'cannot defeat Venezuela', Maduro says amid tensions with Washington",
    "description": "Venezuelan President Nicolas Maduro defied the U.S. on Tuesday, saying that Washington “cannot defeat' his country, which he said is “invincible” amid the escalation of tensions in...",
    "source": "Daily Sabah",
    "publishedAt": "2025-11-25 20:08:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.dailysabah.com/world/americas/us-cannot-defeat-venezuela-maduro-says-amid-tensions-with-washington"
  },
  {
    "title": "Gold Rebounds As Traders Price In December Fed Cut",
    "description": "​Gold (XAUUSD:CUR) extended its rebound on Tuesday and trades near $4,140 as bullish momentum builds ahead of a heavy U.S. data slate.",
    "source": "Seeking Alpha",
    "publishedAt": "2025-11-25 20:08:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://seekingalpha.com/article/4847630-gold-rebounds-as-traders-price-in-december-fed-cut"
  },
  {
    "title": "Who is Sam Pepper? Firework incident in India leads to streamer’s permanent Kick ban and huge backlash",
    "description": "London streamer Sam Pepper faced a permanent ban after a firework injured a young girl during his Diwali livestream in New Delhi. The incident occurred on October 20. A rocket went astray, striking the girl near her eye. Pepper apologized and covered medical costs. The platform cited safety concerns for the ban. This event sparks discussions on livestream safety regulations.",
    "source": "The Times Of India",
    "publishedAt": "2025-11-25 20:07:59",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://timesofindia.indiatimes.com/world/us-streamers/who-is-sam-pepper-firework-incident-in-india-leads-to-streamers-permanent-kick-ban-and-huge-backlash/articleshow/125573650.cms"
  },
  {
    "title": "Marquis Who's Who Honors Sue Pellegrino As A Top Entrepreneur",
    "description": "(MENAFN - ACCESSWIRE) UNIONDALE, NY / ACCESS Newswire / November 25, 2025 / Marquis Who's Who honors Sue Pellegrino as a Top Entrepreneur. Ms. Pellegrino is the owner, president and chief financial ...",
    "source": "Menafn",
    "publishedAt": "2025-11-25 20:07:59",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://menafn.com/1110398005/Marquis-Whos-Who-Honors-Sue-Pellegrino-As-A-Top-Entrepreneur"
  },
  {
    "title": "Consumer confidence falls to lowest level since April as Americans worry about inflation and jobs",
    "description": "U.S. consumers were much less confident in the economy in November in the aftermath of the government shutdown, weak hiring, and stubborn inflation.The Conference Board said Tuesday that its consumer confidence index dropped to 88.7 in November from an upwardly revised October reading of 95.5,...",
    "source": "Biztoc",
    "publishedAt": "2025-11-25 20:07:58",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://biztoc.com/x/935d9146a8554b28"
  },
  {
    "title": "Middle East Dispatch newsletter: A tale from Tehran",
    "description": "Middle East Dispatch newsletter: A tale from TehranNick Pelham writes about his visit to Iran to interview the country’s foreign ministerThere were many reasons why Tehran, Iran’s capital, looked drabber, shabbier and less vivacious earlier this month than during my last visit six years ago....",
    "source": "Biztoc",
    "publishedAt": "2025-11-25 20:07:58",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://biztoc.com/x/3f17cdbbd95cbd08"
  },
  {
    "title": "Democrats say they are subjects of FBI probe after filming anti-Trump video",
    "description": "Several Congressional Democrats said Tuesday they might be under investigation by the FBI after filming an anti-Trump video urging military troops not to follow illegal orders. “President Trump is using the FBI as a tool to intimidate and harass Members of Congress. Yesterday, the FBI contacted...",
    "source": "Biztoc",
    "publishedAt": "2025-11-25 20:07:58",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://biztoc.com/x/c5eeb22a549996f6"
  },
  {
    "title": "Historic downtown Elgin building to be transformed into a boutique hotel, cafe",
    "description": "Plans to convert an historic downtown building into a 26-room, $4.3 million boutique hotel will be partially funded with Elgin TIF funds.The Elgin House would include a small café on the ground floor at its 53-63 Douglas Ave. location, according to plans submitted by Chicago Realty Ventures Inc.,...",
    "source": "Biztoc",
    "publishedAt": "2025-11-25 20:07:58",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://biztoc.com/x/aa9c6a7804c7f947"
  }
]