[
  {
    "title": "New York Could Pay Massive Price For Trump’s Latest Decision",
    "description": "New York Governor Kathy Hochul says President Donald Trump’s latest trade decision is more than bad politics, it’s a direct hit to New Yorkers’ wallets. Continue reading...",
    "source": "New Jersey 101.5",
    "publishedAt": "2025-10-31 20:18:36",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://nj1015.com/ixp/854/p/hochul-warns-trumps-trade-move-could-cost-new-yorkers-millions/"
  },
  {
    "title": "Chinese shift towards boosting consumption",
    "description": "China’s over-reliance on investment and exports to power its $19tn economy appears to have reached a limit.Chinese leaders are signalling a sharper shift towards supporting consumption over the next f...",
    "source": "Gulf Times",
    "publishedAt": "2025-10-31 20:18:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.gulf-times.com/article/714033/opinion/chinese-shift-towards-boosting-consumption"
  },
  {
    "title": "Glen Burnie Bancorp Announces Third Quarter 2025 Results",
    "description": "Highlights for the Third Quarter of 2025:Net income of $125,000 or $0.04 per diluted EPS during the third quarter of 2025, an improvement of $337,000 on a linked quarter basis, and net income of $66,000 or $0.02 per diluted EPS for the nine-month period ending September 30, 2025, an improvement of $138,000 from the previous year’s nine-month period loss of $72,000.Net interest margin on a tax equivalent basis increased to 3.24% with a margin expansion of 11 basis points during the third quarter of 2025 compared to the second quarter of 2025.Total loans increased by $2.0 million during the third quarter of 2025 and were up $7.3 million on an average balance basis from the second quarter of 2025.Total deposits were $329.1 million at September 30, 2025, up $11.8 million from June 30, 2025. Liquidity continues to remain at a very strong level, as evidenced by paying down all FHLB advances by the end of the quarter. The Bank is well positioned for future growth.As of the close of business on August 15, 2025, The Bank of Glen Burnie (\"Bank”) completed the acquisition of VA Wholesale Mortgage Incorporated (\"VAWM”). During the short period from August 16 to September 30, 2025, VAWM generated pretax income of $36,000. VAWM originates approximately $125 million per year in new mortgages across a wide array of loan products with specialized expertise in mortgage solutions for veterans and military personnel. The acquisition is expected to provide access to new products and markets for the Bank, create the ability to originate and sell mortgages off our balance sheet, and provide cross-selling opportunities for the Bank’s products and services to VAWM’s existing and new clients. GLEN BURNIE, Md., Oct. 31, 2025 (GLOBE NEWSWIRE) -- Glen Burnie Bancorp (\"Bancorp”) (NASDAQ: GLBZ), the bank holding company for The Bank of Glen Burnie (\"Bank”), today reported net income of $125,000 for the third quarter of 2025 as compared to net income of $129,000 in the third quarter of 2024, a 3.1% decrease. From a linked quarter basis, net income for the third quarter of 2025 increased $337,000 over the $212,000 net loss in the second quarter of 2025. Diluted earnings per share was $0.04 for both the third quarter of 2025 and the third quarter of 2024, but was an $0.11 improvement quarter-to-quarter as compared to a $(0.07) diluted loss per share in the second quarter of 2025.Year-to-date through September 30, 2025, net earnings were $66,000 compared to a net loss of $72,000 during the same nine-month period in 2024. Diluted earnings per share for the first nine months of 2025 was $0.02, compared to a diluted loss per share of $(0.02) during the same period in 2024.\"We are pleased with our results for this quarter as our strategic initiatives that were started over a year ago, continue to improve our balance sheet position and earnings. We are also excited to complete the acquisition of VAWM as we believe that our new subsidiary will help grow our non-interest income, increase our ability to serve new markets, and add a cornerstone product to our expanding line of products and services,” said Mark C. Hanna, President and Chief Executive Officer. \"Our strategic priorities continue to focus on increasing new revenue sources by growing our client relationships and becoming more operationally efficient. Achieving these objectives will expand our return on assets and capital.”Mr. Hanna added, \"We were also very pleased to see that our deposit base and cost of funding continues to remain competitive and stable while seeing good growth in our loan revenues. With strong liquidity and ample capital, we are very excited about our future and the benefits our strategic initiatives are beginning to produce.”Loan Portfolio Quality/Allowance for Loan LossesThe Bank’s asset quality metrics continue to be very good due to our focus on disciplined lending practices. The non-performing loans ratio as of September 30, 2025, was 0.56%, up 40 basis points from the third quarter 2024 and up slightly by 5 basis points from June 30, 2025. During the third quarter of 2025, the Bank had net charge-offs of $93,000 or 0.17% to average loans, as compared to net recoveries of $44,000 or -0.09% in the third quarter 2024, and net charge-offs of $45,000 or 0.09% in the second quarter of 2025. Provision expense was $44,000 in the third quarter 2025 compared to $105,000 for the third quarter 2024, and $79,000 in the second quarter 2025. The Bank’s allowance for loan losses to loans was 1.19% for the third quarter 2025, a decline of 0.02% from the second quarter of 2025 and a decline of 0.14% from the third quarter of 2024.Mr. Hanna noted, \"We continue to see and experience very good credit results and indicators in our markets, while our non-performing assets remain at lower levels. Our allowance for credit losses at 1.19% of loans, highlights our conservative stance on maintaining a healthy reserve on our balance sheet.”Balance SheetTotal loans were $215.3 million at September 30, 2025, an increase of $8.3 million, or 4.0%, from the third quarter of 2024, and $2.0 million from the second quarter of 2025. During the third quarter 2025, total average loans increased $7.3 million from the second quarter 2025 as a result of growth in commercial real estate loans of $2.4 million, $3.8 million of growth in the C&I portfolio, and a $1.1 million increase in consumer loans (automobile).Total deposits were $329.1 million at September 30, 2025, an increase of $14.8 million, or 4.7%, from the third quarter of 2024, and $11.8 million from the second quarter of 2025. Non-interest-bearing deposits, which are 33% of total deposits, were down by $8.6 million, or 7.4%, from the third quarter of 2024, and were relatively unchanged from the second quarter of 2025. Interest-bearing deposits ended at $221.7 million for the third quarter of 2025, a $23.4 million increase from the third quarter 2024, or 11.8%, and an increase of $11.4 million from the second quarter 2025. The Bank’s communities and markets remain very competitive for deposits by customers who are very rate sensitive.Interest-bearing cost of deposits increased on a linked quarter basis to 1.91% in the third quarter of 2025 from 1.78% due to the shift of deposit balances from lower cost deposits to the Bank’s higher rate money market accounts and CDs. Total cost of funds, including noninterest sources decreased 0.04% on a linked quarter basis to 1.32%. During the quarter the bank paid off all advances from the FHLB, which were $30 million at the end of the third quarter 2024 and $13.0 million at the end of the second quarter of 2025.Mr. Hanna commented, \"We are glad to see continued growth in our deposit base as those deposits are a strength of our Bank and a big contributor to our strong liquidity. As of September 30, 2025, our liquidity sources improved to the point where we paid off all FHLB advances by the end of the quarter. We still have many sources for additional liquidity in the form of $50.9 million in borrowing capacity with the FHLB, open pledging capacity of our securities portfolio of $56.8 million, $34.6 million in borrowing capacity with FRB, and additional access to other wholesale funding of $123 million. This additional liquidity capacity will provide the funding we need to create a more customer-based balance sheet as our reliance on investment securities continues to decline while growing commercial loan relationships within our markets and the communities we serve.”The investment securities available for sale was $104.1 million, after the fair value adjustment of $22.3 million at September 30, 2025, with a yield of 2.23% for the third quarter 2025, down $15.8 million from the third quarter of 2024, and down $0.4 million from the second quarter of 2025. The effective duration of the securities portfolio is 7.3 years. Accumulated Other Comprehensive Loss (AOCL) of $16.2 million was up from $15.7 million when compared to the third quarter of 2024, and down from the second quarter of 2025 by $1.7 million. Changes in the Bank’s AOCL in the investment portfolio are attributable to changes in the economy as bonds with longer maturities are more sensitive to interest rate changes. The Bank does not intend to sell nor buy any new securities as our strategic direction is to grow our balance sheet through new loans instead of increasing our reliance on the securities portfolio.Each of the regulatory capital ratios for the Bank exceeds the well capitalized minimum levels currently required by regulatory statute. At September 30, 2025, the Bank’s regulatory capital ratios (Leverage, Tier I Risk Based and Total Risk Based) were 9.67%, 14.82 %, and 15.96% respectively. These compared to the ratios as of June 30, 2025, of 9.59%, 14.91%, and 16.06% and to September 30, 2024, of 10.11%, 15.47%, and 16.72%, respectively.RevenueNet Interest Income/Net Interest MarginNet interest income was $2.8 million for both the third quarters of 2025 and 2024, compared to net interest income of $2.7 million in the second quarter of 2025. The net interest margin for the third quarter of 2025, on a tax equivalent basis, was 3.24% up 10 basis points from the third quarter of 2024 and up 11 basis points from the second quarter of 2025. The increase in the Bank’s net interest margin is due a continued change in the mix of earning assets from lower yielding assets to higher yielding loans. Yields on total loans improved by 15 basis points to 5.73% on a linked quarter basis and were up 4 basis points from the third quarter of 2024, while the total cost of funds was 1.32% in both the third quarters of 2025 and 2024, but down 4 basis points over the second quarter of 2025 from 1.36%. Total earning assets were $354.9 million, down $11.3 million from the third quarter 2024 and down $4.4 million from the second quarter 2025.Mr. Hanna commented, \"We continue to see our mix of earning assets move from cash and securities to a higher percentage of loans. A year ago, in the third quarter of 2024, our loans were 56% of our earning assets where today at the end of the third quarter of 2025, loans represented 61% of our total earning assets, up from 58% in the second quarter of 2025. This is an important and intentional shift in our balance sheet to work around the existing securities portfolio structure.”Non-Interest IncomeNon-interest income in the third quarter of 2025 was $571,000 compared to $354,000 in the third quarter of 2024 and $220,000 in the second quarter of 2025. Mortgage fees from VAWM for the third quarter of 2025 were $192,000, which was the primary cause of the increased non-interest income. The Bank anticipates continued increases in its non-interest income in the form of mortgage fees due to the acquisition of VAWM.Non-Interest ExpenseNoninterest expense totaled $3.3 million for the third quarter of 2025, up $0.3 million from the third quarter of 2024, and relatively equal to the second quarter of 2025. Most of the increase from the third quarter of 2024 was related to non-recurring legal and professional fees from the acquisition of VAWM as well as new operating expenses from VAWM. Salary and related employment benefits were up $211,000 from the third quarter 2024 primarily due to increased headcount at the bank in the latter part of 2024 and new salaries and benefit costs at VAWM. When compared to the second quarter 2025, these costs were down by $161,000 as reductions in headcount in the first and second quarters of 2025 are now being recognized. Salaries and related benefits at VAWM for the third quarter of 2025 were $139,000. Occupancy and equipment expenses, legal, accounting and professional fees, and data processing services combined were up by $89,000 from the third quarter 2024 and up $188,000 from the second quarter 2025 primarily due to increases in legal and professional fees related to the VAWM acquisition and interim finance and accounting consulting help. All other expenses were relatively flat when compared to the third quarter 2024 and second quarter 2025.Acquisition Summary - VA Wholesale Mortgage IncorporatedAs of the close of business on August 15, 2025, the Bank, a Maryland-chartered bank, completed the acquisition of VAWM, a Virginia corporation engaged in residential mortgage banking, lending, and brokerage services, from Eric Tan, its sole shareholder (\"Seller”).Pursuant to the Stock Purchase Agreement, the Bank purchased 100 percent of the issued and outstanding shares of VAWM for a total purchase price of $750,000, payable under a 36-month, interest-free promissory note. The note provides for monthly forgiveness of one-thirty-sixth of the balance over the term, subject to continuing employment and other specified conditions. Amortization of the note will be treated as compensation expense.In addition, the Seller is entitled to post-closing contingent consideration (\"earn-out”) equal to 33% of VAWM’s net earnings plus 0.04% of closed-loan volume for a period of three years following the closing date, estimated to be $298,000 based on historical production and future growth. Earn-out payments are to be determined annually based on VAWM’s financial results, with supporting statements delivered after each year-end.Concurrent with closing, the Seller entered into an employment agreement with the Bank, continuing to serve in a management role to support the integration of the mortgage operations into the Bank’s business. The acquisition was affected through a private stock purchase and did not involve the issuance of any shares by the Bank.The transaction was accounted for as a purchase of a business under ASC 805, with VAWM becoming a wholly owned subsidiary of the Bank. The acquisition expands the Bank’s retail mortgage banking capabilities within its existing Mid-Atlantic market footprint. Further details of the financial impacts will be included in the Bancorp’s Financial Statements and Notes in Form 10-Q for the period ended September 30, 2025.Glen Burnie Bancorp InformationGlen Burnie Bancorp is a bank holding company headquartered in Glen Burnie, Maryland. Founded in 1949, The Bank of Glen Burnie® is a locally owned community bank with six branch offices serving Anne Arundel County. The Bank is engaged in the commercial and retail banking business including the acceptance of demand and time deposits, and the origination of loans to individuals, associations, partnerships, and corporations. The Bank’s real estate financing consists of residential first and second mortgage loans, home equity lines of credit and commercial mortgage loans. The Bank also originates automobile loans through arrangements with local automobile dealers. Additional information is available at www.thebankofglenburnie.com.Forward-Looking StatementsThe statements contained herein that are not historical financial information may be deemed to constitute forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Such statements are subject to certain risks and uncertainties, which could cause the Company’s actual results in the future to differ materially from its historical results and those presently anticipated or projected. These statements are evidenced by terms such as \"anticipate,” \"estimate,” \"should,” \"expect,” \"believe,” \"intend,” and similar expressions. Although these statements reflect management’s good faith beliefs and projections, they are not guarantees of future performance and they may not prove true. For a more complete discussion of these and other risk factors, please see the Company’s reports filed with the Securities and Exchange Commission.GLEN BURNIE BANCORP AND SUBSIDIARYCONSOLIDATED BALANCE SHEETS(dollars in thousands) September 30, June 30, December 31, September 30, 2025 2025 2024 2024 (unaudited) (unaudited) (audited) (audited)ASSETS Cash and due from banks$2,359 $1,677 $2,012 $2,255 Interest-bearing deposits in other financial institutions 9,868 10,991 22,452 20,207 Total Cash and Cash Equivalents 12,227 12,668 24,464 22,462 Investment securities available for sale, at fair value 104,141 104,566 107,949 119,958 Restricted equity securities, at cost 251 869 1,671 246 Loans 215,320 213,362 205,219 206,975 Less: Allowance for credit losses (2,568) (2,587) (2,839) (2,748)Loans, net 212,752 210,775 202,380 204,227 Premises and equipment, net 2,463 2,575 2,678 2,723 Bank owned life insurance 8,966 8,921 8,834 8,789 Deferred tax assets, net 7,475 8,102 8,548 6,879 Accrued interest receivable 1,340 1,206 1,345 1,478 Accrued taxes receivable 310 271 148 497 Prepaid expenses 434 386 471 486 Other assets 1,435 382 468 614 Total Assets$351,794 $350,721 $358,956 $368,359 LIABILITIES Noninterest-bearing deposits$107,368 $107,027 $100,747 $115,938 Interest-bearing deposits 221,701 210,289 208,442 198,335 Total Deposits 329,069 317,316 309,189 314,273 Short-term borrowings - 13,000 30,000 30,000 Defined pension liability 341 340 330 329 Accrued expenses and other liabilities 1,655 1,132 1,620 2,597 Total Liabilities 331,065 331,788 341,139 347,199 STOCKHOLDERS' EQUITY Common stock, par value $1, authorized 15,000,000 shares, issued and outstanding 2,919,695; 2,900,681; 2,900,681; and 2,900,681 shares as of September 30, 2025, June 30, 2025, December 31, 2024, and September 30, 2024, respectively. 2,920 2,901 2,901 2,901 Additional paid-in capital 11,119 11,037",
    "source": "The Manila Times",
    "publishedAt": "2025-10-31 20:17:58",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.manilatimes.net/2025/11/01/tmt-newswire/globenewswire/glen-burnie-bancorp-announces-third-quarter-2025-results/2213448"
  },
  {
    "title": "Rio Tinto and Canada Growth Fund announce transaction to advance Canadian production of scandium",
    "description": "SOREL-TRACY, Québec – Rio Tinto and Canada Growth Fund Inc. (CGF) are pleased to announce a transaction to advance the Canadian production of scandium",
    "source": "The National Tribune",
    "publishedAt": "2025-10-31 20:17:49",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.nationaltribune.com.au/rio-tinto-and-canada-growth-fund-announce-transaction-to-advance-canadian-production-of-scandium/"
  },
  {
    "title": "Construction of Russia’s largest wind power plant to be completed in March 2026",
    "description": "The total installed capacity of the wind farm will be 300 MW",
    "source": "Тасс",
    "publishedAt": "2025-10-31 20:17:44",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://tass.com/economy/2038271"
  },
  {
    "title": "Two-year Congress rule undone 10-year BRS development in Telangana: KTR",
    "description": "BRS working president KT Rama Rao charged Chief Minister A Revanth Reddy with ruining Telangana’s economy in just two years and undoing a decade of development achieved under K Chandrashekhar Rao’...",
    "source": "Etemaad Daily",
    "publishedAt": "2025-10-31 20:17:39",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "http://www.en.etemaaddaily.com/world/hyderabad/two-year-congress-rule-undone-10-year-brs-development-in-telangana-ktr:183910"
  },
  {
    "title": "Cielo Waste Solutions Announces Webinar Presenting Project Nexus Advancements",
    "description": "CALGARY, Alberta, Oct. 31, 2025 (GLOBE NEWSWIRE) -- Cielo Waste Solutions Corp. (TSXV: CMC; OTCQB: CWSFF) (\"Cielo” or the \"Company”) will host a live investor and stakeholder webinar on Thursday, November 20, 2025, at 11:00 a.m. MST to communicate advancements in its previously announced flagship project known as \"Project Nexus”.The presentation will highlight technology integrations, partnership developments, and operational strategies. Cielo’s leadership team will also discuss expected near-term milestones for Project Nexus.A live Q&A will follow.DATE: Thursday, November 20, 2025 TIME: 11:00 a.m. MSTRegister by clicking the link: Project Nexus Webinar or visit the Cielo website at cielows.comABOUT PROJECT NEXUSProject Nexus is Cielo’s intended large-scale platform for converting biomass and wood waste into low-carbon transportation fuels such as sustainable aviation fuel. The project represents a key pillar of Cielo’s strategy to advance clean-energy solutions while leveraging proven technology and disciplined capital deployment.ABOUT CIELOCielo Waste Solutions Corp. is a publicly traded company focused on transforming waste materials into high-value products. Cielo seeks to address global waste challenges while contributing to the circular economy and reducing carbon emissions. Cielo is fueling environmental change with a mission to be a leader in the wood by-product-to-fuels industry by using environmentally friendly, economically sustainable and market-ready technologies. Cielo is committed to helping society by providing environmental waste solutions, which the Company believes will contribute to generating positive returns for shareholders. Cielo shares are listed on the TSX Venture Exchange under the symbol \"CMC,” as well as on the OTCQB under the symbol \"CWSFF.”For further information please contact:Ryan C. Jackson, CEOPhone: (403) 348-2972Email: investors@cielows.comCAUTIONARY NOTE REGARDING FORWARD-LOOKING STATEMENTSThis news release contains certain forward-looking statements and forward-looking information (collectively referred to herein as \"forward-looking statements”) within the meaning of applicable Canadian securities laws. All statements other than statements of present or historical fact are forward-looking statements. Forward-looking statements are often, but not always, identified by the use of words such as \"anticipate”, \"achieve”, \"could”, \"believe”, \"plan”, \"intend”, \"objective”, \"continuous”, \"ongoing”, \"estimate”, \"outlook”, \"expect”, \"may”, \"will”, \"project”, \"should” or similar words, including negatives thereof, suggesting future outcomes.Forward-looking statements are subject to both known and unknown risks, uncertainties, and other factors, many of which are beyond the control of Cielo, that may cause the actual results, level of activity, performance, or achievements of the Company to be materially different from those expressed or implied by such forward-looking statements. Forward-looking statements and information are based on plans, expectations and estimates of management at the date the information is provided and are subject to certain factors and assumptions. The Company is making forward-looking statements, including but not limited to, with respect to the timing, content and other details of the webinar.Investors should continue to review and consider information disseminated through news releases and filed by Cielo on SEDAR+. Although the Company has attempted to identify crucial factors that could cause actual results to differ materially from those contained in forward-looking statements, there may be other factors that cause results not to be as anticipated, estimated or intended.Forward-looking statements are not a guarantee of future performance and involve a number of risks and uncertainties, some of which are described herein. Such forward-looking statements necessarily involve known and unknown risks and uncertainties, which may cause Cielo’s actual performance and results to differ materially from any projections of future performance or results expressed or implied by such forward-looking statements. Any forward-looking statements are made as of the date hereof and, except as required by law, the Company assumes no obligation to publicly update or revise such statements to reflect new information, subsequent or otherwise.Neither the TSX Venture Exchange nor its Regulation Services Provider (as such term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this news release.",
    "source": "The Manila Times",
    "publishedAt": "2025-10-31 20:17:24",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.manilatimes.net/2025/11/01/tmt-newswire/globenewswire/cielo-waste-solutions-announces-webinar-presenting-project-nexus-advancements/2213440"
  },
  {
    "title": "Greece and Canada Explore Year-Round Direct Flight Service from Athens to Boost their Tourism and Business Ties",
    "description": "Greece and Canada Explore Year-Round Direct Flight Service from Athens to Boost their Tourism and Business TiesGreece and Canada discuss the introduction of a year-round direct flight service from Athens, aimed at boosting tourism, business and sustainable travel.The post Greece and Canada Explore Year-Round Direct Flight Service from Athens to Boost their Tourism and Business Ties appeared first on Travel And Tour World.",
    "source": "Travel And Tour World",
    "publishedAt": "2025-10-31 20:16:41",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.travelandtourworld.com/news/article/greece-and-canada-explore-year-round-direct-flight-service-from-athens-to-boost-their-tourism-and-business-ties/"
  },
  {
    "title": "Punjab govt readies law to take on land-property mafia",
    "description": "Chief Minister Maryam Nawaz Sharif has approved Punjab Protection of Ownership and Immovable Property Ordinance 2025 to deal with those who grab the property of the people. Chairing a meeting in Lahore, Chief Minister Maryam Nawaz has established Dispute Resolution Committees under Ordinance for the petitioners who have been going through the courts for years. [...]",
    "source": "Daily Times - Latest Pakistan News, World, Busines",
    "publishedAt": "2025-10-31 20:16:21",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://dailytimes.com.pk/1392945/punjab-govt-readies-law-to-take-on-land-property-mafia/"
  },
  {
    "title": "OpenAI Launches Paid Tier for Sora AI Video Generations",
    "description": "OpenAI has launched a paid tier for its Sora AI video app, allowing users to buy extra generations (e.g., 10 for $4) beyond free daily limits, signaling a shift toward monetization for sustainability. This mirrors ChatGPT's model and plans include reducing free access. The move aims to build a profitable AI video ecosystem.",
    "source": "Webpronews",
    "publishedAt": "2025-10-31 20:16:16",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.webpronews.com/openai-launches-paid-tier-for-sora-ai-video-generations/"
  }
]