[
  {
    "title": "Here’s how much passive income £10,000 in Legal & General shares could generate",
    "description": "For passive income investors, a well-diversified selection of stocks can even out the risks from individual companies or sectors.The post Here’s how much passive income £10,000 in Legal & General shares could generate appeared first on The Motley Fool UK.",
    "source": "Fool Uk",
    "publishedAt": "2026-01-31 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.fool.co.uk/2026/01/31/heres-how-much-passive-income-10000-in-legal-general-shares-could-generate/"
  },
  {
    "title": "Charles P Leo, PhD",
    "description": "Funeral services will be held on Monday, February 2nd at 3:00 PM at Forest Lawn Hollywood Hills, Church of the Hills.",
    "source": "Ocregister",
    "publishedAt": "2026-01-31 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.ocregister.com/obituaries/charles-p-leo-phd-huntington-beach-ca/"
  },
  {
    "title": "Gene stewart",
    "description": "Gene died at home in Willits on December 12, 2025. Gene was born in Santa Cruz, CA on March 13, 1934 to Ernestine (Trask) and Francis Stewart. As a young man, Gene worked as a carpenter’s apprentice in San Francisco. He later served as a soldier in the Army band during the Korean War. After [...]",
    "source": "Ukiah Daily Journal",
    "publishedAt": "2026-01-31 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.ukiahdailyjournal.com/obituaries/gene-stewart-willits-ca/"
  },
  {
    "title": "WasteServ receives S.A.F.E Award for 'commitment to employee wellbeing'",
    "description": "WasteServ has been recognised by the Foundation for Social Welfare Services (FSWS) with the S.A.F.E Award for its efforts to promote healthier and safer workplaces, the entity said Saturday. This award highlights the company's strong commitment to employee wellbeing through the implementation of various initiatives.\"Employee wellbeing is of utmost importance for WasteServ. As a workplace, we are determined to help and support any employees suffering from substance use disorders so that they can recover. It is essential for us to provide a supportive, stigma‐free, and recovery‐friendly environment,\" stated WasteServ CEO Richard Bilocca.The S.A.F.E programme focuses on preventing addiction in the workplace and providing support to employees who may be facing substance‐related challenges. WasteServ's participation reflects its dedication to creating a safe, supportive, and recovery‐oriented work environment.Over the past years, WasteServ has made significant investments in initiatives aimed at supporting its workforce. Alongside the introduction of family‐friendly measures and flexible working hours, the company has established a dedicated Recovery Support Unit (RSU). This specialised unit offers one‐to‐one guidance and services delivered by an experienced multidisciplinary team of professionals, ensuring that employees dealing with substance use disorders have access to personalised care and the best possible support on their recovery journey.Receiving the S.A.F.E Award further strengthens WasteServ's ongoing commitment to building a healthier and more inclusive workplace for all, the company said.",
    "source": "Malta Independent",
    "publishedAt": "2026-01-31 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.independent.com.mt/articles/2026-01-31/local-news/WasteServ-receives-S-A-F-E-Award-for-commitment-to-employee-wellbeing-6736286854"
  },
  {
    "title": "Joseph S. Lawton, M.D.",
    "description": "Joseph S. Lawton, M.D., beloved husband, father, grandfather, friend, physician, coach, role model, and friend, died on Wednesday, December 10, 2025, at age 91 of pneumonia and myelodysplastic syndrome. Joe is preceded in death by his parents, Stanley and Bernardine; beloved wife of 64 years, Joanna; brothers Thomas and Robert Phillip; and son, Jerry.Joe, the [...]",
    "source": "Ocregister",
    "publishedAt": "2026-01-31 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.ocregister.com/obituaries/joseph-s-lawton-md-fulleton-ca/"
  },
  {
    "title": "Meghan Markle blasted by fans who spot 'mistake' in As Ever Valentine's photo",
    "description": "Meghan Markle's latest post promoting her As Ever lifestyle brand's Valentine's Day chocolate collection has left fans divided",
    "source": "Daily Express Us",
    "publishedAt": "2026-01-31 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.the-express.com/entertainment/celebrity-news/197782/meghan-markle-blasted-fans-who-spot-blunder-ever-valentine-s-photo"
  },
  {
    "title": "Here’s how much passive income £10,000 in Legal & General shares could generate",
    "description": null,
    "source": "Yahoo! News",
    "publishedAt": "2026-01-31 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://uk.finance.yahoo.com/news/much-passive-income-10-000-080500100.html"
  },
  {
    "title": "OG ‘Ramba Ho Ho Ho’ girl Kalpana Iyer recreates iconic dance at Family wedding in new Dhurandhar song, video goes viral",
    "description": "Veteran actress Kalpana Iyer, famously known as the OG \"Ramba Ho\" girl, has gone viral for recreating her iconic dance at a family wedding.",
    "source": "Zee News",
    "publishedAt": "2026-01-31 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://zeenews.india.com/people/og-ramba-ho-ho-ho-girl-kalpana-iyer-recreates-iconic-dance-at-family-wedding-in-new-dhurandhar-song-video-goes-viral-3012226.html"
  },
  {
    "title": "Original 'Bagets' stars recall happy times upon seeing stage version",
    "description": "\"Bagets the Musical\" stirred some happy memories in the stars of the original 1984 film the production is based on.",
    "source": "Philstar.com",
    "publishedAt": "2026-01-31 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.philstar.com/entertainment/2026/01/31/2504808/original-bagets-stars-recall-happy-times-upon-seeing-stage-version"
  },
  {
    "title": "Harry Styles tickets and where fans can buy them on resale if they missed out",
    "description": "Harry Styles fans can still buy tickets for the 12 Wembley Stadium nights.",
    "source": "Express",
    "publishedAt": "2026-01-31 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.express.co.uk/entertainment/music/2164322/harry-styles-tickets-resale-viagogo-stubhub"
  }
]