[
  {
    "title": "Kraft Heinz names former Kellogg CEO to helm Chicago packaged food giant ahead of planned split next year - Tue, 16 Dec 2025 PST",
    "description": "Kraft Heinz has named veteran Chicago-based executive Steve Cahillane as CEO beginning Jan. 1, taking the reins of the packaged food giant as it prepares to split into two companies. Cahillane most recently served as chairman and CEO of Kellanova, the Chicago-based snack foods spinoff from cereal-maker Kellogg, which was acquired by Mars in a $36 billion deal that closed last week. The ...",
    "source": "Spokesman",
    "publishedAt": "2025-12-16 23:34:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "http://www.spokesman.com/stories/2025/dec/16/kraft-heinz-names-former-kellogg-ceo-to-helm-chica/"
  },
  {
    "title": "Tuesday primaries will decide who advances to special elections for Minnesota House seats",
    "description": "Voters in St. Paul and the east metro area will decide Tuesday which candidates will advance to special elections for two vacant Minnesota House seats.",
    "source": "Mankato Free Press",
    "publishedAt": "2025-12-16 23:34:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.mankatofreepress.com/tuesday-primaries-will-decide-who-advances-to-special-elections-for-minnesota-house-seats/article_8f1447be-f725-4dd6-aaba-3db7f27c3568.html"
  },
  {
    "title": "Kraft Heinz names former Kellogg CEO to helm Chicago packaged food giant ahead of planned split next year",
    "description": "Kraft Heinz has named veteran Chicago-based executive Steve Cahillane as CEO beginning Jan. 1, taking the reins of the packaged food giant as it prepares to split into two companies. Cahillane most recently served as chairman and CEO of Kellanova,...",
    "source": "The Brunswick News",
    "publishedAt": "2025-12-16 23:34:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://thebrunswicknews.com/news/business/kraft-heinz-names-former-kellogg-ceo-to-helm-chicago-packaged-food-giant-ahead-of-planned/article_fff86ff7-3119-5933-8314-d39d5046ffe6.html"
  },
  {
    "title": "Chronic breathlessness emerging as a hidden strain on hospitals",
    "description": "Chronic breathlessness, a symptom often overlooked by healthcare systems, is associated with longer lengths of hospital stay on already overstretched healthcare resources. A new study highlights an urgent need for clinicians and policymakers to recognise chronic breathlessness as a major driver of hospital admissions and healthcare costs and consider making it the ‘sixth vital sign’ in emergency and inpatient settings.",
    "source": "Science Media Exchange",
    "publishedAt": "2025-12-16 23:34:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.scimex.org/newsfeed/chronic-breathlessness-emerging-as-a-hidden-strain-on-hospitals"
  },
  {
    "title": "Pitt-Johnstown's Trevon Gray named PSAC co-wrestler of the week",
    "description": "Trevon Gray, the top-ranked wrestler in NCAA Division II at 125 pounds, was named Pennsylvania State Athletic Conference co-wrestler of the week Tuesday after posting a 5-0 record and winning an individual championship Sunday at the Midwest Classic in Indianapolis. Gray shares this week's honor with Gannon's Jerry Echevarria, who claimed the Midwest Classic title at 133. The redshirt senior ...",
    "source": "Yahoo! News",
    "publishedAt": "2025-12-16 23:34:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://sports.yahoo.com/articles/pitt-johnstowns-trevon-gray-named-233400456.html"
  },
  {
    "title": "NEC announces basketball TV package this winter",
    "description": "The Northeast Conference announced its television package, and the St. Francis men's and women's basketball teams will each have a road game on ESPN+ and a home game on the RYZ Network. The Red Flash women's basketball game at Chicago State Jan. 22 will be an ESPN+ exclusive, while the men's basketball contest at Mercyhurst Feb. 5 will air on ESPN+, SNP+ and NESN Nation. Both the St. Francis ...",
    "source": "Yahoo! News",
    "publishedAt": "2025-12-16 23:34:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://sports.yahoo.com/articles/nec-announces-basketball-tv-package-233400920.html"
  },
  {
    "title": "Portion of Fraser HWY in Surrey reopens to traffic after over 8-month closure for SkyTrain construction",
    "description": "Closure was on Fraser Highway between 140 Street and 96 Ave",
    "source": "Peace Arch News",
    "publishedAt": "2025-12-16 23:34:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://peacearchnews.com/2025/12/16/portion-of-fraser-hwy-in-surrey-reopens-to-traffic-after-over-8-month-closure-for-skytrain-construction/"
  },
  {
    "title": "CDC formally stops recommending hepatitis B vaccines for all newborns - NBC News",
    "description": "CDC formally stops recommending hepatitis B vaccines for all newborns NBC NewsCDC approves major child vaccine change, rejects controversial one The Washington PostThis vaccine adviser to RFK Jr. has some choice words for his critics PoliticoCDC adopts advisers’ recommendation against universal hepatitis B vaccines for babies CNNUS CDC accepts advisers' recommendations for hepatitis B vaccine in major policy shift Reuters",
    "source": "Google News",
    "publishedAt": "2025-12-16 23:34:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxNS1RhTjFtRGFoNXQwek9Wb21mVWZQa0tpMW9rZEJrMFExSTRqM1ptSUs1MTNpaG94TU8xQTJBa25BWi10aTN3ZWgzMUdXZmhfeEo0M1h2TzVZT2xzNkJnN0JCamI2b3FEQmVrUG9XMkhRVGVDTVI1ZlY3YzlsU1NEYVY5WTIxWVdSNmluMnl0TVhkNXAwcE9UTTlqSTVueWJzVjY3NmhFMkZfQdIBVkFVX3lxTFBTbm91VVhUY2gxd05WbjVvcENlQWJ6XzZ0ZVJQWEVEc3ctYkxWM0hPT245ZGJhY3ZSN0tPTlFNYkFHaFI4dVdEcjk1NEZNdXQ2RUJYSUFB?oc=5"
  },
  {
    "title": "Police investigate obscene TikTok post allegedly made by minor",
    "description": "By Breaking Belize News Staff (HP): Police in the Orange Walk District are investigating a report involving the use of a computer system to transmit obscene and vulgar content after a woman lodged a complaint over a social media post. According to police, on Monday, December 15, 2025, a 23-year-old Belizean woman of San Pablo [...]The post Police investigate obscene TikTok post allegedly made by minor appeared first on Belize News and Opinion on www.breakingbelizenews.com.",
    "source": "Breakingbelizenews",
    "publishedAt": "2025-12-16 23:33:50",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.breakingbelizenews.com/2025/12/16/police-investigate-obscene-tiktok-post-allegedly-made-by-minor/"
  },
  {
    "title": "Celebrity Hairstylist Marc Mena Says Extensions Might Be the Secret to Growing Healthier Locks",
    "description": "Celebrity hairstylist Marc Mena tells ET how extensions can help you grow healthier locks with his install and maintenance tips.",
    "source": "Et",
    "publishedAt": "2025-12-16 23:33:49",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.etonline.com/celebrity-hairstylist-marc-mena-says-extensions-might-be-the-secret-to-growing-healthier-locks"
  }
]