[
  {
    "title": "AST Space Mobile Set to Launch First BlueBird 6 Satellite on 15th Dec 2025",
    "description": "Satellite operator AST SpaceMobile, which is working with Joint Venture (SatCo) partner Vodafone to launch a space-based 4G and 5G mobile (mobile broadband) service to connect with everyday Smartphones on the ground, has announced that their first commercial BlueBird 6 spacecraft will launch on 15th December from the Satish Dhawan Space Center (India). Just to [...]",
    "source": "Ispreview",
    "publishedAt": "2025-11-22 08:04:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.ispreview.co.uk/index.php/2025/11/ast-space-mobile-set-to-launch-first-bluebird-6-satellite-on-15th-dec-2025.html"
  },
  {
    "title": "Optical illusion shows black and white image in colour – but only on 1 occasion",
    "description": "An optical illusion has left people stunned as it tricks their brains into seeing a black and white image in full colour - but only if you do one essential thing",
    "source": "Dailystar Co Uk",
    "publishedAt": "2025-11-22 08:04:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.dailystar.co.uk/news/weird-news/optical-illusion-shows-black-white-36278179"
  },
  {
    "title": "Preparing to study abroad requires knowing what might go wrong during and after the trip",
    "description": null,
    "source": "Kuwait News",
    "publishedAt": "2025-11-22 08:04:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.arabtimesonline.com/news/preparing-to-study-abroad-requires-knowing-what-might-go-wrong-during-and-after-the-trip/"
  },
  {
    "title": "Dear Abby: Single son’s attempts to keep parents close seem to be failing",
    "description": "He invites them to his place for dinner often. But they rarely accept.",
    "source": "Oregon Local News",
    "publishedAt": "2025-11-22 08:04:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.oregonlive.com/entertainment/2025/11/dear-abby-single-sons-attempts-to-keep-parents-close-seem-to-be-failing.html"
  },
  {
    "title": "Alison Hammond says 'no one should have to' as homeless mum opens up about tough Christmas",
    "description": "Television presenter Alison Hammond has spoken out after speaking to homeless families living in temporary accommodation",
    "source": "Birmingham Live",
    "publishedAt": "2025-11-22 08:04:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.birminghammail.co.uk/whats-on/whats-on-news/alison-hammond-says-no-one-32907129"
  },
  {
    "title": "Dahmen misses cut at RSM Classic; will lose full PGA Tour card",
    "description": "It wasn’t all bad news for the Dahmens, who welcomed their second son to the family this month",
    "source": "The Lewiston Tribune Online",
    "publishedAt": "2025-11-22 08:04:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.lmtribune.com/sports/dahmen-misses-cut-at-rsm-classic-will-lose-full-pga-tour-card-20879736"
  },
  {
    "title": "Indian Railways Crosses 1 Billion Tonne Freight Loading In FY26 To Date",
    "description": "According to the statement, these measures aim to increase bulk handling capacity, reduce transit time, and lower logistics costs, directly benefiting both industry players and end consumers while driving greater efficiency across the supply chain.",
    "source": "Zee News",
    "publishedAt": "2025-11-22 08:04:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://zeenews.india.com/railways/indian-railways-crosses-1-billion-tonne-freight-loading-in-fy26-to-date-2988071.html"
  },
  {
    "title": "A brother lost too soon: A tribute to inspector Shah Asrar Ul Haq",
    "description": "There are moments in life that carve themselves so deeply into one’s memory that they alter the shape of time. Some nights refuse to fade, no matter how many dawns arrive after them. For me,...",
    "source": "The Times Of India",
    "publishedAt": "2025-11-22 08:03:56",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://timesofindia.indiatimes.com/blogs/voices/a-brother-lost-too-soon-a-tribute-to-inspector-shah-asrar-ul-haq/"
  },
  {
    "title": "Insecurity: Kefas Shuts Down Boarding Schools In Taraba",
    "description": "Taraba State Governor, Agbu Kefas, has ordered all secondary schools both public and private to immediately send their boarding students home following heightened security threats across the country. The directive was issued in a statement signed by the State Commissioner for Education, Dr. Augustina Godwin. She stated that the rising wave of insecurity has made...The post Insecurity: Kefas Shuts Down Boarding Schools In Taraba appeared first on New Telegraph.",
    "source": "New Telegraph",
    "publishedAt": "2025-11-22 08:03:54",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://newtelegraphng.com/insecurity-kefas-shuts-down-boarding-schools-in-taraba/"
  },
  {
    "title": "Nigeria school attacks: 215 students kidnapped from Catholic school amid outrage over violence against Christians",
    "description": "Abuja, Nigeria — Police in Nigeria’s north-central Niger State reported that a group of armed bandits invaded a private Catholic school abducting hundreds of schoolchildren early on Friday, amid widespread outrage over violence against Christians in the West African nation. Despite some students managing to get to safety during the attack, the Christian Association of ...The post Nigeria school attacks: 215 students kidnapped from Catholic school amid outrage over violence against Christians appeared first on Egypt Independent.",
    "source": "Egyptindependent",
    "publishedAt": "2025-11-22 08:03:49",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.egyptindependent.com/nigeria-school-attacks-215-students-kidnapped-from-catholic-school-amid-outrage-over-violence-against-christians/"
  }
]