[
  {
    "title": "Amir attends 2026 Qatar ExxonMobil Open final",
    "description": "DOHA: His Highness the Amir of the State of Qatar Sheikh Tamim bin Hamad Al Thani attended the men's final of the 34th Qatar ExxonMobil Open tennis tournament, held this evening at...",
    "source": "Qatar Tribune",
    "publishedAt": "2026-02-21 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.qatar-tribune.com/article/220610/latest-news/amir-attends-2026-qatar-exxonmobil-open-final"
  },
  {
    "title": "No. 9 Nebraska wastes no time in home drubbing over Penn State",
    "description": "LINCOLN — Nebraska men’s basketball was able to get back on track after Tuesday’s upset loss at Iowa, as the ninth-ranked Huskers blew out Penn State, 87-64, Saturday afternoon in Lincoln.",
    "source": "Hastingstribune",
    "publishedAt": "2026-02-21 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.hastingstribune.com/husker_red_zone/no-9-nebraska-wastes-no-time-in-home-drubbing-over-penn-state/article_cd57dc63-135b-4559-b96d-47bd21587d44.html"
  },
  {
    "title": "Lake Stevens girls wrestling wins 4A State Championship",
    "description": "HeraldNet.comHeraldNet.com - Everett and Snohomish County news from The Daily Herald in Everett, WashingtonThe Vikings claim the program’s first-ever team title at Mat Classic XXXVII on Friday. Lake Stevens girls wrestling wins 4A State ChampionshipJoe Pohoryles",
    "source": "Heraldnet.com",
    "publishedAt": "2026-02-21 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.heraldnet.com/sports/lake-stevens-girls-wrestling-wins-4a-state-championship/"
  },
  {
    "title": "Why Designers Are Saying Goodbye To Kitchen Islands — And What's Replacing Them",
    "description": "Replacing kitchen islands, this trend offers an integrated design that's better suited to busy households in need of extra storage and countertop space.",
    "source": "Yahoo! News",
    "publishedAt": "2026-02-21 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://ca.style.yahoo.com/why-designers-saying-goodbye-kitchen-201000222.html"
  },
  {
    "title": "Victor Wembanyama Green Kaboom Sale Shows Market Strength for Inserts",
    "description": "There is only one Kaboom card more valuable than Victor Wembanyama's Kaboom.",
    "source": "Si",
    "publishedAt": "2026-02-21 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.si.com/collectibles/victor-wembanyama-green-kaboom-sale-shows-market-strength-for-inserts"
  },
  {
    "title": "This Dollar Tree Find Instantly Fixes An Annoying Kitchen Sink Problem (And It Costs Under $2)",
    "description": "For something as mundane as the kitchen sink, there are recurring problems that we as a society seem to ignore. The Dollar Tree, however, has the solution.",
    "source": "Yahoo! News",
    "publishedAt": "2026-02-21 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://shopping.yahoo.com/home-garden/kitchen/articles/dollar-tree-instantly-fixes-annoying-201000231.html"
  },
  {
    "title": "4 Years Later, The Expanse Season 7 Still Needs To Happen for These 5 Reasons",
    "description": "The Expanse TV show has a tumultuous past. After being cancelled by SYFY, the beloved sci-fi series was resurrected by Prime Video after major fan pushback, only to get pulled before its time once again. The sixth season of The Expanse ended in early 2022, though rather than a normal cancellation, it was pulled at [...]",
    "source": "Comic Book",
    "publishedAt": "2026-02-21 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://comicbook.com/tv-shows/list/4-years-later-the-expanse-season-7-still-needs-to-happen-for-these-5-reasons/"
  },
  {
    "title": "'College GameDay' heading to Arkansas basketball game at Florida",
    "description": "It will be the first time the Razorbacks have been in the \"GameDay\" featured contest since they hosted Kentucky on Jan. 27, 2024.",
    "source": "Nwaonline",
    "publishedAt": "2026-02-21 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.nwaonline.com/news/2026/feb/21/college-gameday-heading-to-arkansas-basketball-game-at-florida/"
  },
  {
    "title": "Long-term air pollution exposure raises Alzheimer’s risk, especially after stroke",
    "description": "A new study has found that long-term exposure to air pollution increases the risk of developing Alzheimer’s disease, particularly among older adults with a history of stroke. The research was published in PLOS Medicine.",
    "source": "The Daily Star",
    "publishedAt": "2026-02-21 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.thedailystar.net/health/healthcare/news/long-term-air-pollution-exposure-raises-alzheimers-risk-especially-after-stroke-4111676"
  },
  {
    "title": "Syria Asks Germany Not To Deport Its Citizens Back Home, Fearing It Would Make Country 'Unsafe'",
    "description": "Syria Asks Germany Not To Deport Its Citizens Back Home, Fearing It Would Make Country 'Unsafe' Authored by Thomas Brooke via Remix News,Syria has formally asked Germany for patience over the deportation of Syrian nationals, warning that the return of thousands could lead to insecurity in the country and worsen the country’s fragile humanitarian situation.As reported by Welt, Mohammed Yaqub al-Omar, director of the consular department at the Syrian Foreign Ministry, urged Germany “to understand the Syrian refugees and give us more time for reconstruction.” He warned that “the return of thousands of Syrians to Syria at this time could exacerbate the humanitarian crisis and mean that many people will have to live in refugee camps.”According to al-Omar, 1.5 million people are currently living in tent camps in northern Syria alone due to destroyed homes, schools, roads, and a lack of electricity. Large-scale deportations from Germany, he suggested, would place further strain on already overstretched infrastructure.Politicians from the Christian Democratic Union (CDU) and its Bavarian sister party, the Christian Social Union (CSU), argue that legal protection grounds no longer apply, but members of the co-governing left-wing Social Democrats (SPD) were more amenable to Damascus’ request.“Residence rights are not determined by the wishes of the countries of origin, but by whether a claim to protection exists. This claim, however, ceased to exist after the fall of the Assad regime,” Alexander Throm, domestic policy spokesman for the CDU/CSU parliamentary group, told Focus magazine. He added that returns to safe areas of Syria are possible, asking, “Who, if not Syrians, should rebuild the country after the civil war?”Marion Gentges, Justice and Migration Minister in Baden-Württemberg from the CDU, warned against delaying deportations because of the current debate. “We have an interest in ensuring that serious criminals and dangerous individuals leave our country. Therefore, such deportations, including those to Syria, must be carried out consistently,” she said.The topic of Syrian deportations could lead to friction within the federal coalition, however, with SPD lawmakers suggesting that Damascus’ request for more time was reasonable.“Syria still needs time to create structures that allow for returns,” said Serdar Yüksel, SPD chairman of the German-Turkish Parliamentary Group. In many areas, he reported, there are “no schools, no hospitals, no running water, no sewage system.”In some places, there is “virtually no reconstruction” taking place, he added, without responding to the suggestion that perhaps Syrians themselves should be leading the reconstruction.The issue is already partially addressed in the coalition agreement between the CDU/CSU and SPD, which provides for the resumption of deportations to Syria, beginning with criminals and individuals considered threats to public safety.However, a broader deportation policy back to the country has not been agreed upon.Syrien fordert von Deutschland, kriminelle Syrer nicht zurückzuschicken - und die Bundesregierung gehorcht. Mit der AfD in Regierungsverantwortung würde die Abschiebeoffensive sofort starten - und die Sicherheit der eigenen Bürger in den Vordergrund gerückt!...— Alice Weidel (@Alice_Weidel) February 20, 2026Alice Weidel, co-leader of the Alternative for Germany (AfD), slammed the request by the Syrian government, and suggested that a remigration policy for Syrians would already be in full force were her party in office.She wrote on X, “Syria is demanding that Germany not send back criminal Syrians – and the German government is complying. With the AfD in government, the deportation offensive would begin immediately – and the safety of its own citizens would be prioritized!”Her party added in a separate post, “Syria refuses to take back Syrians – so the country doesn’t become ‘unsafe.’ Criminal Syrians are supposed to stay in Germany – and the German government is complying. Instead: launch a deportation offensive, send Syrians back to Syria!”Voluntary deportation programs were launched in some German states last year, but resulted in extremely poor conversion rates. Despite financial incentives being offered at German taxpayers’ expense, just a fraction of those offered assistance to return home took up the offer.Read more here... Tyler DurdenSat, 02/21/2026 - 15:10",
    "source": "Zerohedge",
    "publishedAt": "2026-02-21 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.zerohedge.com/geopolitical/syria-asks-germany-not-deport-its-citizens-back-home-fearing-it-would-make-country"
  }
]