[
  {
    "title": "Australia look to ward off injury concerns for strong T20 WC show",
    "description": "Matt Renshaw has found a place in the first 15 ahead of Smith.",
    "source": "Dt Next",
    "publishedAt": "2026-02-04 08:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.dtnext.in/news/sports/australia-look-to-ward-off-injury-concerns-for-strong-t20-wc-show"
  },
  {
    "title": "FX risk manager Bound lands $25m funding boost",
    "description": "An automated foreign exchange risk management platform which protects clients against volatile currency markets will this week announce a funding injection of almost $25m.",
    "source": "Skynew",
    "publishedAt": "2026-02-04 08:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://news.sky.com/story/fx-risk-manager-bound-lands-25m-funding-boost-13503067"
  },
  {
    "title": "Severfield Sets Stage for Strategy Reset as Core Order Book Accelerates",
    "description": "Market Analysis by covering: Severfield PLC. Read 's Market Analysis on Investing.com UK.",
    "source": "Investing Uk",
    "publishedAt": "2026-02-04 08:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://uk.investing.com/analysis/severfield-sets-stage-for-strategy-reset-as-core-order-book-accelerates-200622051"
  },
  {
    "title": "When big story hits home, community news team responds",
    "description": "Reporter Michael Lagerquist recounted hearing that federal agents had surrounded a house, then realizing it was right down the street from where he lives.",
    "source": "Daily Item",
    "publishedAt": "2026-02-04 08:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.dailyitem.com/opinion/when-big-story-hits-home-community-news-team-responds/article_5c594f81-2da2-575d-80e5-2d3bb6fcecf9.html"
  },
  {
    "title": "Char Adams Brings Hidden History Of Black-Owned Bookstores To Light",
    "description": "Char Adams' book \"Black-Owned: The Revolutionary Life of the Black Bookstore\" chronicles the history of Black bookstores and their role in political movements throughout U.S. history, and highlights the importance of these stores as centers of community, resistance, and collaboration.The post Char Adams Brings Hidden History Of Black-Owned Bookstores To Light appeared first on The Sacramento Observer.",
    "source": "The Sacramento Observer",
    "publishedAt": "2026-02-04 08:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://sacobserver.com/2026/02/char-adams-brings-hidden-history-of-black-owned-bookstores-to-light/"
  },
  {
    "title": "PNP mobilizes probe team vs people behind fake PBBM medical bulletin",
    "description": "The Anti-Cybercrime Group of the Philippine National Police (PNP-ACG) has created an investigating team that will help in running after those who created and shared the fake medical bulletin of President MarcosPNP-ACG director Brig. Gen. Wilson Asueta said the investigating team is now coordinating with other government agencies to identify all those responsible for the bogus document.“We created a team and I already assigned them to collaborate and cooperate with other agencies responsible for this investigation,” said Asueta. He said part of the probe is the continuous cyber-patrolling to establish the online accountability aspect of the incident.But Asueta would not disclose if they have already identified the source and those who shared the fake document supposedly from St. Luke’s Hospital.Marcos was earlier confirmed to have been diagnosed with diverticulitis, a common intestinal condition. Later, the Presidential Communications Office (PCO) condemned the circulation of fabricated medical documents and warned the public about its real intent.The hospital stated in the fake medical bulletin also released a statement denying the authenticity of the document.Once the coordination and investigation are done, he said one of the possible cases that could be filed is violation of the Revised Penal Code on the aspect of unlawful publications and falsification of documents. He said the offense is serious since the document appeared to be intended to create chaos or harm the peace and order.Asueta then urged the netizens to be careful in dealing with information shared online, “We should not post or share information that is not sure. It will just create confusion and disorder in the community,” said Asueta.“So let us all be responsible to have a truthful information that we posted and publish,” he added.",
    "source": "Manila Bulletin",
    "publishedAt": "2026-02-04 08:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://mb.com.ph/article/10904317/philippines/national/pnp-mobilizes-probe-team-vs-people-behind-fake-pbbm-medical-bulletin"
  },
  {
    "title": "D55: Dhanush And Mammootty To Star In Rajkumar Periasamy’s Next, Makers Share Photos",
    "description": "Earlier, makers announced Sai Pallavi will be playing lead actress role in the film.",
    "source": "News 18",
    "publishedAt": "2026-02-04 08:09:59",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.news18.com/movies/tamil-cinema/d55-dhanush-and-mammootty-to-star-in-rajkumar-periasamys-next-makers-share-photos-ws-l-9878623.html"
  },
  {
    "title": "Mumbai Road Accident: 31-Year-Old NSG Commando Seriously Injured In High-Speed Collision On Jogeshwari–Vikhroli Link Road",
    "description": "An NSG commando, Vishal Shivthare, 31, was seriously injured when a speeding Swift Dzire rammed into his motorcycle on the Jogeshwari–Vikhroli Link Road early Sunday. Returning from a confidential mission, he was hit while signaling a turn near his camp in Andheri. He sustained fractures and was hospitalized. The driver, Mohammad Bilal, has been detained.",
    "source": "The Free Press Journal",
    "publishedAt": "2026-02-04 08:09:55",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.freepressjournal.in/mumbai/mumbai-road-accident-31-year-old-nsg-commando-seriously-injured-in-high-speed-collision-on-jogeshwarivikhroli-link-road"
  },
  {
    "title": "Gazette issued on competitive exam for recruitment of graduates to Teacher Service",
    "description": "Applications are invited for the recruitment of graduates, both those currently employed in the public service and those who are not, to the Sri Lanka Teachers Service, to fill existing vacancies in Sinhala, Tamil, and English mediums at National and Provincial schools across the island. MORE..",
    "source": "Adaderana News",
    "publishedAt": "2026-02-04 08:09:55",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "http://www.adaderana.lk/news.php?nid=118018"
  },
  {
    "title": "Two terrorists killed in Basantgarh area of J-K’s Udhampur: Army",
    "description": "The officials said, \"the operation concluded successfully however, the area remains under surveillance.\"The post Two terrorists killed in Basantgarh area of J-K’s Udhampur: Army appeared first on Greater Kashmir.",
    "source": "Greater Kashmir",
    "publishedAt": "2026-02-04 08:09:53",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.greaterkashmir.com/latest-news/two-terrorists-killed-in-basantgarh-area-of-j-ks-udhampur-army/"
  }
]