[
  {
    "title": "Faker's T1 win third back-to-back League Of Legends world crown",
    "description": "South Korean giants T1, headlined by star player Faker, made history on Nov 9 winning their third consecutive League of Legends World Championship crown in Chengdu, beating KT Rolsters in a nail-biting final. Read full story",
    "source": "The Star",
    "publishedAt": "2025-11-10 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.thestar.com.my/tech/tech-news/2025/11/10/faker039s-t1-win-third-back-to-back-league-of-legends-world-crown"
  },
  {
    "title": "Texas returns to top 10 of AP college football poll; 5 ACC teams ranked",
    "description": "Texas returned to the top 10 of the Associated Press college football poll on Sunday, the ACC has five teams ranked for the first time this season and two Group of Five conferences are now represented in the top 25 a month before the playoff bracket is set. The top five was unchanged.",
    "source": "Nwaonline",
    "publishedAt": "2025-11-10 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.nwaonline.com/news/2025/nov/10/texas-returns-to-top-10-of-ap-college-football/"
  },
  {
    "title": "Education crisis persists because FG neglects sector — ASUU",
    "description": "The President of the Academic Staff Union of Universities, Prof. Chris Piwuna, has said the Federal Government does not prioritise education because its officials do not consider the sector’s problems as national concerns requiring collective responsibility.Piwuna, who spoke during The Toyin Falola Interviews on Sunday, in a virtual conversation titled “A Conversation with the ASUU President,” said the indifference of key government officials towards the education sector has made it difficult to achieve sustainable reforms.According to him, members of the Federal Executive Council often view education challenges as the sole responsibility of the Minister of Education.ASUU has long relied on strikes to press for its demands.In recent years, the union has often justified industrial action as prompted by government proposals that it views as a “total departure” from the agreed terms of the 2009 FGN–ASUU Agreement, as well as unresolved issues such as outstanding promotion arrears, withheld deductions, and inadequate funding and renovation of public universities.“Members of the government, the ministers, and chief executives do not see the problem of education as a problem that affects them.“When ASUU declares a strike, the Minister of Finance sees it as the Minister of Education’s problem; the Minister of Science and Technology sees it the same way.“But if the Minister of Finance understood that the country’s economic growth depends on a knowledgeable workforce, he would take the Minister of Education’s problem as his own. The same applies to other ministries,” Piwuna said.He added that the Federal Government’s response to education issues was further hindered by ideological differences and corruption.“We in ASUU see education as a public good, but those in government treat it as a capitalist venture, something only important if it generates profit.“Many of them now suggest that TETFund should begin funding private universities. Even the last Chief of Staff to the President, who never did that while in government, is now a Pro-Chancellor advocating it. Self-interest and contract inflation have replaced public service. That is why TETFund has become a marketplace,” he said.The host, a historian and scholar, Prof. Toyin Falola, gave an overview of ASUU’s historical struggles with the Federal Government and the recurring industrial actions that have crippled academic calendars for decades.Speaking on the ongoing ASUU National Executive Council meeting in Taraba State, Piwuna said discussions on the union’s negotiations with the Federal Government were nearing conclusion.“The terms of the agreement are shaping up, and in the next week or two, we’ll make a definite statement.“But what the government is offering us as salaries is unacceptable, and we are ready to go to any length to fight it. Our salaries are nothing to write home about.“All the billionaires have private universities; none of them support public universities. We have reached out to them — even under the last administration — but nothing came of it,” he said.Piwuna added that Nigeria’s current academic conditions are pushing lecturers to survival mode, leaving little room for innovation or endowments.“Some of our colleagues sleep in their offices with their families because of poor living conditions.“How can such people be expected to source endowments or drive world-class research? We are still struggling to move out of the 17th century, not the 18th,” he said.",
    "source": "Nigeria News",
    "publishedAt": "2025-11-10 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.nigerianeye.com/2025/11/education-crisis-persists-because-fg.html"
  },
  {
    "title": "Knight Foundation, USC Marshall commit $4 million to advance purpose-driven AI research",
    "description": "The research initiative aims to create ethical, human-forward outcomes for cutting edge technology like AI.",
    "source": "University Of Southern California",
    "publishedAt": "2025-11-10 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://today.usc.edu/knight-foundation-usc-marshall-commit-4-million-to-advance-purpose-driven-ai-research/"
  },
  {
    "title": "\"Zero generation\": the aftermath of Russia's record ballistic missile strike on Ukraine's energy sector",
    "description": "Russia recently launched one of its largest attacks on Ukraine’s energy infrastructure, with Centrenergo the hardest hit. What damage did the latest strike cause, and how will this affect Ukraine’s ability to get through the winter?",
    "source": "Українська Правда",
    "publishedAt": "2025-11-10 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.pravda.com.ua/eng/articles/2025/11/10/8006616/"
  },
  {
    "title": "UK households with washing machine in kitchen risk £59 charge",
    "description": "In The Wash looked at 20 of the most popular washing machines in the UK to calculate the average amount of electricity and water used per cycle.",
    "source": "Birmingham Live",
    "publishedAt": "2025-11-10 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.birminghammail.co.uk/news/cost-of-living/uk-households-washing-machine-kitchen-32716269"
  },
  {
    "title": "‘Dead Man’s Wire,’ ‘Frankenstein,’ ‘Hamnet,’ ‘A Private Life’ to Play at Marrakech Film Festival",
    "description": "The Marrakech Intl. Film Festival has revealed the lineup for its 22nd edition, which runs Nov. 28 to Dec. 6. A total of 82 films from 31 countries have been selected for the festival. Nine of these films unspool as world or international premieres, nine have received the support of the Atlas Workshops, the festival’s [...]",
    "source": "Variety",
    "publishedAt": "2025-11-10 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://variety.com/2025/film/news/dead-mans-wire-frankenstein-hamnet-a-private-life-marrakech-1236573592/"
  },
  {
    "title": "Photos: Kylie Jenner’s Cutout Dress Is Bold Done Best",
    "description": "Kylie Jenner‘s recent outfit had impressed many. The business mogul was all dolled up while attending her mother, Kris Jenner’s, 70th birthday celebration this weekend. The reality TV star won many hearts with her cutout dress, which stood out in the crowd. Kylie Jenner wows in white cutout dress for Kris Jenner’s birthday While many [...]The post Photos: Kylie Jenner’s Cutout Dress Is Bold Done Best appeared first on Mandatory.",
    "source": "Mandatory",
    "publishedAt": "2025-11-10 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.mandatory.com/news/1684401-photos-kylie-jenners-cutout-dress-needs-a-double-take"
  },
  {
    "title": "No maybe, just 'hi baby.' Carly Rae Jepsen announces she is pregnant with first child",
    "description": "She is known for her earworm 2012 hit 'Call Me Maybe'. Read full story",
    "source": "The Star",
    "publishedAt": "2025-11-10 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.thestar.com.my/lifestyle/entertainment/2025/11/10/no-maybe-just-039hi-baby039-carly-rae-jepsen-announces-she-is-pregnant-with-first-child"
  },
  {
    "title": "Lorraine McBrearty",
    "description": "Lorraine died while on hospice care in AZ. Graduate of Santa Ana HS and Santa Ana College. Survived by sister Kathleen (aka Reenie) McCall and family.",
    "source": "Ocregister",
    "publishedAt": "2025-11-10 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.ocregister.com/obituaries/lorraine-mcbrearty-maricopa-az/"
  }
]