[
  {
    "title": "Asking Eric: I want to visit my parents, but not if they insist on including my estranged brother",
    "description": "They've got good reason for not wanting to be around this brother. Will their parents accept this condition?",
    "source": "Oregon Local News",
    "publishedAt": "2025-11-14 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.oregonlive.com/advice/2025/11/asking-eric-i-want-to-visit-my-parents-but-not-if-they-insist-on-including-my-estranged-brother.html"
  },
  {
    "title": "Vernon Nathe",
    "description": "It is with deep regret we announce the passing of Vernon A. Nathe. Vern died peacefully surrounded by family on Nov 1st 2025. Born in Clarkston Washington in 1937 as the youngest of five siblings to Elizabeth and Peter Nathe. Vern graduated from Washington State University and then joined the army and served two years [...]",
    "source": "Marin Independent Journal",
    "publishedAt": "2025-11-14 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.marinij.com/obituaries/vernon-nathe-novato-ca/"
  },
  {
    "title": "Gino Porzio",
    "description": "Gino Porzio On Saturday, November 8, 2025, Gino Porzio passed peacefully into the next life at 82 years. Gino was born on October 14, 1943, in Ukiah, California. He was raised by his loving father Luigi (1891-1956) and mother, Gina (1899-1987), alongside his sister Rosalie Montgomery (1921-1997), Luisa (1923-1926), and brother Frank Porzio on Porzio [...]",
    "source": "Ukiah Daily Journal",
    "publishedAt": "2025-11-14 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.ukiahdailyjournal.com/obituaries/gino-porzio-ukiah-ca/"
  },
  {
    "title": "Mel DeWeerd",
    "description": "November 11, 1934 – October 31, 2025 Mel DeWeerd passed away peacefully with his wife Pam by his side on October 31, 2025, just shy of 91 years old. Born on Veterans Day in Hudsonville, Michigan, Mel liked to say that when he was a boy, he thought the national holiday was for his birthday [...]",
    "source": "Marin Independent Journal",
    "publishedAt": "2025-11-14 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.marinij.com/obituaries/mel-deweerd-stinson-beach-ca/"
  },
  {
    "title": "Three Nigerians arrested for fraud in Kenya",
    "description": "At least three Nigerians have been arrested in the Mwaliko Estate, Mwea Town, Kenya, on allegations of cyber fraud.A report by Tuko News, a Kenyan digital news platform, revealed that the suspects were apprehended by the Directorate of Criminal Investigations on Wednesday.The arrested individuals have been identified as Peter Chukwujekwu, Alazor Chukulute Sunday, and Nnalue Chiagozie Samwe.According to the report on Thursday, the trio were flushed out of their apartment after members of the public raised concerns about suspicious late-night activities in the building.The DCI confirmed the arrests, stating that they occurred during “a multi-agency raid targeting a cyber fraud ring” in the area.The report quoted the DCI as saying: “Three Nigerian nationals nabbed in Kirinyaga multi-agency raid. A well-coordinated multi-agency raid in Mwaliko Estate within Mwea town has blown the lid off a suspected cyber fraud ring operated by three Nigerian nationals.”The suspects, who claimed to be running an online business, were said to be living in Kenya illegally and lacked valid work permits.This arrest is part of a broader trend of Nigerians being apprehended abroad for various criminal activities, including cyber fraud, drug trafficking, and human trafficking.In June 2023, Kenyan police arrested 19 Nigerians in Nairobi for engaging in electronic fraud targeting Kenyans.According to the DCI, the men, aged between 19 and 33, used social media to initiate their scam, swindling unsuspecting Kenyans under the guise of offering goods deliveries from abroad.“The fraudsters start by befriending you on social media (Facebook), and once you accept the friend request, they initiate a friendly chat that promises the victim goodies to be sent through DHL at the airport,” the DCI explained.",
    "source": "Nigeria News",
    "publishedAt": "2025-11-14 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.nigerianeye.com/2025/11/three-nigerians-arrested-for-fraud-in.html"
  },
  {
    "title": "Hidden gem of an action film with MCU star is on Film 4 tonight",
    "description": "Movie follows the story of a former special forces soldier who finds himself reliving the day of his death over and over again",
    "source": "Express",
    "publishedAt": "2025-11-14 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.express.co.uk/showbiz/tv-radio/2133719/uk-viewers-so-hooked-hidden-gem-action-film-british-peaky-blinders-star"
  },
  {
    "title": "With early tests now passed, Ireland go in search of World Cup progression",
    "description": "So what will the knockout phase bring that the group stage didn't? O'Brien spoke post-Paraguay of how \"cup football\" awaits following their successful navigation of the group stage. That win-or-go-home pressure also awaits.",
    "source": "Irish Examiner",
    "publishedAt": "2025-11-14 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.irishexaminer.com/sport/soccer/arid-41742159.html"
  },
  {
    "title": "Elizabeth (Beth) Schwebel",
    "description": "Betsy Anne Ironside was born on the Fourth of July in Minneapolis, Minnesota, to Elsworth and Marie Ironside. Independent from the start, she believed in listening to her heart and following where it led. As a young woman, she adventurously explored Europe with friends before moving to Los Angeles to experience life in a bigger [...]",
    "source": "Marin Independent Journal",
    "publishedAt": "2025-11-14 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.marinij.com/obituaries/elizabeth-beth-schwebel-corte-madera-ca/"
  },
  {
    "title": "COUGAR NOTES: WSU searches for an AD as Pac-12 finds third media rights partner",
    "description": "Also, WSU football and basketball add new recruits",
    "source": "Dnews",
    "publishedAt": "2025-11-14 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.dnews.com/sports/wsu-searches-for-an-ad-as-pac-12-finds-third-media-rights-partner-694d38dd"
  },
  {
    "title": "Patsy Owens",
    "description": "Patsy Owens On Monday, November 3rd, Patsy Owens of Red Bluff, born October 5th, 1935, passed away at the age of 90. Preceding Patsy were her beloved parents, Earl and Audrey Knight of Red Bluff. She is survived by her daughter, Dawn (Gary) Burr of Shingletown, son, Allen (DaLene) Bloxham of Corning, Robin Gonczeruk of [...]",
    "source": "Red Bluff Daily News",
    "publishedAt": "2025-11-14 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.redbluffdailynews.com/obituaries/patsy-owens-red-bluff-ca-2/"
  }
]