[
  {
    "title": "Dentsu Announces New Global Management Structure",
    "description": "Dentsu Announces New Global Management Structure including the appointment of Takeshi Sano as President and Global CEO, dentsu",
    "source": "Globe Newswire",
    "publishedAt": "2026-02-13 08:11:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.globenewswire.com/news-release/2026/02/13/3237863/0/en/Dentsu-Announces-New-Global-Management-Structure.html"
  },
  {
    "title": "Dentsu Announces New Global Management Structure",
    "description": "Dentsu Announces New Global Management Structure including the appointment of Takeshi Sano as President and Global CEO, dentsu",
    "source": "Globenewswire_fr",
    "publishedAt": "2026-02-13 08:11:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.globenewswire.com/fr/news-release/2026/02/13/3237863/0/en/Dentsu-Announces-New-Global-Management-Structure.html"
  },
  {
    "title": "Orlando Pirates and adidas renew longstanding partnership",
    "description": "\"Our relationship with adidas transcends that of a traditional sponsor,\" said Pirates chairman Dr Irvin Khoza.",
    "source": "The Citizen",
    "publishedAt": "2026-02-13 08:11:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.citizen.co.za/sport/soccer/local-soccer/orlando-pirates-and-adidas-renew-longstanding-partnership/"
  },
  {
    "title": "41 and thriving! | LeBron becomes oldest NBA player to record triple-double!",
    "description": "Los Angeles Lakers star LeBron James recorded 28 points, 12 assists, and 10 rebounds in his team's win over the Dallas Mavericks, becoming the oldest NBA player to score a triple-double.",
    "source": "Sky Sports",
    "publishedAt": "2026-02-13 08:11:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.skysports.com/watch/video/13506981/nba-lebron-james-becomes-oldest-nba-player-to-record-triple-double"
  },
  {
    "title": "Dentsu Announces New Global Management Structure",
    "description": "– Further Contributing to Client Growth by Strengthening Execution Capabilities –TOKYO, Feb. 13, 2026 (GLOBE NEWSWIRE) -- Dentsu Group Inc. (TYO:4324, OTC:DNTUF, Head Office: Minato-ku, Tokyo, President &, Global CEO: Hiroshi Igarashi, the Company and its Group companies are hereinafter collectively referred to as \"dentsu\")) today announced a new global management structure — including the appointment of a new President & Global CEO — with the objective of enhancing execution excellence and driving stronger growth outcomes for our clients. The new structure will go into effect on March 27, 2026.In FY2025, despite the continued challenges in the overseas business amid a rapidly changing business environment, dentsu's ongoing transformation is already establishing a solid foundation for its next phase of growth. Under the new management structure, dentsu will further strengthen execution by building on its solid business foundation, the culture it has cultivated as a global organization, and the heightened integrity and governance awareness now embedded across the group. These efforts will accelerate transformation and drive greater client growth, while deepening trust with key stakeholders—including clients, investors, and shareholders—and ensuring the sustainable enhancement of corporate value.A significant change within the Global Management Team responsible for global management is Takeshi Sano's appointment to President & Global CEO. Sano currently serves as CEO, dentsu Japan & Deputy Global Chief Operating Officer, dentsu.Sano, who also serves as President & CEO of Dentsu Inc., the core operating company that generates approximately 40% of the Group's net revenue and more than half of its underlying operating profit, has evolved Dentsu Inc. into a true Integrated Growth Partner, achieving 11 consecutive quarters of revenue growth and recording high profits for two consecutive years. In addition, since 2023, he has led the growth and global expansion of dentsu's Business Transformation (BX) as BX CEO, dentsu.Furthermore, from 2025, while serving as Deputy Global COO of dentsu and CEO of dentsu Japan, he has achieved significant results in global management based on the strong client trust built in the Japanese market, including strengthening the integration of the domestic and international operations, supporting Japanese clients in expanding their businesses overseas, and extending dentsu Japan's capabilities into global markets. By continuing to serve as CEO of dentsu Japan in 2026, he will maintain the growth momentum of the Japan business, which underpins the Group's consolidated performance, while creating further synergies between Japan and the overseas business. This will accelerate the execution of the midterm management plan and drive the recovery and growth of the overseas business.In addition, as Dentsu Inc. aims to achieve further growth by maintaining and strengthening its speed of decision-making and execution as an operating company, Sano will step down from the position of Representative Director, President & CEO of Dentsu Inc. Chisato Matsumoto, who is serving as Director of Dentsu Inc., will assume Sano's current role.Comment from Takeshi Sano, Director, Representative Executive Officer, President & Global CEO, dentsu (Effective from March 27, 2026):\"Amid rapid shifts in our business and competitive environment, we continue to thoughtfully evolve our leadership approach and management practices to support the pace of our transformation and strengthen execution, all while maximizing our contribution to client growth. Dentsu will continue to sharpen the distinctive value that sets us apart and position ourselves as a true growth partner, supporting clients consistently from strategy through to execution. By creating momentum for our clients, partners, people, and society, we will reinforce trust with stakeholders and steadily advance the sustainable enhancement of our corporate value.\"We have formed a new Global Management Team which prioritizes strengthening execution capabilities and accelerating the pace of transformation. Specifically, eliminating the Global COO role overseeing all regions and the Global President role overseeing all practices will allow the CEOs of each region and the Presidents of each practice—who build direct relationships with clients—to report directly to the Global CEO, enabling the management team to operate with greater unity and make swift decisions that prioritize client needs. Additionally, to accelerate global transformation, we have newly appointed a Global Chief Transformation Officer. Concurrently, to strengthen the governance foundation underpinning our global operations, we have also newly appointed a Global Chief Corporate Affairs Officer.Yoshimasa Watahiki, COO, dentsu Japan, will assume the position of Director, Representative Executive Officer, Vice President and Global Chief Corporate Affairs Officer. After joining Dentsu Inc., Watahiki worked in the media division before serving in several leadership roles within the business management division, where he led the development and execution of business strategies. Since 2020, he has been involved in managing the Dentsu Japan Network (now known as dentsu Japan) as an Executive Officer. In 2023, he was appointed COO, dentsu Japan, driving reforms across both business and management structures while also serving as a board member for numerous group companies and overseeing their governance and management. Going forward, Watahiki will continue in his role as COO, dentsu Japan, while expanding his executive capabilities to the global level, working alongside the Global Management Team headed by Sano. In his new role as Vice President and Global Chief Corporate Affairs Officer, he will primarily be responsible for overseeing governance. In addition, he is scheduled to assume the position of Director and Representative Executive Officer of dentsu, subject to the necessary approvals.Shigeki Endo will maintain his role as Global CFO. Endo has a track record spanning over 30 years of proven leadership experience in global finance. Starting his career at a Japanese trading company, he held positions in internal audit and CFO roles both within Japan and internationally at the US-based General Electric (GE) and British American Tobacco, accumulating extensive experience in global business operations. He subsequently served as Executive Officer and Japan CFO at Accenture Japan before joining dentsu in July 2024. Since February 2025, has accelerated business and management transformation from a finance perspective as Global CFO, dentsu. He has demonstrated exceptional execution capabilities, particularly in reviewing underperforming overseas businesses and rebuilding the management foundation, where he has delivered steady results. Moving forward, he will strive to enhance corporate value by strengthening the group's financial foundation and achieving sustainable cash generation, thereby earning the trust of various stakeholders. Subject to the necessary approvals, he is also scheduled to assume the position of Director and Executive Officer at dentsu.* Takeshi Sano, Yoshimasa Watahiki and Shigeki Endo have been nominated as candidates for Director to be proposed at the 177th Ordinary General Meeting of Shareholders scheduled for March 27, 2026. In addition, following the conclusion of the same Ordinary General Meeting of Shareholders, they will be appointed to Executive Officers at the Board of Directors meeting. Takeshi Sano and Yoshimasa Watahiki are expected to be appointed Representative Executive Officers.Global Management TeamThe Global Management Team, consisting of the following 23 members, is responsible for managing the entire Group in approx. 120 countries, including the global headquarters, Dentsu Group Inc. Within this team, the members handling executive duties are referred to as \"Global Executive Management.\"Global Executive Management appointments (13 leaders) (Effective from March 27, 2026)Change in titlePosition as of March 27, 2026Full story available on Benzinga.com",
    "source": "Benzinga",
    "publishedAt": "2026-02-13 08:11:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.benzinga.com/pressreleases/26/02/g50602948/dentsu-announces-new-global-management-structure"
  },
  {
    "title": "253654 NYKHEL DAWKINS",
    "description": "DAWKINS, NYKHEL ZAIQUAN 02/08/2026",
    "source": "Reflector",
    "publishedAt": "2026-02-13 08:10:58",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.reflector.com/jail_bookings/253654-nykhel-dawkins/article_f8751183-cfef-53fb-8bb7-9301867260ec.html"
  },
  {
    "title": "Vocational education key to unlocking Nigeria’s demographic dividends",
    "description": "Nigeria is one of the youngest countries in the world, with over 70 percent of its population under the ageread more Vocational education key to unlocking Nigeria’s demographic dividends",
    "source": "Business News Nigeria",
    "publishedAt": "2026-02-13 08:10:57",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://businessday.ng/news/article/vocational-education-key-to-unlocking-nigerias-demographic-dividends/"
  },
  {
    "title": "253653 JAQUAN TAYLOR",
    "description": "TAYLOR, JAQUAN MALAKA 02/08/2026",
    "source": "Reflector",
    "publishedAt": "2026-02-13 08:10:57",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.reflector.com/jail_bookings/253653-jaquan-taylor/article_d393b219-449a-5f41-ae91-9d1425bbaeed.html"
  },
  {
    "title": "Pune: Hurry Up! Last Two Days To Benefit From 75% Interest Rebate Under PMC Abhay Yojana",
    "description": "The scheme, introduced to encourage voluntary payment of pending taxes, was first implemented from November 15, 2025, to January 15, 2026, and later extended from January 16, 2026, to February 15, 2026",
    "source": "The Free Press Journal",
    "publishedAt": "2026-02-13 08:10:54",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.freepressjournal.in/pune/pune-hurry-up-last-two-days-to-benefit-from-75-interest-rebate-under-pmc-abhay-yojana"
  },
  {
    "title": "[SMM Stainless Steel Daily Review] SS Futures Weakened on the Last Trading Day Before the Holiday, Stainless Steel Spot Cargo Remained Stable Awaiting Post-Holiday Resumption",
    "description": "[SMM Stainless Steel Daily Review] SS Futures Weakened on Last Trading Day Before Holiday, Stainless Steel Spot Prices Remain Stable Awaiting Post-Holiday Resumption SMM, February 13: SS futures continued to decline and probe lower. On the last trading day before the Chinese New Year holiday, nonferrous metals futures collectively came under pressure and fell, with SS futures also weakening in sync, ultimately closing at 13,860 yuan/mt. In the spot market, despite the volatility in SS futures and rising high-grade NPI prices ahead of the holiday, most spot traders had already entered the holiday period, logistics and transportation were suspended, transactions were sparse, and prices maintained a stable trend, with the market quietly awaiting the post-holiday resumption. The most-traded SS futures contract pulled back. At 10:30 a.m., the SS2604 contract was quoted at 13,765 yuan/mt, down 315 yuan/mt from the previous trading day. In Wuxi, the spot premiums/discounts for 304/2B were in the range of 405-605 yuan/mt. In the spot market, the average price for cold-rolled 201/2B coil in Wuxi was reported at 8,500 yuan/mt; for cold-rolled mill-edge 304/2B coil, the average price in Wuxi was 14,100 yuan/mt, while in Foshan it was 14,050 yuan/mt; in Wuxi, the price for cold-rolled 316L/2B coil was 26,600 yuan/mt, and in Foshan it was also 26,600 yuan/mt; for hot-rolled 316L/NO.1 coil, the price in Wuxi was reported at 25,750 yuan/mt; in both Wuxi and Foshan, the price for cold-rolled 430/2B coil was 7,800 yuan/mt. On the futures side, driven by weakening macro influences and narrowing fluctuations in nonferrous metals futures, the market showed a relatively stable and fluctuating trend at the beginning of the week, with trading activity experiencing a pullback. As the Chinese New Year holiday approached, market participants considered avoiding holiday risks, coupled with earlier...",
    "source": "Shanghai Metals Market",
    "publishedAt": "2026-02-13 08:10:52",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://news.metal.com/newscontent/103771398/smm-stainless-steel-daily-review-ss-futures-weakened-on-the-last-trading-day-before-the-holiday-stainless-steel-spot-cargo-remained-stable-awaiting-post-holiday-resumption/"
  }
]