[
  {
    "title": "Tri-state under extreme cold warning this weekend, with wind chills as low as -30",
    "description": "The National Weather Service has issued an extreme cold warning for wind chill temperatures this weekend that will plummet to as low as -15 to -30 degrees Fahrenheit.The most biting arctic air so far this winter season descends on the Northeast early Saturday morning. A cold front marking the leading edge of the arctic air generated light snow starting Friday night. It will continue off-and-on into early Saturday.There’s a chance for an inch or so of fresh snow Saturday morning in Suffolk County on Long Island or in the northern Hudson Valley, but it won’t be any more than a dusting for most, including New York City and New Jersey.But the snow will play second fiddle to the extremely dangerous wind chills this weekend. The extreme cold warning will likely take effect by 10 a.m. Saturday.Expect temperatures to plummet throughout the day and the wind pick up – whipping 40-60 mph at times. That has lead to a wind advisory being issued as well.Wind chills start cold and then get worse. They will be below 0 by the end of the day Saturday. You’ll need to cover as much exposed skin as possible to avoid frost bite, which can set in on bare skin after just 30 minutes.The absolute worst part of the weekend will be Sunday morning, when temperatures are in the single digits and wind chills are anywhere from -15 to -30 across the tri-state. Early in the morning the wind will still be gusty, but as the day progresses the wind will ease even though temperatures will stay bitterly cold. The net effect will be wind chills barely breaking zero by afternoon.The most optimistic news in our long-range forecast is that this weekend may be the last deep, deep freeze we feel for a while. Monday is still cold, but temperatures should rebound midweek and be close to average (aka above freezing) by next weekend. Hour-by-hour temperatures and what it will feel likeSaturday 8 a.m.Saturday 12 p.m.Saturday 4 p.m.Saturday 10 p.m.Sunday 8 a.m.Sunday 12 p.m.Sunday 3 p.m.",
    "source": "Nbc 4 New York",
    "publishedAt": "2026-02-06 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.nbcnewyork.com/weather/weather-stories/tri-state-extreme-cold-warning-weekend-wind-chills/6456690/"
  },
  {
    "title": "Turnout for one album release suggests more listening parties may be in store - WAMC",
    "description": "Turnout for one album release suggests more listening parties may be in store WAMCJoji’s hypnotic prelude to his new album New University50 Compelling Joji Lyrics to Use as Your Next Photo Caption Sweety HighJoji ‘LOVE YOU LESS’ KCRWLocal book and record store is selected to carry Joji’s new album MTSU Sidelines",
    "source": "Google News",
    "publishedAt": "2026-02-06 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPRkZVb0FfNTlSTjJMMERER0czQ1A3NHBaaU56TlhncTRMdHN0RFc4VldudHdPaW55R0VOUUx4azVpeWFOTWtkMDV2NHBUWTVkSHdfSS1nNXNGODV1LWVVclMzMUZ5ZFlocWVKUTM2M2pEeGw3OXVxcGVYMjRFbFh0NU9IZVk4M3pNTms3eWZRMUVlbGRCZmVXSkpUMzRjZExybGk5SEN6UGJZdw?oc=5"
  },
  {
    "title": "Lorraine Ali: Bad Bunny is American; Coldplay is not. The right is selectively freaking out over the Super Bowl",
    "description": "President Donald Trump told the New York Post that music artist Bad Bunny was a “terrible choice” to headline the 2026 Super Bowl halftime show and that the NFL’s selection of the Puerto Rican singer and rapper sows “hatred.” Department...",
    "source": "Recorderonline",
    "publishedAt": "2026-02-06 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.recorderonline.com/features/entertainment_news/lorraine-ali-bad-bunny-is-american-coldplay-is-not-the-right-is-selectively-freaking-out/article_d86d89f8-8e38-5a1b-a34e-404b5383c2d1.html"
  },
  {
    "title": "'Mr. Irrelevant' and former IU cornerback Kobee Minor makes his way to Super Bowl LX",
    "description": "SAN JOSE, Calif.—Most football fans know about the Heisman Trophy, but have you heard of the Lowsman Trophy?",
    "source": "Herald Bulletin",
    "publishedAt": "2026-02-06 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.heraldbulletin.com/sports/mr-irrelevant-and-former-iu-cornerback-kobee-minor-makes-his-way-to-super-bowl-lx/article_075a474f-fba0-4063-9f2b-f6d07af2320a.html"
  },
  {
    "title": "Biological male accused of DV against partner jailed in Bandyup Women’s Prison courtesy of gender transition",
    "description": "A biological male accused of domestic violence against a female partner was jailed in a women’s prison courtesy of a gender transition.",
    "source": "The West",
    "publishedAt": "2026-02-06 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://thewest.com.au/news/wa/biological-male-accused-of-dv-against-partner-jailed-in-bandyup-womens-prison-courtesy-of-gender-transition-c-21536775"
  },
  {
    "title": "Liverpool add FOUR new players to Premier League squad including special centre-back",
    "description": "Liverpool have added four new players to their Premier League squad as they look to finish the season on a high. It's not been the campaign many expected at Anfield. Perhaps behind closed doors it was...",
    "source": "Yahoo! News",
    "publishedAt": "2026-02-06 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://sports.yahoo.com/articles/liverpool-add-four-players-premier-201000815.html"
  },
  {
    "title": "Constableville news",
    "description": "I spoke to Beth Lamanna, data collector for the Highmarket Weather Station, and was told that, as of Jan. 29, Highmarket had received 183.3 inches of snow. The weather station only recorded two days in January 2026 that did not...",
    "source": "Romesentinel",
    "publishedAt": "2026-02-06 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.romesentinel.com/constableville-news/article_76908eca-962d-4cc8-bd7c-d8c5fb30229d.html"
  },
  {
    "title": "Fort Madison receives PIE award",
    "description": "Thursday afternoon, while some of Fort Madison’s leaders were at the state capitol for Southeast Iowa Days, State Auditor Rob Sand was in Fort Madison.",
    "source": "Mississippivalleypublishing",
    "publishedAt": "2026-02-06 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.mississippivalleypublishing.com/daily_democrat/fort-madison-receives-pie-award/article_89b24229-9841-46fd-b0a8-b28fbf05042a.html"
  },
  {
    "title": "USC women’s basketball has quietly won three games in a row",
    "description": "The Trojans have won three games in a row. Are they finally starting to turn things around?",
    "source": "Yahoo! News",
    "publishedAt": "2026-02-06 20:09:59",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://sports.yahoo.com/articles/usc-women-basketball-quietly-won-200959213.html"
  },
  {
    "title": "CFB analyst raves over Arthur Smith's Ohio State hiring for specific 'CEO' reason",
    "description": "New Ohio State offensive coordinator Arthur Smith is a perfect fit in Columbus. According to Fox Sports analyst Joel Klatt, it's going to work right away.",
    "source": "Yahoo! News",
    "publishedAt": "2026-02-06 20:09:57",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://sports.yahoo.com/articles/cfb-analyst-raves-over-arthur-200957926.html"
  }
]