[
  {
    "title": "Leviste apologizes to fellow congressmen, says he hasn't accused anyone of corruption",
    "description": "Batangas 1st district Rep. Leandro Legarda Leviste has apologized to his House of Representatives colleagues who may have been affected by his crusade to expose infrastructure corruption in government.At the same time, Leviste clarified that he wasn\\'t accusing any congressman of corruption.\"Ako po ay humihingi din ng paumanhin ng ating mga kasamahan dito sa Kongreso na naaapektuhan sa aking mga sinasabi. Hindi ko naman inaakusahan sinuman ng korapsyon. Ako po ay nagsisiwalat lamang ng impormasyon na nakalap ko,\" he said in a press conference Wednesday, Jan. 21.(I also wish to apologize to our colleagues here in Congress who may be affected by what I say. I am not accusing anyone of corruption. I am merely disclosing information that I have gathered.)Since Dec. 24, 2025, Leviste has dumped on his Facebook hundreds of budget documents from the Department of Public Works and Highways (DPWH). These have included details on so-called \"allocables\", or the millions in annual earmarked amounts that a district congressman may allocate.Leviste has also called out his much more experienced and older colleagues in the chamber for allegedly making \"insertions\" in the national budget. Whether fair or not, budget insertions fron solons have been demonized and equated to anomalous infrastructure projects, especially those on flood control.Mom Loren\\'s adviceIn the same presser, the Batangueño candidly shared the advice that her mother, Senator Loren Legarda, imparted to him recently.\"Sinabihan din po ako ng aking ina na huwag nang makipag-away pero nais ko lang pong linawin na hindi po ako kaaway ng administrasyon at sumasagot lang din po ako kapag binabanggit po ang pangalan ko,\" he said.(My mother also told me not to get into fights, but I only want to clarify that I\\'m not an enemy of the administration, and I simply respond whenever my name is mentioned.)\"Alam po ng media na ang aking ina ay in fact, kasama ni PBBM (President Bongbong Marcos) nung siya po ay nag-inaugurate ng Antique airport nitong Lunes kaya inulit-ulit po ng aking ina sa akin na huwag pong makipag-away,\" noted Leviste.(The media knows that my mother was, in fact, with President Bongbong Marcos when he inaugurated the Antique airport last Monday, which is why she kept reminding me not to get into fights.)\"At ang sagot ko po sa aking ina, dine-depensahan ko na lang po ang sarili ko kapag binabanggit ang pangalan ko (And my answer to my mother is that I only defend myself whenever my name is mentioned),\" he added.",
    "source": "Manila Bulletin",
    "publishedAt": "2026-01-21 08:09:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://mb.com.ph/article/10902365/philippines/national/leviste-apologizes-to-fellow-congressmen-says-he-hasnt-accused-anyone-of-corruption"
  },
  {
    "title": "Arizona lawmaker wants to ban lab-grown meat — and send sellers to prison",
    "description": "PHOENIX -- You can't yet buy it in stores.",
    "source": "Mohavedailynews",
    "publishedAt": "2026-01-21 08:09:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.mohavedailynews.com/news/arizona-lawmaker-wants-to-ban-lab-grown-meat-and-send-sellers-to-prison/article_bdfdd04b-7c07-5a99-9304-0926655b5544.html"
  },
  {
    "title": "WP 'unable to accept' PM Wong's invitation to nominate next Leader of the Opposition - CNA",
    "description": "WP 'unable to accept' PM Wong's invitation to nominate next Leader of the Opposition CNAWP rejects PM Wong’s invitation to nominate another elected MP as Leader of the Opposition The Straits TimesMedia statement: Appointment of LO The Workers’ Party2 Sengkang MPs, former Hougang MP to sit on WP disciplinary panel looking into Pritam Singh’s conduct CNAWorkers’ Party launches disciplinary review of Pritam Singh; US Embassy defends Independence Day donation request: Singapore live news Yahoo News Singapore",
    "source": "Google News",
    "publishedAt": "2026-01-21 08:09:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxOcmlORUsyUk9nYlo3TW9jUTFCdjNHYTRBbVE1ZVk5QU85SnVGVHhlR2JZV1htMXdJX19QWktaOWYtSnJta0x1ajZMWjBLbkZtS0x1aUI1eUZsSndVTTdnS09KbEZyd0xRRnQtYkM2YTU2N1lVeFdJUk93X3d0ZTdZOTFQcllqeHV2ZU54TTlR?oc=5"
  },
  {
    "title": "WP 'unable to accept' PM Wong's invitation to nominate next Leader of the Opposition",
    "description": "The Workers' Party says the position should be held by the leader of the largest opposition party in parliament.",
    "source": "Channel Newsasia",
    "publishedAt": "2026-01-21 08:09:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.channelnewsasia.com/singapore/wp-not-nominating-leader-opposition-5873306"
  },
  {
    "title": "West Wits raises $27.5m through institutional investor placement",
    "description": "ASX-listed West Wits Mining has secured A$27.5-million through an equity placement, predominantly from institutional investors. The placement helps to strengthen the company’s balance sheet, provides capital to advance exploration and fully funds West Wits through to gold production at the Qala Shallows project, in South Africa’s Witwatersrand region.",
    "source": "Australasia Global Mining News",
    "publishedAt": "2026-01-21 08:09:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.miningweekly.com/article/west-wits-raises-275m-through-institutional-investor-placement-2026-01-21"
  },
  {
    "title": "Walker Lane Resources Ltd. Completes an Updated Mineral Resource and Plans in 2026 to Advance Exploration Efforts and a Preliminary Economic Assessment in its Silver Hart Project, Yukon, Canada",
    "description": "TSX-V: WLRFrankfurt: 6YLVANCOUVER, BC, Jan. 21, 2026 /CNW/ - Walker Lane Resources Limited is very pleased to announce that it has completed an updated Mineral Resource Estimate (\"MRE\") on its 100% owned Silver Hart Project, Yukon, Canada. The MRE was prepared by MICON International Limited in accordance the CIM 2019 Best Practice Guidelines and is reported in accordance with National Instrument 43-101 (\"NI 43-101\") - Standards of Disclosure for Mineral Projects and its Companion Policy 43-101CP with an effective date of January 6, 2026. The report was co-authored by Ronacher McKenzie Geosciences Inc. who conducted a site visit in 2025 to verify work completed since the 2021 season that has been reported by WLR which included a drill program in 2022, a minor sampling program on the Silver Hart claims in 2024, completion of a trenching program and minor reconnaissance efforts on the adjoining and acquired Blue Heaven claims in 2024, and reclamation programs on all of the claims in 2023 and 2024.Subject to financing WLR intends to conduct drilling, socio-economic, environmental and engineering studies and initiate a Preliminary Economic Assessment of the Silver Hart Project in 2026.The CIM Standards require that an estimated mineral resource must have reasonable prospects for eventual economic extraction. A summary of the SHP mineral resource economic and technical parameters and/or assumptions is presented in Table 1 below. A pit-shell was optimized based on silver equivalent values calculated using the economic parameters in the table.Table 1: Summary of the Siver Hart Project Economic and Technical Parameters/Assumptions Item Units Extended Mining cost CAD$/t all material 10.00Processing cost CAD$/t crude feed 25.50G&A cost CAD$/t crude feed 5.00Exchange rate CAD$ to US$ 0.75Ag price USD$/oz 23.30Pb price US$/metric tonne 1,892Zn price US$/metric tonne 2,505Metallurgical recovery Percentage 80Overall pit slope Degrees 45Silver Equivalent Calculation: AgEq g/t = [(Ag ppm x %Rec. x Price/g) + (Pb ppm x %Rec. x Price/g) + (Zn ppm x %Rec. x Price/g)]/ (Ag Price/g x %Rec). Note: Rec. = metallurgical recovery. AgEq=Silver Equivalent.Block grade interpolation was performed using the ordinary kriging (OK) technique. The estimated pit constrained mineral resources were classified as Inferred, despite some close drill hole spacing in some zones and the continuity of mineralization as confirmed by variography, mainly because of the lack of substantiated metal recoveries and suspect collar surveys. Table 2 summarizes the update MRE fpr the Silver Hart Project effective as at January 6, 2026.Table 2: Silver Hart Project - Pit Constrained Mineral Resources at a Cut-off Grade of AgEq>=50 g/t Mining Method Domain Mass (Tonnes) Average Value Material Content AgEq g/t Ag g/t Pb % Zn % AgEq Million oz Ag Million oz Pb Million lb Zn Million lb Open Pit TM_Zone 269,000229.8152.7Full story available on Benzinga.com",
    "source": "Benzinga",
    "publishedAt": "2026-01-21 08:09:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.benzinga.com/pressreleases/26/01/n50027689/walker-lane-resources-ltd-completes-an-updated-mineral-resource-and-plans-in-2026-to-advance-explo"
  },
  {
    "title": "Farage lobbies Team Trump in Davos",
    "description": "👉Listen to Politics at Sam and Anne's on your podcast app👈",
    "source": "Skynew",
    "publishedAt": "2026-01-21 08:09:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://news.sky.com/story/farage-lobbies-team-trump-in-davos-13496661"
  },
  {
    "title": "Google News Initiative launches new local language pilot to empower South African vernacular publishers",
    "description": "The Google News Initiative (GNI), in partnership with the Media Development and Diversity Agency (MDDA) and the Daily Maverick, has officially launched its local language pilot programme at the Iziko Museum in Cape Town. The launch event, attended by the Deputy Minister in the Presidency, Kenneth Morolong, marks the start of a nationwide provincial roadshow [...]",
    "source": "Sme Tech Guru",
    "publishedAt": "2026-01-21 08:08:59",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.smetechguru.co.za/google-news-initiative-launches-new-local-language-pilot-to-empower-south-african-vernacular-publishers/"
  },
  {
    "title": "Archive of Our Own will go down today, but don't freak out",
    "description": "Here's when the popular fan fiction website will return.Archive of Our Own (AO3) will be offline for over half a day on Wednesday as it implements some updates. Users of the popular fan fiction platform are being about as chill about it as expected.Fan fiction fans were warned of this week's AO3 outage well in ...",
    "source": "Mashable Me",
    "publishedAt": "2026-01-21 08:08:57",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://me.mashable.com/digital-culture/66049/archive-of-our-own-will-go-down-today-but-dont-freak-out"
  },
  {
    "title": "Chinese Stocks Rally on Growing Tech Bets, Defying Global Selloff - Bloomberg",
    "description": "Chinese Stocks Rally on Growing Tech Bets, Defying Global Selloff BloombergChina’s new tech stock boom leaves its economic malaise behind Yahoo Finance SingaporeThe Shangai Composite Index Closes 0.09% Higher TradingView — Track All MarketsChina Market Sentiment Turns Cautious on Economic Uncertainty FXEmpireChinese shares close higher Wednesday Xinhua",
    "source": "Google News",
    "publishedAt": "2026-01-21 08:08:56",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxNZFVSbGNOTnlxdnNhUVNJUmgyQ21vY0pKTnFXcFAtQXhfSm4tOF94RThVWkkxa0hJRUJWcGd3OWgxSk5nakotRy1oSzM4NTVPUUxILXVweE0yYjA1TDQzMG5ydFk5MjV5NU0xUXRpZzVzc3pDWmVWQTFyUllIVVV6Vnhib09KbXNyQkZOanJpM0MzOGhQWVRGR09wcFAteGNScG9zd0FkZWlCZW9JdlY3eENQRG0?oc=5"
  }
]