[
  {
    "title": "Working groups provide House Education Committee with updates and recommendations",
    "description": "The Vermont House of Representatives Committee on Education is wasting no time getting up to speed with the status of several working groups designed to deliver recommendations on Vermont’s education system.",
    "source": "Times Argus",
    "publishedAt": "2026-01-07 20:11:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.timesargus.com/news/local/working-groups-provide-house-education-committee-with-updates-and-recommendations/article_111c078f-a02b-572c-beeb-c2d7985ec0bf.html"
  },
  {
    "title": "Freeport Civil Service Commission elects chairman",
    "description": "Freeport’s new Civil Service Commission held its first meeting, swore in members, elected Tyrone Morrow chair, Jose Hernandez vice chair, and discussed rules, training, and staffing",
    "source": "Scoregolf",
    "publishedAt": "2026-01-07 20:11:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://thefacts.com/news/freeport-civil-service-commission-elects-chairman/article_5bd31518-1bb8-4209-8369-b96ccb236d5e.html"
  },
  {
    "title": "U.S. flexes air power in Maduro extraction mission",
    "description": "The extraction of Venezuelan President Nicolás Maduro ​and his wife on Saturday showcased ‌U.S. air dominance, deploying stealth fighters to control the skies, jets to jam enemy air defenses, ‌and covert reconnaissance drones and satellites to feed commanders real-time intelligence.",
    "source": "Hawaii News",
    "publishedAt": "2026-01-07 20:11:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.staradvertiser.com/2026/01/07/breaking-news/u-s-flexes-air-power-in-maduro-extraction-mission/"
  },
  {
    "title": "Mercy Seat Baptist Church begins new sanctuary build with volunteer help",
    "description": "The historic Mercy Seat Baptist Church in Washington is preparing to break ground on its new sanctuary with help from Volunteer Christian Builders, a group well-known in Washington County for assisting congregations in need.",
    "source": "Killeen Daily Herald",
    "publishedAt": "2026-01-07 20:11:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://kdhnews.com/news/texas/mercy-seat-baptist-church-begins-new-sanctuary-build-with-volunteer-help/article_e5e06be0-3aff-5fa2-9692-046710822e2d.html"
  },
  {
    "title": "BBC The Traitors fans stunned as secret Traitor exposed",
    "description": "The Traitors viewers were left stunned after one player was dramatically unmasked as the Secret Traitor moments into the BBC show.",
    "source": "Express",
    "publishedAt": "2026-01-07 20:11:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.express.co.uk/showbiz/tv-radio/2154968/bbc-traitors-fans-stunned-secret-traitor-exposed"
  },
  {
    "title": "Maryann Jasiak 'Midge' Crawford",
    "description": "Maryann Jasiak \"Midge\" Crawford, 77, of Jackson, Wyoming (previously of Grand Haven, Michigan) died on Dec. 21 at home. A celebration of life will take place in Grand Haven in the spring.",
    "source": "Grandhaventribune",
    "publishedAt": "2026-01-07 20:11:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.grandhaventribune.com/announcements/obituary/maryann-jasiak-midge-crawford/article_d77ea341-0541-5786-9b47-8048392c73d1.html"
  },
  {
    "title": "Working groups provide House Education Committee with updates and recommendations",
    "description": "The Vermont House of Representatives Committee on Education is wasting no time getting up to speed with the status of several working groups designed to deliver recommendations on Vermont’s education system.",
    "source": "Rutland Herald",
    "publishedAt": "2026-01-07 20:11:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.rutlandherald.com/news/local/working-groups-provide-house-education-committee-with-updates-and-recommendations/article_e0b4a2eb-4487-4916-926d-3ef9be8b1b27.html"
  },
  {
    "title": "Character.AI and Google settle with families in teen suicide and self-harm lawsuits",
    "description": "Character.AI and Google have reportedly agreed to settle multiple lawsuits regarding teen suicide and self-harm. According to The Wall Street Journal, the victims' families and the companies are working to finalize the settlement terms.The families of several teens sued the companies in Florida, Colorado, Texas and New York. The Orlando, FL, lawsuit was filed by the mother of 14-year-old Sewell Setzer III, who used a Character.AI chatbot tailored after Game of Thrones' Daenerys Targaryen. The teen reportedly exchanged sexualized messages with the chatbot and occasionally referred to it as \"his baby sister.\" He eventually talked about joining \"Daenerys\" in a deeper way before taking his own life.The Texas suit accused a Character.AI model of encouraging a teen to cut his arms. It also allegedly suggested that murdering his parents was a reasonable option. After the lawsuits were filed, the startup changed its policies and banned users under 18.Character.AI is a role-playing chatbot platform that allows you to create custom characters and share them with other users. Many are based on celebrities or fictional pop culture figures. The company was founded in 2021 by two Google engineers, Noam Shazeer and Daniel de Freitas. In 2024, Google rehired the co-founders and struck a $2.7 billion deal to license the startup's technology.On one hand, the settlements will likely compensate the victims' families handsomely. On the other hand, not going to trial means key details of the cases may never be made public. It's easy to imagine other AI companies facing similar suits, including OpenAI and Meta, viewing the settlements as a welcome development.This article originally appeared on Engadget at https://www.engadget.com/ai/characterai-and-google-settle-with-families-in-teen-suicide-and-self-harm-lawsuits-201059912.html?src=rss",
    "source": "Engadget",
    "publishedAt": "2026-01-07 20:10:59",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.engadget.com/ai/characterai-and-google-settle-with-families-in-teen-suicide-and-self-harm-lawsuits-201059912.html"
  },
  {
    "title": "Gov Lawal Inspects Projects, Says Zamfara Making Progress",
    "description": "Governor Dauda Lawal inspected the Women and Children Welfare Clinic (WCWC) Primary Healthcare Centre in Shinkafi Town, which was awarded for total renovation.The post Gov Lawal Inspects Projects, Says Zamfara Making Progress appeared first on Channels Television.",
    "source": "Channels Television",
    "publishedAt": "2026-01-07 20:10:59",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.channelstv.com/2026/01/07/gov-lawal-inspects-projects-says-zamfara-making-progress/"
  },
  {
    "title": "Character.AI and Google settle with families in teen suicide and self-harm lawsuits - Yahoo News Singapore",
    "description": "Character.AI and Google settle with families in teen suicide and self-harm lawsuits Yahoo News SingaporeGoogle, AI firm settle lawsuit over teen's suicide linked to Chatbot CNACharacter.ai and Google agree to settle lawsuits over teen suicides Financial TimesGoogle, AI startup reach settlement in teen suicide lawsuit Tech in AsiaGoogle and Character.AI Negotiate Settlement Over AI Chatbot Harm to Teens Букви",
    "source": "Google News",
    "publishedAt": "2026-01-07 20:10:59",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxORkZ6d2lzcDZaOWhmaTZsYzFCWFE2NWR4U2VGRmFiaHZJbzM1TEV3Tk8tejEtQ2R6ZTJKWmVaZXN6UXhEMzRmQWp3UmU1ak01Ui1nQ0hzREtCaHlmVVRrZlZobDFUUDkycVkySFFfbkQ3cG1qRXZQWVhvMG9VOVJTN2hn?oc=5"
  }
]