[
  {
    "title": "Why the FTSE 100 has smashed the S&P 500 this week",
    "description": "Concerns about the impact of AI have allowed the FTSE 100 to catch up to its US counterpart. So where should investors look for stocks to buy now?The post Why the FTSE 100 has smashed the S&P 500 this week appeared first on The Motley Fool UK.",
    "source": "Fool Uk",
    "publishedAt": "2026-02-07 08:06:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.fool.co.uk/2026/02/07/why-the-ftse-100-has-smashed-the-sp-500-this-week/"
  },
  {
    "title": "BMW Ventures Reports Strong Q3 FY26 Performance Driven by Significant Deleveraging and Growth in Business of Fabricated Steel Products",
    "description": "Patna (Bihar) [India], February 7: BMW Ventures Limited (BSE: 544543, NSE: BMWVENTLTD), one of Eastern India's largest steel distributors and manufacturers of fabricated steel products, announced its financial results for Q3 FY26, highlighting a sharp rise in profitability, led by a significant reduction in interest costs following deleveraging from IPO proceeds and growth in the business of fabricated steel products. An Interim Dividend of Rs. 1.50 per equity share of face value of Re. 10/~ each for the financial year 2025-26 announced by the company.",
    "source": "Business Standard",
    "publishedAt": "2026-02-07 08:05:59",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.business-standard.com/content/press-releases-ani/bmw-ventures-reports-strong-q3-fy26-performance-driven-by-significant-deleveraging-and-growth-in-business-of-fabricated-steel-products-126020700612_1.html"
  },
  {
    "title": "Beverley Callard reveals cancer diagnosis but vows to continue in Fair City",
    "description": "The actress said she and her husband will be moving to Co Wicklow.",
    "source": "Breakingnews",
    "publishedAt": "2026-02-07 08:05:51",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.breakingnews.ie/ireland/beverley-callard-reveals-cancer-diagnosis-but-vows-to-continue-in-fair-city-1862500.html"
  },
  {
    "title": "KCA University, Chandaria Foundation sign Sh20mn deal to launch Innovation Hub",
    "description": "KCA University and Chandaria Foundation sign Sh20 million deal to establish a business incubation and innovation centre targeting youth job creation.",
    "source": "Capital News",
    "publishedAt": "2026-02-07 08:05:49",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.capitalfm.co.ke/news/2026/02/kca-university-chandaria-20m-innovation-centre/"
  },
  {
    "title": "Kenyan Activists Seek Court Halt on Deployment of “High-Risk” AI Systems",
    "description": "Human rights activists have filed a petition at the High Court in Kerugoya seeking urgent orders to halt the deployment of what they describe as “high-risk artificial intelligence systems” in Kenya. The petitioners argue that the rapid and largely unregulated use of AI technologies poses serious threats to fundamental rights and constitutional freedoms. The case [...]",
    "source": "Iafrica",
    "publishedAt": "2026-02-07 08:05:47",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://iafrica.com/kenyan-activists-seek-court-halt-on-deployment-of-high-risk-ai-systems/"
  },
  {
    "title": "World : Malaysian Embassy In Tokyo Urges Travellers To Exercise Caution",
    "description": "KUALA LUMPUR, Feb 7 (Bernama) -- Embassy of Malaysia in Tokyo has advised travellers to exercise caution when travelling to regions covered by weather warnings and advisories issued by Japan Meteorological Agency due to snowstorms, heavy snow and ice accretion.",
    "source": "Bernama",
    "publishedAt": "2026-02-07 08:05:45",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "http://www.bernama.com/en/news.php?id=2521236"
  },
  {
    "title": "AU Seeks Nigerian Navy’s Support To Host Continent Navies Exercise In 2027",
    "description": "The African Union Commissioner for Political Affairs, Peace and Security (AU CPAPS), Ambassador Bankole Adeoye, has sought the support of the Nigerian Navy to host pan-African naval exercise in 2027 to enhance cooperation among African navies. He made the appeal yesterday during a courtesy visit to the Chief of the Naval Staff, Vice Admiral Idi [...]",
    "source": "Leadership",
    "publishedAt": "2026-02-07 08:05:44",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://leadership.ng/au-seeks-nigerian-navys-support-to-host-continent-navies-exercise-in-2027/"
  },
  {
    "title": "General : Finas Organises Creative Workshop For PWD On Voice Acting, Radio Drama",
    "description": "KUALA LUMPUR, Feb 7 (Bernama) -- The National Film Development Corporation Malaysia (Finas) is strengthening the country’s creative industry ecosystem with the organisation of a creative workshop for persons with disabilities (PWD), focusing on voice acting and radio drama.",
    "source": "Bernama",
    "publishedAt": "2026-02-07 08:05:43",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "http://www.bernama.com/en/news.php?id=2521243"
  },
  {
    "title": "World : More Than 80 Flood Warnings Issued In UK With More Downpours Forecast",
    "description": "LONDON, Feb 7 (Bernama-PA Media/dpa) -- More than 80 warnings of expected flooding are in place as relentless rain continues to soak the United Kingdom, reported PA Media/dpa.",
    "source": "Bernama",
    "publishedAt": "2026-02-07 08:05:43",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "http://www.bernama.com/en/news.php?id=2521239"
  },
  {
    "title": "LTA: Singapore to raise entry permit fees for foreign-registered vehicles from 2027 as the cost gap with local cars widens",
    "description": "SINGAPORE: Singapore will raise entry and road-use fees for foreign-registered vehicles from January 1, 2027, tightening rules that have stayed largely unchanged for years. The changes will affect cars, motorcycles, and goods vehicles entering Singapore. They will also introduce flat-rate ERP charges for foreign vehicles without the new on-board unit. According to the Land Transport [...]",
    "source": "The Independent Singapore",
    "publishedAt": "2026-02-07 08:05:42",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://theindependent.sg/lta-singapore-to-raise-entry-permit-fees-for-foreign-registered-vehicles-from-2027-as-the-cost-gap-with-local-cars-widens/"
  }
]