[
  {
    "title": "All Arc Raiders Quests - Full Mission List",
    "description": "Arc Raiders is an extraction shooter that takes place in a punishing world featuring robotic enemies that can destroy you for making one wrong move. When you add in the threat of other players who might want to kill you and take your loot, too, you really need to make sure you're prepared to fight at all times. But there's a bit more to the game than just survival, as there are also a variety of quests to complete that can provide you with resources that will help you on your journey through Speranza. Below, we've listed out every quest you can undertake in Arc Raiders.Arc Raiders missions listThere are currently 63 quests in Arc Raiders, though more will be added with future updates. As of right now, you can expect to spend dozens of hours completing these quests, which task you with finding spots on the map to interact with, looting unique resources to return safely to someone in Speranza, or defeating specific enemy types.Every quest is accepted by speaking to Traders in Speranza, and they'll need to be turned in after completion to receive any rewards. Additionally, some quests will be locked behind progression, so you'll need to keep pushing through your currently accepted tasks to continue unlocking new quests to tackle. If you're struggling to complete any of them, you may want to recruit a pal (or stranger) to watch your back. Here is every quest currently available in Arc Raiders roughly in the order you'll see them unlock, though the order can change a little bit based on which quests you're completing before or after others.Picking Up the PiecesClearer SkiesTrash Into TreasureOff the RadarA Bad FeelingThe Right ToolHatch RepairsSafe PassageDown to EarthThe TrifectaA Better UseWhat Goes AroundSparks FlyGreasing Her PalmsA First FootholdDormant BaronsMixed SignalsWhat We Left BehindDoctor's OrdersMedical MerchandiseA Reveal in RuinsBroken MonumentMarked for DeathStraight RecordA Lay of the LandMarket CorrectionKeeping the MemoryReduced to RubbleWith a TraceEyes on the PrizeEchoes of Victory RidgeIndustrial EspionageUnexpected InitiativeA Symbol of UnificationCeleste's JournalsBack on TopThe Major's FootlockerOut of the ShadowsEyes in the SkyOur Presence Up ThereCommunication HideoutAfter Rain ComesA Balanced HarvestUntended GardenThe Root of the MatterWater TroublesInto the FraySource of the ContaminationSwitching the SupplyA Warm Place to RestPrescriptions of the PastPower OutLost in TransmissionFlickering ThreatBees!EspressoLife of a PharmacistTribute to ToledoDigging Up DirtTurnaboutBuilding a LibraryA New Type of PlantArmored TransportsFor more on Arc Raiders, check out All Field Depot Locations and don't forget to use our Arc Raiders tips.",
    "source": "Gamespot",
    "publishedAt": "2025-11-04 20:08:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.gamespot.com/articles/all-arc-raiders-quests-full-mission-list/1100-6535922/?ftag=CAD-01-10abi2f"
  },
  {
    "title": "Eagles vs Packers Predictions - Early Picks & Odds for Monday Night Football Week 10",
    "description": "Rohit Ponnaiya breaks down his early Eagles vs. Packers predictions ahead of Monday Night Football at Lambeau Field. Free NFL picks for November 10.",
    "source": "Yahoo! News",
    "publishedAt": "2025-11-04 20:08:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.covers.com/nfl/eagles-vs-packers-predictions-odds-early-leans-mnf-week-10-2025"
  },
  {
    "title": "Sticker shock? Wyomingites could see skyrocketing bills on ACA health insurance marketplace",
    "description": "When the Affordable Care Act marketplace, where roughly 42,000 Wyoming residents get their health insurance, opened enrollment Saturday, customers likely faced a double whammy: higher prices and fewer resources.",
    "source": "Wyoming Tribune Eagle",
    "publishedAt": "2025-11-04 20:08:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.wyomingnews.com/news/local_news/sticker-shock-wyomingites-could-see-skyrocketing-bills-on-aca-health-insurance-marketplace/article_9bf84c86-df6f-4d4a-a7de-24636e3f958b.html"
  },
  {
    "title": "Mid-season WMA waterfowl quota hunt app period to be held Oct. 22-Nov. 12",
    "description": "TWRA News",
    "source": "Citizentribune",
    "publishedAt": "2025-11-04 20:08:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.citizentribune.com/news/state/mid-season-wma-waterfowl-quota-hunt-app-period-to-be-held-oct-22-nov-12/article_57b6d02a-512c-5f5f-ad3e-f7069661907f.html"
  },
  {
    "title": "Murphy's Taproom closes after 19 years in Manchester",
    "description": "Murphy’s Taproom has been a mainstay of Elm Street in Manchester since it took over the Omega Entertainment Complex in 2007. Now, it’s no more after the owners decided to consolidate the Manchester location into its Bedford facility.",
    "source": "Unionleader",
    "publishedAt": "2025-11-04 20:08:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.unionleader.com/news/business/murphys-taproom-closes-after-19-years-in-manchester/article_51372c79-cfd3-4a1d-92bd-a54b79048e46.html"
  },
  {
    "title": "Analysis: Obamacare is still on Trump’s mind — but outlook appears doubtful",
    "description": "WASHINGTON — President Donald Trump still has Barack Obama’s signature legislative accomplishment on his mind, but the political calendar and environment are not on his side. Pushing a measure to revise — or even replace — the 2010 health care...",
    "source": "The Brunswick News",
    "publishedAt": "2025-11-04 20:08:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://thebrunswicknews.com/news/national_news/analysis-obamacare-is-still-on-trump-s-mind-but-outlook-appears-doubtful/article_1515e7af-4c9e-5b33-abac-13289e4b953d.html"
  },
  {
    "title": "Survey: 28M Americans plan to RV this winter as economic uncertainty drives travel shift",
    "description": "Faced with costly flights and crowded airports, millions of Americans are choosing the open road this holiday season.",
    "source": "Hastingstribune",
    "publishedAt": "2025-11-04 20:08:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.havasunews.com/lifestyle/survey-28m-americans-plan-to-rv-this-winter-as-economic-uncertainty-drives-travel-shift/article_7b240871-ec97-48cb-9d08-eff02a1e0c16.html"
  },
  {
    "title": "Mid-season WMA waterfowl quota hunt app period to be held Oct. 22-Nov. 12",
    "description": "TWRA News",
    "source": "Greenevillesun",
    "publishedAt": "2025-11-04 20:08:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.greenevillesun.com/news/state/mid-season-wma-waterfowl-quota-hunt-app-period-to-be-held-oct-22-nov-12/article_23da9930-12af-57fc-9021-f422e98abcc3.html"
  },
  {
    "title": "The Slot machine is up and running again as record-equalling Liverpool sink Real",
    "description": "Alexis Mac Allister's second-half header proves decisive as Liverpool deservedly defeat Real Madrid 1-0 to equal a Champions League record.",
    "source": "Sports Mole",
    "publishedAt": "2025-11-04 20:08:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.sportsmole.co.uk/football/liverpool/champions-league/result/the-slot-machine-is-up-and-running-again-as-record-equalling-liverpool-sink-real_585110.html"
  },
  {
    "title": "Mid-season WMA waterfowl quota hunt app period to be held Oct. 22-Nov. 12",
    "description": "TWRA News",
    "source": "Manchestertimes",
    "publishedAt": "2025-11-04 20:08:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.manchestertimes.com/news/state/mid-season-wma-waterfowl-quota-hunt-app-period-to-be-held-oct-22-nov-12/article_7d2502a5-9020-583d-b545-eb672355acc6.html"
  }
]