[
  {
    "title": "Asking Eric: Self-aware friend cut me off when I pointed out they were using me for free therapy",
    "description": "A boundary was set. But this friend didn't take kindly to the new rules.",
    "source": "Oregon Local News",
    "publishedAt": "2025-11-11 08:04:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.oregonlive.com/entertainment/2025/11/asking-eric-self-aware-friend-cut-me-off-when-i-pointed-out-they-were-using-me-for-free-therapy.html"
  },
  {
    "title": "India PM Modi: Those responsible for Delhi blast which killed eight will be brought to justice",
    "description": "Indian PM Narendra Modi vowed justice after a car bomb near Delhi’s Red Fort killed eight and wounded 20, as police launched a terror probe into the blast.",
    "source": "Jpost",
    "publishedAt": "2025-11-11 08:04:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.jpost.com/international/article-873449"
  },
  {
    "title": "‘Fire him!’ Fall guy for disaster Luka trade emerges in awkward scenes; miracle game winner stuns — NBA Wrap",
    "description": "MVP contender Luka Doncic is flourishing in LA. Doncic scored a game-high 38 points with seven assists and six rebounds to lead the 8-3 Lakers in a 121-111 victory at Charlotte.",
    "source": "Fox Sports",
    "publishedAt": "2025-11-11 08:04:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.foxsports.com.au/basketball/nba/nba-2025-dallas-general-manager-nico-harrisons-future-fire-nico-chants-luka-doncic-trade-reaction-response-andrew-wiggins-gamewinning-dunk-cade-cunningham-tripledouble-scores-results-highlights-latest-news/news-story/afacbb2a37d6aaae4f03eddd2bbdb64e"
  },
  {
    "title": "Britons are moving to Malta to cut tax bills - report",
    "description": "Malta has become a \"particularly popular destination\" for British people \"since Labour came to power\" in the UK, The Times of London reported on Sunday.\"I don't think we could have coped with being in the UK much longer,\" said Louise Burley, 46, was quoted as saying. \"We were getting ... squeezed every day, taxed on everything. We have a couple of houses we rent out and there is hardly any point in keeping those.\"That the Maltese traffic system is similar to that of the UK - driving on the left - has made it easier, the report says, adding that the presence of red letter-boxes and the strong cultural ties that exist between the two countries has made it all the more comfortable for British people to settle in Malta.\"A part of the Commonwealth, Malta's tax, legal and education systems are strongly influenced by the British. The country's two official languages are Maltese and English,\" the report says.\"Education is another selling point. Malta has many well-respected independent schools which charge much cheaper fees than their equivalents in the UK. The Maltese government offers tax breaks to parents who go private, for easing pressure on the state sector.\"Read report in full here",
    "source": "Malta Independent",
    "publishedAt": "2025-11-11 08:04:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.independent.com.mt/articles/2025-11-11/local-news/Britons-are-moving-to-Malta-to-cut-tax-bills-report-6736284697"
  },
  {
    "title": "CAT 2025 Admit Card to be released on THIS date at iimcat.ac.in, check how to download hall ticket",
    "description": "The CAT 2025 admit card will be released on November 12 at iimcat.ac.in. Candidates can download it till November 30, the exam date.",
    "source": "Dna",
    "publishedAt": "2025-11-11 08:04:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.dnaindia.com/education/report-cat-2025-admit-card-to-be-released-on-this-date-at-iimcatacin-check-how-to-download-hall-ticket-3187876"
  },
  {
    "title": "WATCH: Filipinos closely monitor Duterte’s ICC case — Survey",
    "description": "Welcome to The Manila Times, where we bring you stories that shape our world.Today is November 11th.Our top story:Public attention on former President Rodrigo Duterte and his case at the International Criminal Court (ICC) remains intense. That’s according to the PAHAYAG 2025 Third Quarter Survey. The survey shows that nearly three in four Filipinos, or seventy-five percent, reported following news about Duterte’s case at the ICC. Duterte is facing trial for alleged crimes against humanity in connection with the anti-illegal drug campaign during his presidency. When asked about the aspects of the ICC case the respondents most remember, a majority of Filipinos—or 81 percent—cited Duterte’s declining health. This is followed by reports of family visits at The Hague at 53 percent, and the three counts of murder filed against him at fifty percent. The survey was an independent, non-commissioned nationwide purposive sampling study. It was conducted from September 27 to 30. The respondents were 1,500 registered Filipino voters randomly selected.Read more: https://tmt.news/2220751 The death toll from Typhoon “Tino” is still rising. It is now at 232, according to the NDRRMC. The NDRRMC also reported that 523 were injured during the onslaught of “Tino.” Another 112 individuals were reported missing. The NDRRMC says deaths, missing, and injured remain highest in hard-hit Cebu, followed by the Negros Island Region. The rest are scattered across the Visayas and parts of Mindanao.Super Typhoon “Uwan” affected over 2 million people. That’s according to the latest report from the NDRRMC. “Uwan” displaced hundreds of thousands and damaged infrastructure, homes, and farmland across several regions. At least six people were reported dead and 13 others injured. However, authorities say that most of the casualty reports still need to be validated.Read more: https://tmt.news/2220734 Five Luzon dams continue to release water due to rainfall from super typhoon “Uwan”. These include Angat Dam, the main source of water supply for Metro Manila. The others are Ipo, Ambuklao, Binga, and Magat Dams. Pagasa says “Uwan” brought a high volume of rainfall, especially in areas where dams are located. This prompted dam operators to open their gates to prevent overflow or the collapse of dam facilities. Pagasa says all concerned local officials have been informed about the opening of floodgates.Read more: https://tmt.news/2220722 “Uwan” weakened into a severe tropical storm outside the Philippine Area of Responsibility (PAR). It will follow a recurving path, turning northward today. It may re-enter PAR tomorrow evening as it makes landfall over the southwestern coast of Taiwan. Batanes and the western portion of Ilocos Norte remain under Signal Number Two.Read more: https://tmt.news/2220666 Dozens of flights were delayed because of a false fire at the Air Traffic Management Center. The Civil Aviation Authority of the Philippines (CAAP) says the fire alarm was triggered before 1:30 this morning. This prompted the activation of the contingency plan and safety protocols, as well as a temporary hold on departures. Fifty-nine commercial and cargo flights waited for about 45 minutes before being cleared for departure. Seven arriving flights were also affected. CAAP will conduct an internal investigation to prevent similar occurrences.Read more: https://tmt.news/2220727 That’s all for now on The Manila Times Newscast.For more news and information, read The Manila Times on print, subscribe to its digital edition, or log on to www.manilatimes.net. Follow us on Facebook, Instagram, Twitter, TikTok, and LinkedIn; and be part of our communities on Viber, Telegram, WhatsApp, and Mastodon.Stay tuned for more updates throughout the day, and remember to stay safe, stay informed, and stay connected.",
    "source": "The Manila Times",
    "publishedAt": "2025-11-11 08:04:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.manilatimes.net/2025/11/11/videos/watch-filipinos-closely-monitor-dutertes-icc-case-survey/2220789"
  },
  {
    "title": "I'm a beauty writer & these are the 'slow-ageing' treatments I'd recommend to my mother",
    "description": "Discover the 'slow ageing' approach and the top non-surgical aesthetic treatments for women over 50. Learn what doctors recommend for double chin, nasolabial folds and cheekbones.",
    "source": "Hellomagazine",
    "publishedAt": "2025-11-11 08:04:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.hellomagazine.com/healthandbeauty/skincare-and-fragrances/863987/non-surgical-face-treatments-over-50/"
  },
  {
    "title": "Dear Abby: Disabled woman sees only trouble ahead if wife’s brother continues to live with them",
    "description": "He's lived there for 10 years. She's had enough.",
    "source": "Oregon Local News",
    "publishedAt": "2025-11-11 08:04:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.oregonlive.com/entertainment/2025/11/dear-abby-disabled-woman-sees-only-trouble-ahead-if-wifes-brother-continues-to-live-with-them.html"
  },
  {
    "title": "Tesla Cybertruck division chief resigns",
    "description": "The executive leading Tesla's Cybertruck business is leaving the Elon Musk-led automaker after eight years.",
    "source": "Nwaonline",
    "publishedAt": "2025-11-11 08:04:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.nwaonline.com/news/2025/nov/11/tesla-cybertruck-division-chief-resigns/"
  },
  {
    "title": "Real Madrid Confimed to Have €150M Price on Chelsea, PSG-Linked Star",
    "description": "Vinícius Jr.’s future at Real Madrid may be up in the air, and PSG could stand to gain from the situation. After the 2025-26 season, the Brazilian will have only one year left on his contract, whic...",
    "source": "Yahoo! News",
    "publishedAt": "2025-11-11 08:04:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://psgtalk.com/2025/11/real-madrid-confirmed-chelsea-psg-star/"
  }
]