[
  {
    "title": "Men's Higher Multiple Myeloma Risk: Why? - Mirage News",
    "description": "Men's Higher Multiple Myeloma Risk: Why? Mirage News",
    "source": "Google News",
    "publishedAt": "2026-01-12 08:06:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE5IUHZaS29XdDFlY1RldHoxdVlaQ1o5RFpSSVdwanM2eUIyT1NqTEZCLWdscnc0elppa2FsVVJlamF1TGJadkZKOTdwSzAyRC02VnpHNFRJUmhMUmlCcUVzb1l3YVBoeHhCLTZrQmZDYkVhV1B1ckk5QzNKYVdHUQ?oc=5"
  },
  {
    "title": "Stock market today: NSE Nifty50 climbs above 25,700; BSE Sensex trades flat - Times of India",
    "description": "Stock market today: NSE Nifty50 climbs above 25,700; BSE Sensex trades flat Times of IndiaView Full coverage on Google News",
    "source": "Google News",
    "publishedAt": "2026-01-12 08:06:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://news.google.com/rss/articles/CBMisgJBVV95cUxPU2k1eUJDQXBUZlFlRk5va0V1MXhpVC14dFVheFRTTE5aR2U0cWpFX0V3X1ltdnhaUnJIUHh3R1RQek1wMmU0bXdvVUhoWGVnN1RmU3ZJMlBlRHRRZWJqc2Nia094U3poUXhUWkc0d3hVRER4R3lZbThQS2tSeVh3WVkxMjZzRmRzTGx0OGJfbFM4dXEyS0xyaWR0NGxQUnM3aWwwM3hjLXNOQUozTS1CNWVYNU9HQlI1YXZ0WGhyTHFvMU92eGdoWWVFMTExWVI3OF81UlVUNWpuOFdnTjlkYi1vbXkzY1d6WktFZUVTOU9jTnduX25Fb09rVWE1UVczc0QyUUhsZnRYRlJSOE8wNVFaYm0tM0dZc1VISWRnRE9rM1J4TFQ0RTc1NllzNUtBS1E?oc=5"
  },
  {
    "title": "Odesa and surrounding region are without power after Russian drone attack",
    "description": "Two people were injured in the Odesa region as a result of an attack by Russian drones on the night of January 12.",
    "source": "Ukrinform",
    "publishedAt": "2026-01-12 08:06:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.ukrinform.net/rubric-ato/4079286-odesa-and-surrounding-region-are-without-power-after-russian-drone-attack.html"
  },
  {
    "title": "Marques Ackerman press conference: On playoff push after clinching must-win game vs SEC",
    "description": "Marques Ackerman reacts after his side secured a crucial must-win victory to claim four vital points. Ackerman admitted the match got closer than expected but said the win could be the momentum boost the team desperately needed after a stop-start campaign affected by rain interruptions.",
    "source": "The Times Of India",
    "publishedAt": "2026-01-12 08:05:59",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://timesofindia.indiatimes.com/videos/sports/cricket/marques-ackerman-press-conference-on-playoff-push-after-clinching-must-win-game-vs-sec/videoshow/126478638.cms"
  },
  {
    "title": "Horsham Music Circle promises quality spring line-up",
    "description": "Following an autumn of vibrant music-making and well-attended concerts, Horsham Music Circle is now promising a spring series filled with “star performers, expressive breadth and exceptional variety.”",
    "source": "Sussexworld",
    "publishedAt": "2026-01-12 08:05:58",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.sussexexpress.co.uk/news/horsham-music-circle-promises-quality-spring-line-up-5453052"
  },
  {
    "title": "Trump says US will take Greenland 'one way or the other'",
    "description": "'If we don't take Greenland, Russia or China will, and I'm not letting that happen', he says",
    "source": "The Daily Star",
    "publishedAt": "2026-01-12 08:05:56",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.thedailystar.net/news/trump-says-us-will-take-greenland-one-way-or-the-other-4079126"
  },
  {
    "title": "Australian private school threatened with closure over principal’s social media posts",
    "description": "An Islamic school has seven days to prove that its principal is “fit and proper” or risk being shut down.",
    "source": "Stuff",
    "publishedAt": "2026-01-12 08:05:56",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.stuff.co.nz/world-news/360923447/private-school-threatened-closure-over-principals-social-media-posts"
  },
  {
    "title": "Government decides against increasing electricity tariff",
    "description": "The government has decided not to increase the average basic electricity tariff, offering major relief to consumers amid rising energy costs.During a hearing at the National Electric Power Regulatory Authority (NEPRA), the additional secretary of the Power Division stated that subsidy adjustments have been made, eliminating the need for a tariff hike.According to the Power Division officials, a significant change in the energy mix has been witnessed since July, which has affected the overall cost of electricity.“The government has decided that no additional burden will be passed on to consumers, and electricity rates will remain at their current levels,” the officials said.The Power Division officials also revealed that a total of Rs629 billion in subsidies is being provided to various categories of consumers.The financial requirements of the power sector were Rs3,768 billion in 2024, while the estimated requirement for 2026 is Rs3,379 billion.The officials highlighted that the industrial cross-subsidy has been reduced from Rs225 billion to Rs102 billion, and the inefficiencies of power companies will not be passed on to consumers.Authorities in Islamabad also announced that a new billing system will be launched soon, which would enhance transparency.The Power Division has requested NEPRA to make a timely decision to ensure the government’s policy can be implemented effectively.",
    "source": "Aaj English Tv",
    "publishedAt": "2026-01-12 08:05:53",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://english.aaj.tv/news/330450794/government-decides-against-increasing-electricity-tariff"
  },
  {
    "title": "Star India cricketer credits Nandini Sharma’s five-wicket haul and hat-trick for keeping Delhi Capitals in hunt in WPL 2026 game, says...",
    "description": "Home Sports Star India cricketer credits Nandini Sharmas five-wicket haul and hat-trick for keeping Delhi Capitals in hunt in WPL 2026 game, says... Cricket expert Saba Karim, Anjum Chopra and Katey Martin shared their thoughts on Sophie Devine’s calm under pressure, the rise of young Indian pacer, and the improving standard and competitiveness of the [...]",
    "source": "The Times Of Bengal",
    "publishedAt": "2026-01-12 08:05:53",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.thetimesofbengal.com/sports/star-india-cricketer-credits-nandini-sharmas-five-wicket-haul-and-hat-trick-for-keeping-delhi-capitals-in-hunt-in-wpl-2026-game-says/"
  },
  {
    "title": "How Much Tax Do You Have To Pay If Your NRI Relative Transfers Foreign Funds To You?",
    "description": "NRIs sending money to their Indian relatives is common. Here's how the tax implications arise out of any money or asset received from an NRI relative under Indian tax laws",
    "source": "Outlook Money",
    "publishedAt": "2026-01-12 08:05:52",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.outlookmoney.com/tax/how-much-tax-do-you-have-to-pay-if-your-nri-relative-transfers-foreign-funds-to-you"
  }
]