[
  {
    "title": "Airport Weather Warning until TUE 5:15 PM EST",
    "description": "Strong Wind Gusts Expected at Buffalo-Niagara International Airport This Afternoon",
    "source": "Buffalonews",
    "publishedAt": "2025-12-30 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://buffalonews.com/news/local/weather/article_5526630e-019e-5fd1-96fb-ec506ada3dfc.html"
  },
  {
    "title": "SCRAPS halts dog adoptions following parvovirus outbreak",
    "description": "SPOKANE VALLEY, Wash. — The Spokane County Regional Animal Protection Service has suspended adult dog adoptions for at least two weeks after confirming five cases of canine parvovirus at its facility, according to a SCRAPS news release.",
    "source": "Kxly",
    "publishedAt": "2025-12-30 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.kxly.com/news/scraps-halts-dog-adoptions-following-parvovirus-outbreak/article_d8feb477-2d9d-43b0-8d26-a6eff5634289.html"
  },
  {
    "title": "Travball emerges, athletics surges, Brisbane basks in success: Australia’s biggest sporting moments of 2025 - The Guardian",
    "description": "Travball emerges, athletics surges, Brisbane basks in success: Australia’s biggest sporting moments of 2025 The GuardianInternational incidents, stunning sprays, fairytale wins: Our top 10 most-read stories of 2025 fox sportsDrama, dreams, distraction, diversion - 2025 in sport SBS AustraliaTest your 2025 sport smarts: From Piastri’s rise to Postecoglou’s demise and Melham’s double delight The Sydney Morning HeraldPiastri intrigue, Picklum magic and Gout goes global: reflections on a year of Australian sport | Jack Snape The Guardian",
    "source": "Google News",
    "publishedAt": "2025-12-30 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQbndVY0N5Yks3cmp6V0JkWFN0alUwRk1telNDX3ZKZVRkSXVhRUpnTVF2YXRmR3V0NGt0MW9HbXNOeXNtRE1VSTk3VFBSRzFmNWRXVVo2NGVtRkh2czhhVDFzbEJ2bGR3RjRSczZQN1phSnpvdjd2YlFrOFRWUXE3bUZya2FBdWVSaWtaNlZB?oc=5"
  },
  {
    "title": "Liverpool initiate contact to sign special winger",
    "description": "Semenyo or no Semenyo, Liverpool are going to have to bring in a winger. Especially, when you're looking at the state of play as well.Mo Salah's future hangs in the balance. Cody Gakpo has frustrated ...",
    "source": "Yahoo! News",
    "publishedAt": "2025-12-30 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://sports.yahoo.com/articles/liverpool-initiate-contact-sign-special-201000571.html"
  },
  {
    "title": "Ronald Dean Worcester",
    "description": "Ronald Dean Worcester, of Olathe, KS, died Monday, December 28, 2025, at the Good Samaritan Nursing Home in Olathe. He was 79.",
    "source": "Emporiagazette",
    "publishedAt": "2025-12-30 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.emporiagazette.com/free/article_0302f897-774c-45cb-9c8a-7d2b8b9df6c0.html"
  },
  {
    "title": "Festival delivers festive magic",
    "description": "The Orbost Christmas Eve Festival once again proved why it is one of the town's most cherished traditions, with large crowds turning out in force to celebrate Christmas Eve in Nicholson Street.While the breeze picked up throughout the evening, spirits remained high as families, friends and visitors flowed steadily through the festival precinct, enjoying the vibrant atmosphere and wide range of entertainment and activities on offer.Stallholders, particularly food vendors, reported some of their strongest sales in years, with many selling out before the evening wrapped up.First-time food vendors were especially impressed, including Vicki from Doin Dumplings who was amazed by the sheer number of people attending and the enthusiastic response from festival-goers.Entertainment highlights included the much-anticipated return of Wacky Wombat, who drew a large and captivated crowd for his performance culminated in an impressive fire spectacle, providing a memorable moment and a fitting finale to the street entertainment.The introduction of the laser tag course proved to be a standout addition to this year's festival, quickly becoming a crowd favourite.Children lined up for multiple turns, while many parents were also seen getting involved, turning the experience into friendly family competition.Orbost Police officers were also out in force, setting up an engaging display that attracted strong participation throughout the evening.Their interactive activities encouraged fun, laughter and connection, helping to build positive relationships and lasting bonds within the community.The ever-popular Orbost and District Chamber of Commerce and Industry lucky shopper major draw was won by Brent, with Megan Sage and Deon Scott also taking out prizes on the night.The Christmas Lights Competition showcased the creativity and festive spirit of the district, with winners announced before the celebrations moved to Forest Park.This year's winners were:- Best Overall: Mark McDonald, Tom Jensen and Aaron Hambling- Best Decorated Tree: Hamilton Street- Best Decorated Garden: Scott Woerz- Novice: Megan Sage and Terry JansonCommittee member Samantha Reynolds said the night exceeded expectations once again.\"The fireworks were phenomenal, and we always worry about how the event will be received given the amount of effort that goes into creating it,\" she said.\"Every year, the committee gets to sit back at the end of the night and feel absolutely thrilled with the outcome.\"It truly is the most magical time of the year and we cannot thank the large crowds for supporting us. We all get so much enjoyment out of watching the community come together and love all of our efforts.\"Festival organisers extended their heartfelt thanks to the community, volunteers, sponsors, stallholders, emergency services and local traders who helped make the event such a success.The Orbost Christmas Eve Festival continues to be a celebration of community, connection and Christmas spirit — and this year's event delivered that magic in spades.The post Festival delivers festive magic first appeared on Snowy River Mail.",
    "source": "Snowy River Mail",
    "publishedAt": "2025-12-30 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://snowyrivermail.com.au/14707/festival-delivers-festive-magic/"
  },
  {
    "title": "Eyewitnesses describe mysterious explosion in northwest Venezuela",
    "description": "A firsthand account of an explosion along the Venezuelan coast on Dec. 18 is raising questions about who may have been responsible for the attack and whether it was connected to the U.S.’s escalating pressure campaign against the South American country.The arid coastal strip in the northwest of Venezuela, known as Alta Guajira, is heavily controlled by the National Liberation Army, or Ejército de Liberación Nacional (ELN) in Spanish, an armed guerilla group known for its history of drug trafficking that is also active in neighboring Colombia. Two members of Venezuela’s Wayuu indigenous community in the area told NBC News that they witnessed an unexplained explosion on Dec. 18 that destroyed a hut that possibly was used for storage. President Donald Trump said in an interview with WABC radio in New York last week that the U.S. had “knocked out” a facility tied to Venezuela, a move that would be a major escalation in U.S. military strikes to counter alleged drug-trafficking by the South American country.NBC News reporting has not established a link between the explosion described by Trump and the explosion described by the eyewitnesses in northwest Venezuela.The apparent attack follows months of U.S. military pressure, including dozens of strikes on boats in international waters. The White House has claimed that the boats carried drugs, though officials have not provided evidence.In the short phone interview on Friday, Trump responded to a comment about Venezuela by touting the administration’s attacks on alleged drug boats before referring to a strike on a “big plant or big facility” that he said took place two nights earlier.When pressed about the attack on Monday during a press availability at Mar-a-Lago, Trump said it was a “major explosion” in a dock area along Venezuela’s shoreline where boats were loaded with drugs.VenezuelaDec 29Trump says U.S. ‘hit' facility along shore where alleged drug boats ‘load up'Trump administrationDec 22Trump warns Maduro against playing ‘tough' as U.S. escalates pressure on VenezuelaThe CIA has declined to comment on reports that the spy agency conducted a drone strike last week at a port facility in Venezuela. The White House has also declined to comment beyond the president’s remarks on anything related to possible land strikes in Venezuela. Ana, one of the witnesses who did not want her last name used for fear of reprisals, told NBC News by phone that the explosion she witnessed happened on the afternoon of Dec. 18, a few days after she heard a strange noise that she guessed might be a drone surveilling the area. She said she was fishing for dinner along with relatives when the explosion destroyed the hut. “I’ve never seen anything like it,” Ana said, noting that the explosion was so loud she and her relatives were unable to hear for hours. She suspects that some of her relatives suffered hearing damage and said that her family’s boat was destroyed along with their fishing nets.“We are humble people who fish to survive,” she said. “We need help to recover what we lost.”The other witness, who is also a member of the Wayuu indigenous community and did not want to provide his full name for fear of reprisals, corroborated Ana’s story in a telephone interview with NBC News.“I don’t know if it was a missile or a rocket. The truth is, we don’t know what it was,” the second witness said. “But it was a big explosion.”According to Ana, representatives from the Venezuelan government showed up the morning after she heard the blast — on Dec. 19 around 10 a.m. She said local residents asked them for help, for a doctor to check on the hearing problems and for new fishing nets and hammocks, which had also been blown up.Ana said one of government representatives blamed the U.S. and said: “The gringos did this.”NBC News reached out to the Venezuelan government for comment and did not immediately receive a response. It is not clear who was responsible for the Dec. 18 explosion.“We are grateful to be alive,” Ana said. “But we’re scared.”On Monday, Trump declined to answer when asked whether it was the military or the CIA that had conducted the strike inside Venezuela that he described last week. “I don’t want to say that,” he said. “I know exactly who it was, but I don’t want to say who it was. But you know, it was along the shore.”With details so scarce, the president’s comments have touched off a wave of speculation inside Venezuela about the U.S.’s target. For days, local news reports and videos on social media have circulated of a Dec. 24 explosion in Maracaibo, a major port city.Primazol, a chemical production company, said that one of its warehouses had caught fire. In a later statement, it “categorically rejected” rumors on social media that the fire was connected to any U.S. strike.Trump administration2 hours agoTrump admin halting federal child care payments to Minnesota after viral fraud claimsKennedy Center15 hours agoMore musicians cancel Kennedy Center concerts after board votes to add Trump's name to the buildingChina13 hours agoChina fires a warning to the U.S. and simulates Taiwan blockade; Trump says he's ‘not worried'Megan Lebowitz contributed.",
    "source": "Nbc 5 Dallas",
    "publishedAt": "2025-12-30 20:09:57",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.nbcdfw.com/news/national-international/eyewitnesses-mysterious-explosion-northwest-venezuela/3962449/"
  },
  {
    "title": "More than 28,000 vehicles may be towed in Milwaukee starting Jan. 1. Here's why",
    "description": "Jan. 1 is the first day vehicles that received a letter from the City of Milwaukee about five or more unpaid parking citations within 60 days may be towed.",
    "source": "Yahoo! News",
    "publishedAt": "2025-12-30 20:09:57",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.yahoo.com/news/articles/more-28-000-vehicles-may-200957941.html"
  },
  {
    "title": "Cowboys release All-Pro cornerback following multiple injury-plagued seasons: reports",
    "description": "The Dallas Cowboys reportedly released All-Pro cornerback Trevon Diggs on Tuesday after a few injury-plagued seasons following his massive $97 million contract extension.",
    "source": "Fox News",
    "publishedAt": "2025-12-30 20:09:55",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.foxnews.com/sports/cowboys-release-all-pro-cornerback-multiple-injury-plagued-seasons"
  },
  {
    "title": "Why Spain's New Combat Trainer Isn't What Many Expected",
    "description": "Spain looks to diversify its defense suppliers with a bold move in the skies.",
    "source": "Simple Flying",
    "publishedAt": "2025-12-30 20:09:45",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://simpleflying.com/spain-new-combat-trainer-not-what-many-expected/"
  }
]