[
  {
    "title": "‘Friction Is Natural, But Ties Must Stay On Track’: Xi Jinping Urges Trump For China-US Partnership",
    "description": "Chinese President Xi Jinping met his American counterpart Donald Trump in South Korea on Thursday, marking their first meeting in six years. During the talks, Xi emphasised that Beijing and Washington must remain partners and friends, acknowledging that differences were “natural” but urging both nations to stay on the “right course.”“It is natural to have friction,” Xi said, adding, “China and the US can jointly shoulder our responsibility as major countries and work together to accomplish more great and concrete things for the good of our two countries and the whole world.”He also expressed appreciation for Trump’s efforts to promote peace in ongoing global conflicts, reiterating China’s willingness to continue working with the United States.Trump Praises Xi, Hails Prospects For Strong TiesIn response, President Trump described Xi as “a great leader of a great country,” adding, “I think we're going to have a fantastic relationship for a long period of time, and it's an honour to have you with us.”The two leaders met at an air base in the southern port city of Busan, with the encounter taking place on the sidelines of the Asia-Pacific Economic Cooperation (APEC) summit. This was also the first meeting since Trump’s return to office in January this year.As the two leaders shook hands, Trump remarked, “We are going to have a very successful meeting, I have no doubt. But he is a very tough negotiator.”Trade War Back In FocusThe meeting came against the backdrop of renewed US-China trade tensions, which have persisted since 2018. The dispute reignited earlier this month after China proposed expanding curbs on exports of rare-earth minerals, a key component for high-tech manufacturing where Beijing holds global dominance.In response, Trump announced plans to impose additional 100 per cent tariffs on Chinese goods and hinted at further restrictions on exports involving US software - a move that analysts warned could severely disrupt the global economy.Signs Of De-EscalationFollowing urgent negotiations between senior officials, US Treasury Secretary Scott Bessent indicated that Beijing might delay the rare-earth export restrictions for a year and resume purchases of US soybeans, a vital export for American farmers.Just ahead of the APEC Summit, Reuters reported that China had bought its first cargoes of US soybeans in several months, signalling tentative progress towards easing trade tensions.",
    "source": "Abp News",
    "publishedAt": "2025-10-30 04:48:53",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://news.abplive.com/news/world/xi-jinping-donald-trump-china-us-relationships-tariffs-trade-tensions-1808762"
  },
  {
    "title": "Euro zone growth beats forecasts as France outperforms",
    "description": "The euro zone economy grew quicker than expected last quarter as buoyant consumption offset faltering exports and persistent struggles in Germanys oversized industrial sector fresh data from Eurostat showed on Thursday",
    "source": "Devdiscourse",
    "publishedAt": "2025-10-30 04:48:35",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.devdiscourse.com/article/business/3678607-euro-zone-growth-beats-forecasts-as-france-outperforms"
  },
  {
    "title": "Marcos leaves for APEC meet in South Korea",
    "description": "MANILA, Philippines — President Ferdinand Marcos Jr. on Thursday departed for South Korea to participate in the 32nd Asia-Pacific Economic Cooperation (APEC) Economic Leaders’ Meeting, where he will promote the Philippines’ economic and regional cooperation agenda.Marcos left Villamor Air Base in Pasay City on board the presidential plane with First Lady Liza Araneta-Marcos for the summit scheduled from Oct. 30 to Nov. 2 in Gyeongju, South Korea.In his departure speech, Marcos said the APEC was imperative as it would be a platform for various meetings to discuss several pressing matters such as economy, climate, and trade.The President said he would deliver a special speech at the APEC CEO summit, where he intended to showcase the Philippines' fostering of economic growth.\"We will forge deeper ties around our shared goals and objectives, including fostering AI-driven innovation, enhancing cultural and creative industries, and proactively addressing demographic challenges,\" Marcos said.\"This collective resolve will ensure that our development efforts align with regional progress, laying the groundwork for a future where the power of creativity, technology, and sustainability benefits every Filipino,\" he added.On the sidelines of the APEC summit, Marcos will meet with Korean businessmen and invite investors to the Philippines.Marcos said he would closely monitor the outcome of the meeting between US President Donald Trump and Chinese President Xi Jinping at the APEC since it would \"color\" and \"influence\" all the arrangements in the international forum.",
    "source": "The Manila Times",
    "publishedAt": "2025-10-30 04:48:12",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.manilatimes.net/2025/10/30/news/marcos-leaves-for-apec-meet-in-south-korea/2211780"
  },
  {
    "title": "Giving stalling car industry a break on petrol-engine ban could be a mistake",
    "description": "Short-term relief for carmakers unlikely to enable them catch China in electric-vehicle race",
    "source": "The Irish Times",
    "publishedAt": "2025-10-30 04:48:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.irishtimes.com/world/europe/2025/10/30/giving-stalling-car-industry-a-break-on-petrol-engine-ban-could-be-a-mistake/"
  },
  {
    "title": "Labor Slashes Regional Funding Again",
    "description": "The Allan Labor Government continues to slash grants to support jobs and community infrastructure in regional Victoria. The Regional Development",
    "source": "The National Tribune",
    "publishedAt": "2025-10-30 04:47:44",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.nationaltribune.com.au/labor-slashes-regional-funding-again/"
  },
  {
    "title": "Trump, Xi talks wrap up with outcome unclear",
    "description": "Crunch talks between U.S. President Donald Trump and China's Xi Jinping focused on their trade war wrapped up in under two hours Thursday with no immediate public comment from either leader on whether progress was made. Trump headed straight to Air Force One in Busan, South Korea after the first face-to-face meeting in six years with Xi, waving and pumping his first as he boarded the plane. The jet took off minutes later. Xi was seen boarding his limousine outside the closed-door meeting, which lasted around an hour and 40 minutes. Ahead of the talks, Trump complimented a smiling Xi as a \"very tough negotiator\" as they shook hands. Minutes before they met the U.S. leader said he has ordered the Pentagon to start nuclear weapons testing on a level with China and Russia. \"We'll have a great understanding,\" Trump said, predicting a \"fantastic relationship for a long period of time\". Xi acknowledged before the meeting began in earnest that both sides did not always see eye to eye, but should strive to be \"partners and friends\". \"China and the U.S. can jointly shoulder our responsibility as majo",
    "source": "The Korea Times",
    "publishedAt": "2025-10-30 04:47:02",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.koreatimes.co.kr/world/20251030/trump-xi-talks-wrap-up-with-outcome-unclear"
  },
  {
    "title": "JetBlue’s Premium Travel Surge: A Boost for U.S. Tourism and Luxury Air Travel",
    "description": "JetBlue’s Premium Travel Surge: A Boost for U.S. Tourism and Luxury Air TravelJetBlue sees strong demand for premium seats and smaller-than-expected losses in Q3 2025, signaling recovery and growth in air travel demand.The post JetBlue’s Premium Travel Surge: A Boost for U.S. Tourism and Luxury Air Travel appeared first on Travel And Tour World.",
    "source": "Travel And Tour World",
    "publishedAt": "2025-10-30 04:45:49",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.travelandtourworld.com/news/article/jetblues-premium-travel-surge-a-boost-for-u-s-tourism-and-luxury-air-travel/"
  },
  {
    "title": "4 Top Crypto Projects Right Now: BlockDAG, Avalanche, Hyperliquid & Cardano!",
    "description": "While short-term volatility often drives daily price changes, the more strategic focus now lies in finding top crypto projects capable of lasting growth across multiple market cycles. Notable contenders include BlockDAG (BDAG)http://blockdag.network , Avalanche (AVAX), Hyperliquid (HYPE), and Cardano (ADA).",
    "source": "Openpr.com",
    "publishedAt": "2025-10-30 04:45:40",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.openpr.com/news/4246022/4-top-crypto-projects-right-now-blockdag-avalanche"
  },
  {
    "title": "Ziina Debuts First Digital Card With Visa To Turn Payments Into Instant Spending Power",
    "description": "(MENAFN - Mid-East Info) Already one of the UAE's simplest ways for businesses to get paid, Ziina now extends into expense management-becoming the only licensed startup to offer both acquiring and ...",
    "source": "Menafn",
    "publishedAt": "2025-10-30 04:45:36",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://menafn.com/1110269221/Ziina-Debuts-First-Digital-Card-With-Visa-To-Turn-Payments-Into-Instant-Spending-Power"
  },
  {
    "title": "Instant View: Market analysts react to Trump-Xi meeting",
    "description": "President Donald Trump held talks with China's Xi Jinping at a South Korean air base on Thursday, with both leaders sounding optimistic about cooling trade tensions between the world's two largest economies. Market reaction was fairly muted as investors awaited further details of any agreement with Chinese stocks holding steady near a 10-year peak.",
    "source": "Yahoo! News",
    "publishedAt": "2025-10-30 04:45:18",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://ca.finance.yahoo.com/news/instant-view-market-analysts-react-044518348.html"
  }
]