[
  {
    "title": "US reportedly used Anthropic's AI model Claude in Maduro capture",
    "description": "The U.S. military is said to have used widely popular Anthropic's AI model Claude during the operation to capture Venezuelan President Nicolas Maduro, The Wall Street Journal...",
    "source": "Daily Sabah",
    "publishedAt": "2026-02-15 08:07:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.dailysabah.com/business/tech/us-reportedly-used-anthropics-ai-model-claude-in-maduro-capture"
  },
  {
    "title": "🗞️Today's front pages: Madrid win hearts while Barça lose patience",
    "description": "The victory of the white team against Real Sociedad and Barcelona's formal complaint against the referees dominate the press this Sunday.Vinicius, with his penalty double against Real Sociedad, is the...",
    "source": "Yahoo! News",
    "publishedAt": "2026-02-15 08:07:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://ca.sports.yahoo.com/news/todays-front-pages-madrid-win-080700809.html"
  },
  {
    "title": "What is cereulide-linked infant formula recall? #food",
    "description": "Reports and legal action over cereulide linked infant formula concerns Health authorities and families in multiple countries are grappling with the fallout of an infant formula recall tied to the cereulide toxin. In the United Kingdom, more than 30 clinical reports involved children who displayed...",
    "source": "Biztoc",
    "publishedAt": "2026-02-15 08:06:58",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://alltoc.com/food/what-is-cereulide-linked-infant-formula-recall"
  },
  {
    "title": "Which retailers have Le Creuset and Staub on sale? #food",
    "description": "Where to find Presidents’ Day cookware discounts Major retailers are running Presidents’ Day cookware promotions that include high profile brands such as Le Creuset and Staub. Williams Sonoma highlighted a holiday sale featuring top kitchen names, while Amazon’s Presidents’ Day event specifically...",
    "source": "Biztoc",
    "publishedAt": "2026-02-15 08:06:58",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://alltoc.com/food/which-retailers-have-le-creuset-and-staub-on-sale"
  },
  {
    "title": "Why did Brazil recall Alfamino infant formula? #food",
    "description": "Brazil pulls Alfamino over elevated mineral levels Brazil’s health regulator, Anvisa, ordered a recall of an Alfamino branded infant formula made by Nestlé after tests found elevated levels of certain minerals. Regulators cited concentrations of iodine and selenium above the levels they expect in...",
    "source": "Biztoc",
    "publishedAt": "2026-02-15 08:06:58",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://alltoc.com/food/why-did-brazil-recall-alfamino-infant-formula"
  },
  {
    "title": "Indian Navy rescues critically-ill Japanese national",
    "description": "Jammu: The Indian Navy acted swiftly in an operation on Saturday to save a critically-ill Japanese national's life who was on board a ship at...",
    "source": "Timesofoman",
    "publishedAt": "2026-02-15 08:06:58",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://timesofoman.com//article/168303-indian-navy-rescues-critically-ill-japanese-national"
  },
  {
    "title": "Ingersoll Rand Q4 Earnings Call Highlights",
    "description": "Ingersoll Rand (NYSE:IR) executives said the company exited 2025 with improving organic momentum, continued progress in recurring revenue, and an active acquisition pipeline as management introduced full-year 2026 guidance that assumes stability rather than a broad-based market recovery. 2025 finish: modest organic orders growth and a return to organic revenue growth Chairman and CEO Vicente [...]",
    "source": "Defenseworld Net",
    "publishedAt": "2026-02-15 08:06:57",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.defenseworld.net/2026/02/15/ingersoll-rand-q4-earnings-call-highlights.html"
  },
  {
    "title": "Chorus Aviation Q4 Earnings Call Highlights",
    "description": "Chorus Aviation (TSE:CHR) executives highlighted a year of significant portfolio activity, capital returns, and improved adjusted earnings during the company’s fourth-quarter and full-year 2025 results call held February 13, 2026. Management also outlined an updated capital allocation framework and provided consolidated guidance for 2026. Management emphasizes a “pivotal” 2025 President and CEO Colin Copp said [...]",
    "source": "Defenseworld Net",
    "publishedAt": "2026-02-15 08:06:57",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.defenseworld.net/2026/02/15/chorus-aviation-q4-earnings-call-highlights.html"
  },
  {
    "title": "Equillium Conference: EQ504 Targets Ulcerative Colitis Ahead of Mid-Year Phase 1 Start",
    "description": "Executives from Equillium (NASDAQ:EQ) outlined the scientific rationale and near-term development plans for its lead program, EQ504, during a recent fireside chat focused on immunology and inflammatory bowel disease (IBD). Positioning EQ504 in ulcerative colitis Company representatives described ulcerative colitis as a disease driven by three intertwined factors: immune dysregulation, impaired barrier function, and reduced [...]",
    "source": "Defenseworld Net",
    "publishedAt": "2026-02-15 08:06:57",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.defenseworld.net/2026/02/15/equillium-conference-eq504-targets-ulcerative-colitis-ahead-of-mid-year-phase-1-start.html"
  },
  {
    "title": "Magna International Q4 Earnings Call Highlights",
    "description": "Magna International (NYSE:MGA) executives highlighted margin expansion, strong cash generation, and an active capital return plan while outlining a 2026 outlook that assumes a relatively flat light-vehicle production environment. On the company’s fourth-quarter and full-year 2025 results call, CEO Swamy Kotagiri said results reflected the “resilience of our business model” and continued traction from operational [...]",
    "source": "Defenseworld Net",
    "publishedAt": "2026-02-15 08:06:57",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.defenseworld.net/2026/02/15/magna-international-q4-earnings-call-highlights.html"
  }
]