[
  {
    "title": "Students tell stories of resilience and loss through USC Annenberg Wildfire Youth Media Initiative",
    "description": "STORY, PHOTOS and VIDEOS: High schoolers living in the regions affected by the Eaton and Pacific Palisades wildfires learn the skills to capture their communities’ stories.",
    "source": "University Of Southern California",
    "publishedAt": "2026-01-16 08:06:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://today.usc.edu/students-tell-stories-of-resilience-and-loss-through-usc-annenberg-wildfire-youth-media-initiative/"
  },
  {
    "title": "INCHEON-IFEZ Booth Wraps Up a Successful CES 2026, Recording $560M in Export Consultations and 17 Innovation Awards",
    "description": "Over 15,000 visitors to the INCHEON–IFEZ Booth; IFEZ supported a record 50 innovation companies participating in CES 2026.",
    "source": "Wv News",
    "publishedAt": "2026-01-16 08:06:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.wvnews.com/news/around_the_web/partners/pr_newswire/subject/trade_policy/incheon-ifez-booth-wraps-up-a-successful-ces-2026-recording-560m-in-export-consultations-and/article_63ccc843-feea-5800-87ad-524644ba01b2.html"
  },
  {
    "title": "INCHEON-IFEZ Booth Wraps Up a Successful CES 2026, Recording $560M in Export Consultations and 17 Innovation Awards",
    "description": "Over 15,000 visitors to the INCHEON–IFEZ Booth; IFEZ supported a record 50 innovation companies participating in CES 2026. Participating companies secure a foundation for global expansion, including 20 MoU signings. INCHEON, South Korea, Jan. 16, 2026 /PRNewswire/ -- The Incheon Free...",
    "source": "Pr Newswire",
    "publishedAt": "2026-01-16 08:06:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.prnewswire.com/news-releases/incheonifez-booth-wraps-up-a-successful-ces-2026-recording-560m-in-export-consultations-and-17-innovation-awards-302663261.html"
  },
  {
    "title": "Göbeklitepe inspires contemporary Kazakh art in Astana exhibition",
    "description": "Göbeklitepe, the 12,000-year-old archaeological site in Şanlıurfa, Türkiye, often called the “zero point of history,” has inspired a new generation of Kazakh contemporary artists....",
    "source": "Daily Sabah",
    "publishedAt": "2026-01-16 08:06:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.dailysabah.com/arts/gobeklitepe-inspires-contemporary-kazakh-art-in-astana-exhibition/news"
  },
  {
    "title": "Hydrogen breakthroughs, precious metals demand, Africa’s value chain moment",
    "description": "Mining Weekly Editor Martin Creamer discusses the significant new platinum-linked green hydrogen advances in the UAE and US; the demand for precious metals as fiat currency alternatives; and Africa’s fragmented mineral belts that must be turned into coherent regional value chains.",
    "source": "Australasia Global Mining News",
    "publishedAt": "2026-01-16 08:06:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.miningweekly.com/article/hydrogen-breakthroughs-precious-metals-demand-africas-value-chain-moment-2026-01-16"
  },
  {
    "title": "Attack on Hindus in Bangladesh: School teacher Birendra Kumar Dey's house set on fire in Sylhet district, video circulates on social media, watch",
    "description": "In another incident of attacks on Hindu, which are in minoriy in Bangladesh, a house of a Hindu teacher was set ablaze in Gowainghat upazila of Sylhet district. The incident took place at the house of a school teacher, Birendra Kumar Dey.",
    "source": "Dna",
    "publishedAt": "2026-01-16 08:06:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.dnaindia.com/world/report-attack-on-hindus-in-bangladesh-school-teacher-birendra-kumar-dey-s-house-set-on-fire-in-sylhet-district-video-circulates-on-social-media-watch-3197259"
  },
  {
    "title": "The Best Trillion-Dollar Stock to Buy in January 2026, According to Wall Street (Hint: Not Tesla)",
    "description": "Nvidia is likely to retain its status as the gold standard in AI infrastructure for many years to come.",
    "source": "Fool",
    "publishedAt": "2026-01-16 08:06:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.fool.com/investing/2026/01/16/best-trillion-dollar-stock-buy-wall-street-tesla/"
  },
  {
    "title": "South Carolina knocks off fourth-ranked Texas",
    "description": "South Carolina women’s basketball got its revenge on Thursday night.",
    "source": "The Times And Democrat",
    "publishedAt": "2026-01-16 08:06:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://thetandd.com/article_2d3c268d-7ca8-4d9c-8c36-eee8a917e78c.html"
  },
  {
    "title": "Alcaraz, Sinner, Swiatek set sights on career Grand Slam",
    "description": "Carlos Alcaraz knows what matters the most to him in 2026 and isn't shy about telling the world: He wants to win the Australian Open to complete a career Grand Slam.",
    "source": "Winston-salem Journal",
    "publishedAt": "2026-01-16 08:06:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://journalnow.com/article_3c3f3d81-4b49-523f-be13-38d187948a38.html"
  },
  {
    "title": "INCHEON-IFEZ Booth Wraps Up a Successful CES 2026, Recording $560M in Export Consultations and 17 Innovation Awards",
    "description": "Over 15,000 visitors to the INCHEON–IFEZ Booth; IFEZ supported a record 50 innovation companies participating in CES 2026.Participating companies secure a foundation for global expansion, including 20 MoU signings. INCHEON, South Korea, Jan. 16, 2026 /PRNewswire/ -- The Incheon Free Economic Zone (IFEZ) announced the successful operation of the INCHEON–IFEZ Booth at CES 2026, presenting IFEZ's future-city vision and the technologies of Incheon-based innovators to a global audience. CES 2026 INCHEON–IFEZ Booth Under the theme \"Destination Incheon — From Smart City to AI City,\" the booth highlighted a sustainable urban future enabled by Incheon companies' innovations and drew more than 15,000 visitors, according to IFEZ. During CES 2026, IFEZ also met with the Fairfax County Economic Development Authority (FCEDA) to discuss support measures and collaboration models for helping Incheon startups enter the U.S. market. The two sides plan to develop practical joint programs through continued cooperation. IFEZ supported a record 50 companies at CES 2026 across multiple participation tracks, dividing them across various exhibition areas: 10 companies in the 'INCHEON-IFEZ' Booth at the Las Vegas Convention Center, 10 in the Korea pavilion (KOTRA) at the Eureka Park, 6 in the Global Pavilion, and 15 as the Incheon Startup Park Delegation and 10 Innovation Award showcase participants. These companies achieved record-breaking results, conducting 1,419 business consultations with overseas buyers and investors, with the estimated value of export consultations reaching $560 million—more than 400 additional meetings compared to last year. In addition, nine companies signed 20 MOUs, building momentum for global expansion and investment opportunities. Leadpoint System, a smart manufacturing and industrial automation solutions provider, signed an MOU with Webtronic Labs, a U.S.-based technology R&D company. emCT, which specializes in fire detection and safety management solutions, signed an MOU with Texas Legacy Realty, a Texas-based real estate development and operations company, to pursue collaboration on applying fire safety and \"safe zone\" solutions in commercial and residential buildings. Medicell Healthcare, a regenerative medicine and bio-healthcare solutions company, signed an MOU with the City of Phoenix, Arizona's largest city, and discussed cooperation on technology collaboration and local proof-of-concept initiatives in public healthcare. IFEZ said 14 supported companies earned 17 CES Innovation Awards, the highest total to date for Incheon, drawing strong interest from global buyers and investors. Deep Fusion AI received a Best of Innovation honor for its radar-based sensor-fusion AI technology, gaining attention in next-generation autonomous driving and robotic perception. Mayor Yoo Jeong-bok said the CES participation advanced the Incheon–IFEZ AI City vision on the global stage and pledged continued support to expand Incheon companies' international reach and strengthen Incheon as a global business hub.",
    "source": "Pr Newswire Apac",
    "publishedAt": "2026-01-16 08:06:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://en.prnasia.com/story/519319-0.shtml"
  }
]