[
  {
    "title": "Trivial Pursuit rule people don't know could mean you're cheating this Christmas",
    "description": "Trivial Pursuit has been a family favourite for over 40 years, but it turns out that many people have been playing the game wrong - and it could mean you're cheating",
    "source": "Wales Online",
    "publishedAt": "2025-12-24 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.walesonline.co.uk/lifestyle/trivial-pursuit-rule-people-dont-32866578"
  },
  {
    "title": "‘Precarious’ is Wall Street’s defining word for 2026",
    "description": "Labor market softness, recession fears, AI bubbles and Fed questions are all top of mind as Wall Street heads into 2026.",
    "source": "Fortune",
    "publishedAt": "2025-12-24 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://fortune.com/2025/12/24/precarious-is-wall-streets-defining-word-for-2026/"
  },
  {
    "title": "Azimut agrees to sell its interest in the Galinée Property to LiFT Power, James Bay Region, Quebec",
    "description": "LONGUEUIL, Quebec, Dec. 24, 2025 (GLOBE NEWSWIRE) -- Azimut Exploration Inc. (“Azimut” or the “Company”) (TSXV: AZM) (OTCQX: AZMTF) announces the signing of an acquisition agreement (the “Agreement”) with LiFT Power Ltd. (“LiFT”) (TSXV: LIFT, OTCQX: LIFFF) to sell its 50% interest in the Galinée Property (the “Property”) located in the Eeyou Istchee James Bay region of Quebec. This transaction was initially disclosed on December 15, 2025, in conjunction with LiFT’s announcement of its proposed acquisition of Winsome Resources Ltd. (“Winsome”), the owner of the adjacent development-stage Adina property (see Figures 1 and 2).",
    "source": "Globenewswire_fr",
    "publishedAt": "2025-12-24 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.globenewswire.com/fr/news-release/2025/12/24/3210255/0/en/Azimut-agrees-to-sell-its-interest-in-the-Galin%C3%A9e-Property-to-LiFT-Power-James-Bay-Region-Quebec.html"
  },
  {
    "title": "'There was one phone call to be made:' Hunter back to lead Canada at world juniors",
    "description": "Alan Millar and Scott Salmond were sifting through the wreckage. Canada had endured a second straight quarterfinal exit at the world junior hockey championship — this time on home soil. The battered and bruised men's under-20 program desperately needed a reset. Millar was promoted to a new role as the team's full-time general manager. There would be more structural change within Hockey Canada's approach to follow. Millar and Salmond, the organization's senior vice-president of high performance and hockey operations, knew the next step was finding the right person to lead. There was one phone call to be made, Millar recalled. And that was to London. Dale Hunter, who has built a powerhouse with the Ontario Hockey League's London Knights, is back as head coach at the world juniors — after leading Canada to the top of the podium in 2020 — for a country desperate to rebound. They've built one of the best programs in the Canadian Hockey League, Millar said of Hunter and younger brother Mark, who is also part of Canada's management group for the tournament. Their success speaks for itself. We felt with the results the last couple years, and to get this thing back on track, Dale needed to be the guy. The Hunters have won the Memorial Cup three times, captured six OHL titles and graduated a boatload of players to the professional ranks.So what has led to their championship and talent-developing pedigree?Really great hockey minds, said St. Louis Blues centre Robert Thomas, who played three seasons with the Knights. They care about their players and want to see them grow. They won't put them in a position to fail. They'll always be really patient and make sure everything progresses nicely before they put them in those big positions. That's something that I really learned — you've got to be patient and continue to work. Calgary Flames forward Nazem Kadri spent two seasons with the Knights. Great influence on my early career, he said of the Hunters. Tremendous knowledge. They've been there and they've done that from both ends of the spectrum. Mark with a Stanley Cup (as a player for Calgary in 1989) and Dale with a ton of games (1,407 regular-season NHL games played). The list of current NHLers to come through London under the Hunters also includes Mitch Marner, Matthew Tkachuk, Patrick Kane, Max Domi, Corey Perry and Christian Dvorak. The operation they have going there is incredible, said Kane, now a winger with the Detroit Red Wings. Never ceases to amaze. Thomas said Dale Hunter's ability to handle young talent with varying needs helps get his message across. Just how genuine he is, Thomas said. Whether it's talking about skills, watching video: 'This is how hard you have to work.' A lot of players can really credit a lot of their success to how he handled them in junior. Domi said Dale Hunter treats the Knights like a miniature NHL club. Short shifts, it takes everyone, team mindset, said Domi, a forward with the Toronto Maple Leafs who played four seasons in London. All that good stuff maybe gets lost in some of the minor and junior hockey conversations with coaches and players, but he treated us like pros down there. That's why guys are so prepared when they jump to the next level. Canadian forward Porter Martone, one of the returnees from last year's disappointment at the world juniors, faced the Knights during his OHL career and is looking forward to playing for Dale Hunter. Brilliant hockey mind, Martone said. You've seen what he's done with London, you see the players he's developed, see the championships he's won. Every time he speaks, you're listening, because he knows best. The veteran coach said his requirements are straightforward. I'm not a yeller or screamer, but they know that I demand a certain way to play, Dale Hunter said. When they go (to the NHL), it's not the offensive side that's the issue. I try to teach them defence and that this is the pro way, this is what you have to do.I try to prepare them. Now it's about getting his country prepared and back where Canada feels it belongs — atop the world junior podium. Winning ... that's literally all that matters, Domi said of the Hunter creed. Everything else fits into place when you're just focused on winning. That's all they care about, it's all they talk about, it's all they expect And nothing else matters.-With files from Donna Spencer in Calgary This report by The Canadian Press was first published Dec. 24, 2025",
    "source": "Kamloops This Week",
    "publishedAt": "2025-12-24 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.castanetkamloops.net/news/Sports/591035/There-was-one-phone-call-to-be-made-Hunter-back-to-lead-Canada-at-world-juniors"
  },
  {
    "title": "Azimut agrees to sell its interest in the Galinée Property to LiFT Power, James Bay Region, Quebec",
    "description": "LONGUEUIL, Quebec, Dec. 24, 2025 (GLOBE NEWSWIRE) — Azimut Exploration Inc. (“Azimut” or the “Company”) (TSXV: AZM) (OTCQX: AZMTF) announces the signing of an acquisition agreement (the “Agreement”) with LiFT Power Ltd. (“LiFT”) (TSXV: LIFT, OTCQX: LIFFF) to sell its 50% interest in the Galinée Property (the “Property”) located in the Eeyou Istchee James Bay [...]",
    "source": "Cbj Ca News",
    "publishedAt": "2025-12-24 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.cbj.ca/azimut-agrees-to-sell-its-interest-in-the-galinee-property-to-lift-power-james-bay-region-quebec/"
  },
  {
    "title": "'There was one phone call to be made:' Hunter back to lead Canada at world juniors (Sports)",
    "description": "Alan Millar and Scott Salmond were sifting through the wreckage. Canada had endured a second straight quarterfinal exit at the world junior hockey championship - this time on home soil. The battered and bruised men's under-20 program desperately needed a reset. Millar was promoted to a new role as t...",
    "source": "Castanet",
    "publishedAt": "2025-12-24 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.castanet.net/news/Sports/591035/There-was-one-phone-call-to-be-made-Hunter-back-to-lead-Canada-at-world-juniors"
  },
  {
    "title": "Mary Louise Nichols",
    "description": "August 14, 1948 December 5, 2025 Mary Louise Nichols (nee Mary Louise Assel, age 77 passed away peacefully on December 5, 2025. She was born on August 14, 1948 in Chico, CA to her parents Albert and Gloria Assell and attended schools in Chico, graduating from Chico Senior High School in 1966. Mary married her [...]",
    "source": "Chicoer",
    "publishedAt": "2025-12-24 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.chicoer.com/obituaries/mary-louise-nichols/"
  },
  {
    "title": "Azimut agrees to sell its interest in the Galinée Property to LiFT Power, James Bay Region, Quebec",
    "description": "LONGUEUIL, Quebec, Dec. 24, 2025 (GLOBE NEWSWIRE) -- Azimut Exploration Inc. (\"Azimut\" or the \"Company\") (TSXV:AZM) (OTCQX:AZMTF) announces the signing of an acquisition agreement (the \"Agreement\") with LiFT Power Ltd. (\"LiFT\") (TSXV:LIFT, OTCQX:LIFFF) to sell its 50% interest in the Galinée Property (the \"Property\") located in the Eeyou Istchee James Bay region of Quebec. This transaction was initially disclosed on December 15, 2025, in conjunction with LiFT's announcement of its proposed acquisition of Winsome Resources Ltd. (\"Winsome\"), the owner of the adjacent development-stage Adina property (see Figures 1 and 2).Under the Agreement, LiFT agreed to acquire Azimut's interest in the Property by issuing 2,000,000 common shares. Azimut will retain a 1.4% NSR royalty on the Property. In addition, Azimut will be entitled to a $1,500,000 deferred payment, payable in cash, or, subject to certain terms and conditions set out in the Agreement, in common shares of LiFT, at the earlier of 18 months or the public disclosure of a technical report with respect to the Property that includes an economic analysis of one or more development scenarios. Based on the closing price of LiFT's common shares on the TSX Venture Exchange (the \"TSXV\") on December 23, 2025, the consideration receivable by Azimut in connection with this transaction amounts to approximately $10,300,000.This transaction supports the Company's strategy to focus on its high-potential flagship assets while maintaining exposure to the strengthened Galinée-Adina project through an equity stake in LiFT and a retained royalty interest. Azimut is well-positioned to advance its Wabamisk and Elmer projects in 2026, backed by a strong balance sheet which includes a substantial equity investment portfolio. The Company will provide an exploration strategy update in early 2026 once it has received the results from the programs completed in late 2025.The parties are dealing at arm's length. The Agreement is subject to customary closing conditions for a transaction of this nature, including approval ...Full story available on Benzinga.com",
    "source": "Benzinga",
    "publishedAt": "2025-12-24 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.benzinga.com/pressreleases/25/12/g49579226/azimut-agrees-to-sell-its-interest-in-the-galin-e-property-to-lift-power-james-bay-region-quebec"
  },
  {
    "title": "British man faces deportation from Australia after visa cancelled over alleged Nazi symbols",
    "description": "A British national is facing deportation from Australia after his visa was cancelled for allegedly displaying Nazi symbols.",
    "source": "Skynew",
    "publishedAt": "2025-12-24 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://news.sky.com/story/british-man-faces-deportation-from-australia-after-visa-cancelled-over-alleged-nazi-symbols-13487211"
  },
  {
    "title": "Li-FT Power Signs Definitive Project Acquisition Agreement with Azimut",
    "description": "VANCOUVER, British Columbia, Dec. 24, 2025 (GLOBE NEWSWIRE) -- Li-FT Power Ltd. (“Li-FT”) (TSXV: LIFT) (OTCQX: LIFFF) (Frankfurt: WS0) is pleased to announce, further to its December 14, 2025 press release regarding Li-FT entering into a binding scheme implementation deed with Winsome Resources Ltd. (“Winsome”) and non-binding letter of intent with Azimut Exploration Inc. (“Azimut”) (TSXV: AZM) (OTCQX: AZMTF) and SOQUEM Inc., that it has entered into a definitive project acquisition agreement with Azimut to acquire Azimut’s interest in the exclusive exploration rights commonly known as the Galinée property (“Galinée Property”), representing 50% of the total interest in the Galinée Property (the \"Galinée Transaction\"), subject to the satisfaction of various conditions.",
    "source": "Globe Newswire",
    "publishedAt": "2025-12-24 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.globenewswire.com/news-release/2025/12/24/3210254/0/en/Li-FT-Power-Signs-Definitive-Project-Acquisition-Agreement-with-Azimut.html"
  }
]