[
  {
    "title": "Netflix just added 29 new shows and movies — here are the 5 I'd start binge-watching now",
    "description": "Netflix just added 29 shows and movies today. Here are the five I'd recommend watching right now.",
    "source": "Tom's Guide",
    "publishedAt": "2025-12-01 08:04:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.tomsguide.com/entertainment/netflix/netflix-just-added-29-new-shows-and-movies-heres-the-5-id-start-watching-now-december-1-2025"
  },
  {
    "title": "Dear Abby: His Christian wife says she’ll divorce him if he doesn’t give up hosting his weekly live podcast",
    "description": "He \"preaches\" atheism as well as other topics. Does her religion get to trump his?",
    "source": "Oregon Local News",
    "publishedAt": "2025-12-01 08:04:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.oregonlive.com/advice/2025/12/dear-abby-his-christian-wife-says-shell-divorce-him-if-he-doesnt-give-up-hosting-his-weekly-live-podcast.html"
  },
  {
    "title": "Trump tariffs hit India’s manufacturing sector! PMI falls to 9-month low in November; but how big is the - Times of India",
    "description": "Trump tariffs hit India’s manufacturing sector! PMI falls to 9-month low in November; but how big is the Times of IndiaIndia’s manufacturing PMI falls to 9-month low in November on softer sales and output Telegraph IndiaIndia's manufacturing sector activity falls to 9-month low in November on softer rise in sales, production: PMI The HinduIndia’s Manufacturing PMI Expands At Above-Trend Rates Amid US Tariffs Zee NewsIndia's factory growth slows to nine-month low as US tariffs dent demand, PMI shows Reuters",
    "source": "Google News",
    "publishedAt": "2025-12-01 08:04:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://news.google.com/rss/articles/CBMinAJBVV95cUxPQWFwTGQ5X2cxZGU2NjhCY3BJc1RrUGZoSV82VXMzbFJvY05xcEpKYVpGSk5NOXdnUjVBdFo5RHhfT0wxdGQtdkJTZWxOb1UydHhLYV9aUmVQbHRsSVRzMEx0aUc4dXcxMEhVQTR5dWw4UHlFRmxsbEFLMWM2VTZlUkFmZUVtUEJZY0JoVUJ2dk1VSHJqVklTU1dCSkVCNzlOTFU2c2J2QVhkbEVzVklaakZWOTdLODVJVlJ6Zzg0Y181LXB2Y3VlZjI1N2d1RWc5VGtqNF9EMjBPSzB3R1RrS1JEYUVqUVVkWW1pLTdVVEdSMTE5cXV2TWc5SXFsNmFxWnhqUlJVVW5yRFVlcEJ6MTZrSDJZdzNMOE82cg?oc=5"
  },
  {
    "title": "Seagate 2TB Xbox Expansion Card Drops To Best Price Ever For Cyber Monday",
    "description": "If you picked up some of the great Xbox game deals in Amazon's Black Friday sale, you should also check out the retailer's Cyber Monday deals on high-capacity Seagate Storage Expansion Cards. The 2TB Seagate Expansion Card is discounted to $184.76 (was $260), and the 4TB model is down to $380 (was $500). These are the lowest prices ever offered by Amazon for either edition.Seagate's Expansion Cards used to be incredibly expensive, but the arrival of the C50 led to price drops.Seagate and Western Digital Xbox Expansion Cards offer the same functionality. You simply insert the proprietary storage card into the expansion slot on the back of your console. Your Xbox will recognize the card and allow you to choose if you want to use internal storage or expansion storage as your primary install location. That's the whole installation process; these truly are plug-and-play storage solutions.Regular external hard drives can store Xbox Series X|S games, but you need to transfer them back to the console's internal drive to actually play them. Xbox Expansion Cards, on the other hand, can store and load games; these nifty accessories act as an extension of your SSD.Xbox and PC players can also save big on official Xbox Wireless Controllers for Cyber Monday. Microsoft's controllers are on sale for as low as $40, and you can even get deals on colorful Special Edition designs. The Xbox Elite Series 2 is also on sale right now; Microsoft's stellar customizable controller is discounted to $140 (was $200).It's not a Cyber Monday deal, but Game Pass subscribers should consider switching to prepaid cards to avoid paying $30/month for Game Pass Ultimate. Prepaid codes from major retailers haven't received price increases yet. You can get three months of Game Pass Ultimate for $57 at Amazon ($19/month). Microsoft lets subscribers stack up to 36 months of prepaid codes.If you also own a Nintendo Switch 2, check out the Cyber Monday deal on the officially licensed Samsung 256GB microSD Express Card before it's gone.",
    "source": "Gamespot",
    "publishedAt": "2025-12-01 08:04:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.gamespot.com/articles/seagate-2tb-xbox-expansion-card-drops-to-best-price-ever-for-cyber-monday/1100-6527818/?ftag=CAD-01-10abi2f"
  },
  {
    "title": "Asking Eric: Family, friends don’t seem to appreciate time I put into tedious Christmas cookie tradition",
    "description": "They spend hours baking and decorating grandma's cookie, pack them, and ship them off. But why?",
    "source": "Oregon Local News",
    "publishedAt": "2025-12-01 08:04:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.oregonlive.com/advice/2025/12/asking-eric-family-friends-dont-seem-to-appreciate-time-i-put-into-tedious-christmas-cookie-tradition.html"
  },
  {
    "title": "Avoiding Jail, Bosnian Serb War Criminal Joins Russia’s Ukraine Invasion",
    "description": "Novak Stjepanovic was sentenced to 13 years in prison in Serbia for war crimes in Bosnia in 1992, but he had already skipped the country to join Russian forces fighting in Ukraine, a BIRN investigation finds.",
    "source": "Balkan Insight",
    "publishedAt": "2025-12-01 08:03:59",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://balkaninsight.com/2025/12/01/avoiding-jail-bosnian-serb-war-criminal-joins-russias-ukraine-invasion/"
  },
  {
    "title": "USC Warriors hold off Jaguars in triple overtime classic",
    "description": "The University of San Carlos (USC) Warriors virtually locked in the No. 4 seed in the Cesafi Season 25 men's basketball playoffs after outlasting the University of San Jose–Recoletos (USJ-R) Jaguars",
    "source": "Cebu Daily News",
    "publishedAt": "2025-12-01 08:03:59",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://cebudailynews.inquirer.net/674760/usc-warriors-hold-off-jaguars-in-triple-overtime-classic"
  },
  {
    "title": "“I am still looking to get better every day...”: Virat Kohli on mindset",
    "description": "Ranchi: Vintage Virat Kohli once again underlined his immense value to India’s ODI setup, smashing a scintillating century to guide the hosts to a 17-run win over South Africa in the opening match of the series in Ranchi. Amid constant chatter surrounding his ODI future in the lead-up to the 2027 World Cup, Kohli delivered [...]The post “I am still looking to get better every day...”: Virat Kohli on mindset appeared first on KalingaTV.",
    "source": "Kalinga Tv",
    "publishedAt": "2025-12-01 08:03:59",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://kalingatv.com/sports/i-am-still-looking-to-get-better-every-day-virat-kohli-on-mindset/"
  },
  {
    "title": "PKU Pioneer Facilitates Steel Mill's Energy Efficiency Upgrade: 30,000Nm3/h PSA Oxygen Project Successfully Completed",
    "description": "Beijing, China–(Newsfile Corp. – December 1, 2025) – Half a year has passed since the upgraded PSA oxygen generation station of Zhuhai Yueyufeng Iron and Steel Co., Ltd. (hereinafter referred to as “Yueyufeng Steel”) was officially put into operation. The optimized PSA oxygen generation plant has continuously provided stable oxygen supply for blast furnace oxygen [...]",
    "source": "The Kingston Whig Standard",
    "publishedAt": "2025-12-01 08:03:58",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.thewhig.com/newsfile/276158-pku-pioneer-facilitates-steel-mills-energy-efficiency-upgrade-30000nm3h-psa-oxygen-project-successfully-completed"
  },
  {
    "title": "People urged to carry out 10-minute task of 'burping your home' 2 times a day",
    "description": "Here's why ensuring your home is ventilated with fresh air, particularly during winter when you may be tempted to keep them shut, is important.",
    "source": "Lancashire Telegraph",
    "publishedAt": "2025-12-01 08:03:58",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.lancashiretelegraph.co.uk/news/25661638.people-urged-open-windows-winter-prevent-mould/"
  }
]