[
  {
    "title": "Garmin releases new update to recent mid-range smartwatches with fresh sleep mode improvement",
    "description": "Garmin has introduced a new update for two of its recent upper mid-range smartwatches. Bundling various improvements like a refined sleep mode experience, Beta Version 15.16 is available to download for free worldwide on the Forerunner 570 and Forerunner 970.",
    "source": "Notebookcheck",
    "publishedAt": "2025-11-01 20:07:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.notebookcheck.net/Garmin-releases-new-update-to-recent-mid-range-smartwatches-with-fresh-sleep-mode-improvement.1153169.0.html"
  },
  {
    "title": "Tinubu to Trump: Nigeria’s constitution protects every faith, intolerance is not our identity",
    "description": "President Bola Tinubu has rejected United States PresidentDonald Trump’s decision to redesignate Nigeria as a “country of particularconcern” over alleged religious persecution. In a statement on Saturday, Tinubu said Nigeria remains ademocracy anchored on constitutional guarantees of freedom of religion andbelief. “Nigeria stands firmly as a democracy governed byconstitutional guarantees of religious liberty,” the president said. “The characterisation of Nigeria as religiously intolerantdoes not reflect our national reality, nor does it take into consideration theconsistent and sincere efforts of the government to safeguard freedom ofreligion and beliefs for all Nigerians.” Trump had on Friday announced via his Truth Social platformthat Nigeria had been redesignated on the US religious freedom watchlist as a“country of particular concern”. The move follows growing criticism by some US lawmakers,American evangelical groups and lobbyists who allege persecution of Christiansin parts of Nigeria. However, Tinubu described those claims as inaccurate andunhelpful, adding that his administration has maintained open and activeengagement with leaders of both major religions since assuming office in 2023. “Since 2023, our administration has maintained an open andactive engagement with Christian and Muslim leaders alike and continues toaddress security challenges which affect citizens across faiths and regions,”he said. Tinubu said his government continues to invest in securityreforms to protect communities from terrorism and banditry, regardless ofreligious affiliation. He noted that violent groups operating in parts of thecountry target both Christians and Muslims, undermining national peace andunity. “Religious freedom and tolerance have been core tenets ofour collective identity and shall always remain so. Nigeria opposes religiouspersecution and does not encourage it,” the president said. He reaffirmed his administration’s commitment tocollaborating with the US and other international partners to deepenunderstanding, promote coexistence, and strengthen mechanisms that protectvulnerable communities. “Our administration is committed to working with the UnitedStates government and the international community to deepen understanding andcooperation on protection of communities of all faiths,” Tinubu said. “Nigeria is a country with constitutional guarantees toprotect citizens of all faiths. Intolerance is not our identity.” Nigeria was first designated as a “country of particularconcern” by the Trump administration in 2020 but was removed from the list in2021 by former President Joe Biden.",
    "source": "Nigeria News",
    "publishedAt": "2025-11-01 20:07:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.nigerianeye.com/2025/11/tinubu-to-trump-nigerias-constitution.html"
  },
  {
    "title": "Annual Methodist Chili Day event is Nov. 4",
    "description": "Marshall 1st United Methodist Church will host its annual Chili Day on Tuesday, Nov. 4.",
    "source": "Tribune Star",
    "publishedAt": "2025-11-01 20:07:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.tribstar.com/features/annual-methodist-chili-day-event-is-nov-4/article_c77fd6cf-fd78-4ebe-80e6-11ee9553fbb2.html"
  },
  {
    "title": "Loughrea edge neighbors St Thomas' in dramatic fashion in Galway SHC final",
    "description": "A goal in the final minute of regular time from Darren Shaughnessy proved decisive but St Thomas’ made them sweat all the way when Conor Cooney struck 1-1 in the dying minutes",
    "source": "Irish Examiner",
    "publishedAt": "2025-11-01 20:07:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.irishexaminer.com/sport/gaa/arid-41734935.html"
  },
  {
    "title": "Steady day for St. Albert dentist office offering free services",
    "description": "For years, patients have come in droves to a St. Albert dentist office for a chance at free services.",
    "source": "Ctv News",
    "publishedAt": "2025-11-01 20:06:53",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.ctvnews.ca/edmonton/article/steady-day-for-st-albert-dentist-offering-free-services/"
  },
  {
    "title": "Sewing change, one bag at a time",
    "description": "In a province still drowning in polythene, despite ban, plastic bags continue to plague K-P",
    "source": "The Express Tribune",
    "publishedAt": "2025-11-01 20:06:53",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://tribune.com.pk/story/2575406/sewing-change-one-bag-at-a-time"
  },
  {
    "title": "Europe Leads the Charge on Aviation Sustainability with SAF Mandates and Innovation",
    "description": "Europe Leads the Charge on Aviation Sustainability with SAF Mandates and InnovationExplore Europe's ambitious SAF mandates, how they’re driving sustainability in aviation. Learn about challenges, policies, the future of greener air travel.The post Europe Leads the Charge on Aviation Sustainability with SAF Mandates and Innovation appeared first on Travel And Tour World.",
    "source": "Travel And Tour World",
    "publishedAt": "2025-11-01 20:06:52",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.travelandtourworld.com/news/article/europe-leads-the-charge-on-aviation-sustainability-with-saf-mandates-and-innovation-2/"
  },
  {
    "title": "Inagawa helps pace Drake in 24-19 win over Butler to stay perfect in Pioneer Football League",
    "description": "Logan Inagawa threw for 244 yards and a touchdown and Drake remained unbeaten in the Pioneer Football League by beating Butler 24-19. Drake’s Isaiah Bragg returned the opening kickoff 32 yards to the Drake 34. On the first play from...",
    "source": "Thederrick",
    "publishedAt": "2025-11-01 20:06:51",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.thederrick.com/ap/sports/inagawa-helps-pace-drake-in-24-19-win-over-butler-to-stay-perfect-in-pioneer/article_9b0b4a33-3559-5d36-84dc-09b67a938e73.html"
  },
  {
    "title": "Inagawa helps pace Drake in 24-19 win over Butler to stay perfect in Pioneer Football League",
    "description": "Logan Inagawa threw for 244 yards and a touchdown and Drake remained unbeaten in the Pioneer Football League by beating Butler 24-19. Drake’s Isaiah Bragg returned the opening kickoff 32 yards to the Drake 34. On the first play from...",
    "source": "Wv News",
    "publishedAt": "2025-11-01 20:06:51",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.wvnews.com/sports/pro/inagawa-helps-pace-drake-in-24-19-win-over-butler-to-stay-perfect-in-pioneer/article_558a10cc-892a-5f33-a8e0-cdffbc30de25.html"
  },
  {
    "title": "Inagawa helps pace Drake in 24-19 win over Butler to stay perfect in Pioneer Football League",
    "description": "Logan Inagawa threw for 244 yards and a touchdown and Drake remained unbeaten in the Pioneer Football League by beating Butler 24-19. Drake’s Isaiah Bragg returned the opening kickoff 32 yards to the Drake 34. On the first play from...",
    "source": "Newsitem",
    "publishedAt": "2025-11-01 20:06:51",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.newsitem.com/ap/sports/inagawa-helps-pace-drake-in-24-19-win-over-butler-to-stay-perfect-in-pioneer/article_f1ead755-4bff-5e09-9337-34cb70fbde70.html"
  }
]