[
  {
    "title": "Facilitated Telemedicine Boosts Long-Term Recovery for Patients with HCV and OUD, with Andrew Talal, MD",
    "description": null,
    "source": "Hcplive",
    "publishedAt": "2025-11-08 20:07:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.hcplive.com/view/facilitated-telemedicine-boosts-long-term-recovery-patients-hcv-oud-andrew-talal-md"
  },
  {
    "title": "Who is setting fire to Amazon?",
    "description": "“Red John” is an old acquaintance of landowners and ranchers in the Brazilian Amazon.He helps clears pastures cheaply, but also leaves blackened earth and charred trees in his wake — threatening the p...",
    "source": "Gulf Times",
    "publishedAt": "2025-11-08 20:07:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.gulf-times.com/article/714587/opinion/who-is-setting-fire-to-amazon"
  },
  {
    "title": "\"It looked easy, but it wasn't\" – Hjulmand reacts to Leverkusen's 6-0 win over Heidenheim",
    "description": "Kasper Hjulmand was understandably delighted after watching his Bayer Leverkusen side demolish 1. FC Heidenheim 6-0 on Saturday.Speaking at the press conference after the game, which saw Leverkusen 5-...",
    "source": "Yahoo! News",
    "publishedAt": "2025-11-08 20:07:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://bulinews.com/looked-easy-but-wasn-hjulmand-reacts-leverkusen-6-0-win-over-heidenheim"
  },
  {
    "title": "LSU NCBRT/ACE BRPD after-action",
    "description": "Baton Rouge police officers engage in an after-action session with an instructor at LSU's National Center for Biomedical Research and Training / Academy of Counter-Terrorist Education. In October, BRPD officers were trained in virtual reality de-escalation techniques with the academy.",
    "source": "The Advocate",
    "publishedAt": "2025-11-08 20:07:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.theadvocate.com/lsu-ncbrt-ace-brpd-after-action/image_867111fb-2c65-447d-b301-de2bfeb1c94f.html"
  },
  {
    "title": "Forum: Health care",
    "description": "By Betsy Coffia",
    "source": "Record Eagle",
    "publishedAt": "2025-11-08 20:07:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.record-eagle.com/news/forum-health-care/article_801fba21-4f42-4efe-a364-bba3622749dd.html"
  },
  {
    "title": "Official: Real Madrid learn referee appointment for Rayo Vallecano clash",
    "description": "La Liga leaders Real Madrid have been made aware of the official set to take charge of their upcoming meeting with Rayo Vallecano.This comes amid confirmation of Juan Martínez Munuera being appointed...",
    "source": "Yahoo! News",
    "publishedAt": "2025-11-08 20:07:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://getfootballnewsspain.com/official-real-madrid-learn-referee-appointment-for-rayo-vallecano-clash/"
  },
  {
    "title": "‘A complete fabrication’ — Modu Sheriff says he didn’t accuse Shettima of creating Boko Haram",
    "description": "Ali Modu Sheriff, former governor of Borno state, has deniedclaims that he accused Vice-President Kashim Shettima of creating Boko Haram,describing the report as “false, malicious, and dangerous”.A publication circulating online had quoted Sheriff assaying, “It’s not me; it’s Shettima who created Boko Haram.” The report was first publishedin August 2016. But in a statement issued on Saturday, Sheriff dismissed thereport as a “complete fabrication” aimed at misleading the public and stirringpolitical discord. “The said story is a complete fabrication, devoid of truth,and a deliberate attempt to mislead the public, malign the person of SenatorSheriff, and sow discord within the nation’s political landscape,” thestatement reads. Sheriff said he never granted any interview or spoke to anyjournalist on the matter, adding that the falsehood was designed to underminehis long-standing commitment to peace and national unity. “This false report is not only mischievous but also adangerous piece of fake news aimed at undermining years of Senator Sheriff’scontributions to peace, national unity, and development, both in Borno Stateand across Nigeria,” the statement added. The former governor urged members of the public and themedia to disregard the publication, noting that he had directed his legal teamto identify and pursue those behind the story. “Senator Sheriff has instructed his legal team to takeimmediate steps to identify all individuals, bloggers, or media outletsresponsible for the dissemination of this defamatory material,” his mediaoffice said. “Should the false publication not be retracted and takendown forthwith, the Senator will not hesitate to seek full legal redress underthe law.” Sheriff reaffirmed his commitment to Nigeria’s security,stability, and democratic values and vowed to ensure that the spread ofmisinformation does not go unpunished.",
    "source": "Nigeria News",
    "publishedAt": "2025-11-08 20:07:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.nigerianeye.com/2025/11/a-complete-fabrication-modu-sheriff.html"
  },
  {
    "title": "NFL Week 10 Preview: Heavyweight NFC clashes on tap",
    "description": "If you like marquee matchups, Week 10 in the NFL has you covered. Kellen Forrest has more on two heavyweight NFC clashes and much more in his Week 10 preview.",
    "source": "Sportsnet",
    "publishedAt": "2025-11-08 20:06:58",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.sportsnet.ca/nfl/article/nfl-week-10-preview-heavyweight-nfc-clashes-on-tap/"
  },
  {
    "title": "Bustamante Hospital for Children receives major boost as critically ill patients are transferred from hurricane-hit hospitals in the west",
    "description": "KINGSTON, Jamaica — As hospitals in the north and west continue to reel from the effects of Hurricane Melissa, the Sandals Foundation has injected $6-million worth of equipment and resources to help the Bustamante Hospital for Children accept and care for the critically ill neonates, babies, and children who are being transferred to Kingston. A suite of machines and supplies, including a neonatal ventilator, infusion pump, blood gas analyser, catheter,...",
    "source": "Jamaica Observer",
    "publishedAt": "2025-11-08 20:06:55",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.jamaicaobserver.com/2025/11/08/bustamante-hospital-children-receives-major-boost-critically-ill-patients-transferred-hurricane-hit-hospitals-west/"
  },
  {
    "title": "‘Breaking Bad’ creator’s new show ‘Pluribus’ was emphatically ‘made by humans,’ not AI",
    "description": "If you watched all the way to the end of the new Apple TV show “Pluribus,” you may have noticed an unusual disclaimer in the credits: “This show was made by humans.” Source link",
    "source": "Startupnews",
    "publishedAt": "2025-11-08 20:06:50",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://startupnews.fyi/2025/11/09/breaking-bad-creators-new-show-pluribus-was-emphatically-made-by-humans-not-ai/"
  }
]