[
  {
    "title": "Wyoming Freedom Caucus outlines fiscal goals, including lower taxes",
    "description": "CHEYENNE – State lawmakers who are part of the Wyoming Freedom Caucus, known for their hardline conservative stances, laid out their fiscal goals for the coming budget session on Thursday, including finding ways to further reduce the tax burden on...",
    "source": "Wyoming Tribune Eagle",
    "publishedAt": "2025-10-31 21:45:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.wyomingnews.com/news/local_news/wyoming-freedom-caucus-outlines-fiscal-goals-including-lower-taxes/article_3d925793-9efd-422f-8f3c-010b8b021af9.html"
  },
  {
    "title": "Investing in affordable rental homes in North Vancouver",
    "description": "NORTH VANCOUVER, BC, Oct. 31, 2025 /CNW/ - Solving Canada's housing crisis requires immediate action to build up supply and bring down costs. The Government of Canada is stepping up with unprecedented investments to supercharge housing construction in Canada. To that end, the federal government launched Build Canada Homes, a new federal agency that will build affordable housing at scale, including transitional and supportive housing, deeply affordable and community housing, and affordable homes for the Canadian middle class. As we build a strong Canadian housing sector, purposeful collaboration will be essential. That means working together with the private and non-profit sectors to bring down costs and build homes at a scale and pace not seen in generations. These investments are also providing Canadians with increased access to affordable and sustainable housing.The Affordable Housing Fund (AHF) provides funding through low-interest and/or forgivable loans or contributions to partnered organizations for new affordable housing and the renovation and repair of existing, affordable and community housing. Today, the Honourable Gregor Robertson, Minister of Housing and Infrastructure and Minister responsible for Pacific Economic Development Canada was joined by the Honourable Jonathan Wilkinson, Member of Parliament for North Vancouver – Capilano, and Linda Buchanan, Mayor of the City of North Vancouver toured the first phase of an ambitious affordable housing project at 144 St Georges Avenue, which is nearing completion and which received support from the federal government. The second phase of this project is receiving $84.5 million in funding to help build 179 secure, affordable rental homes at 120 St Georges Avenue. They also This is an example of the Government of Canada's commitment to investing in affordable housing right across the countryThe 18-storey, mass timber building will provide housing for singles, couples, families, and seniors in North Vancouver. The rental homes will range in size from studio to three-bedroom units.This is the second phase of the North Shore Neighbourhood House Hub Redevelopment, which is a multi-partner project on City-owned land that supports the City's ongoing commitment to increasing rental housing and community-based services. When all three phases are completed, it will provide rental housing, a new North Shore Neighbourhood House (NSNH), a respite centre with 18 overnight beds and 25 adult daycare spaces, and a redesigned Derek Inman Park.Budget 2025, ...Full story available on Benzinga.com",
    "source": "Benzinga",
    "publishedAt": "2025-10-31 21:45:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.benzinga.com/pressreleases/25/10/n48575940/investing-in-affordable-rental-homes-in-north-vancouver"
  },
  {
    "title": "Gino's Landscape & Lawn Care Expands Services and Unveils New Brand in Peotone, Illinois",
    "description": "Gino's Landscape Design & Lawn Care, a BBB-accredited Will County company, announces new branding, expanded services, and improved online quote features for 2025Gino's Landscape Design & Lawn Care, a landscaping company in Peotone, IL, that has proudly served Will County",
    "source": "Openpr.com",
    "publishedAt": "2025-10-31 21:44:05",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.openpr.com/news/4249178/gino-s-landscape-lawn-care-expands-services-and-unveils-new"
  },
  {
    "title": "US stock markets close week with gains",
    "description": "Amazon, Apple, Netflix, Chevron's positive results reflect on Friday's share markets",
    "source": "Anadolu Agency",
    "publishedAt": "2025-10-31 21:44:03",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.aa.com.tr/en/economy/us-stock-markets-close-week-with-gains/3732309"
  },
  {
    "title": "Cecil officials urge senators to back federal reopening; Lawmakers resist ‘rubber stamp’",
    "description": "Cecil County leaders urged Sens. Van Hollen and Alsobrooks to support a bill reopening the government amid a weeks-long shutdown.",
    "source": "Baltimore Sun",
    "publishedAt": "2025-10-31 21:43:18",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.baltimoresun.com/2025/10/31/cecil-county-continuing-resolution-letter/"
  },
  {
    "title": "Cecil officials urge senators to back federal reopening; Lawmakers resist ‘rubber stamp’",
    "description": "Cecil County leaders urged Sens. Van Hollen and Alsobrooks to support a bill reopening the government amid a weeks-long shutdown.",
    "source": "Capital Gazette",
    "publishedAt": "2025-10-31 21:43:18",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.capitalgazette.com/2025/10/31/cecil-county-continuing-resolution-letter/"
  },
  {
    "title": "COP 30: Tinubu Okays National Carbon Market Framework, Climate Fund",
    "description": "Ahead of the 30th session of the United Nations Climate Change Conference (COP 30) in Brazil, President Bola Tinubu has approved the adoption of a National Carbon Market Framework, the operationalisation of the Climate Change Fund and the restoration of the National Council on Climate Change (NCCC) to the budget line. The goal was to [...]",
    "source": "Leadership",
    "publishedAt": "2025-10-31 21:41:04",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://leadership.ng/cop-30-tinubu-okays-national-carbon-market-framework-climate-fund/"
  },
  {
    "title": "Top Democrat presses Trump administration on Argentina 'bailout' during shutdown",
    "description": "Rep. Jamie Raskin demands transparency from Treasury Secretary Scott Bessent about the Trump administration's $40 billion Argentina deal.",
    "source": "Headtopics",
    "publishedAt": "2025-10-31 21:40:48",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://us.headtopics.com/news/top-democrat-presses-trump-administration-on-argentina-75193840"
  },
  {
    "title": "Cuomo courts Sliwa voters in Russian NYC neighborhood — warning against danger of socialist Zohran Mamdani",
    "description": "Andrew Cuomo calls out Zohran Mamdani's socialist agenda and inexperience to deal with potential disasters",
    "source": "Headtopics",
    "publishedAt": "2025-10-31 21:40:39",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://us.headtopics.com/news/cuomo-courts-sliwa-voters-in-russian-nyc-neighborhood-75193863"
  },
  {
    "title": "Two judges issue rulings in lawsuits challenging Trump admin. withholding SNAP benefits",
    "description": "This is additional taxonomy that helps us with analytics",
    "source": "Headtopics",
    "publishedAt": "2025-10-31 21:40:10",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://us.headtopics.com/news/two-judges-issue-rulings-in-lawsuits-challenging-trump-75193782"
  }
]