[
  {
    "title": "Trump sues IRS, Treasury for $10 billion over leak of his tax returns",
    "description": "President Donald Trump sued the U.S. Treasury and IRS for at least $10 billion over an unauthorized disclosure of his tax returns to the press during his first term in office, potentially putting American taxpayers on the hook for a...",
    "source": "Wyoming Tribune Eagle",
    "publishedAt": "2026-01-30 20:09:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.wyomingnews.com/news/from_the_wire/trump-sues-irs-treasury-for-10-billion-over-leak-of-his-tax-returns/article_898be0b9-e460-4d37-8d17-0f025faa68bd.html"
  },
  {
    "title": "Is NNN's 5.6% Dividend Yield Safe? A Beginner's Checklist",
    "description": "If you’re new to dividend investing, a 5.6% yield can look attractive—especially when it comes from a company that has raised its payout for 36 consecutive years. But yield alone doesn’t tell the full story. The question isn’t just “how much does it pay?” but “can it keep paying?”NNN REIT (NYSE:NNN) is a net lease real estate investment trust that owns 3,697 properties across all 50 U.S. states. Its tenants include convenience stores, auto service centers, and restaurants—businesses that sign long-term leases and pay rent month after month.But even stable-looking companies can cut dividends when the math stops working. This checklist walks through four metrics that help determine whether NNN’s dividend sits on solid ground—or shaky soil.What Is a Net Lease REIT?Before diving into the numbers, it helps to understand NNN’s business model.In a typical lease, landlords pay for property taxes, insurance, and maintenance. In a net lease, tenants pay those costs instead. This structure gives NNN predictable cash flows with minimal operating expenses—ideal for sustaining dividends.NNN’s tenants sign leases averaging 10.1 years in length, with built-in annual rent increases averaging 1.5%. This creates a long runway of predictable income, assuming tenants stay healthy.Now, let’s check the numbers.1. Credit Rating: BBB+ (S&P) / Baa1 (Moody’s)A credit rating measures a company’s ability to repay debt. Ratings of BBB- and above are considered “investment grade”—meaning institutional investors like pension funds and insurance companies can hold these bonds.NNN holds a BBB+ rating from S&P and Baa1 from Moody’s (latest publicly confirmed ratings). Both are solidly investment grade.Why does this matter for dividends? If a REIT’s rating falls below BBB-, two things happen:Borrowing costs rise sharplyMany institutional investors are forced to sellThis “forced selling” can trigger a downward spiral in stock price and make it harder for the company to raise capital. Dividend cuts often follow.NNN sits two notches above that BBB- cliff. It’s not a ...Full story available on Benzinga.com",
    "source": "Benzinga",
    "publishedAt": "2026-01-30 20:09:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.benzinga.com/Opinion/26/01/50280434/is-nnn-dividend-yield-safe-a-beginners-checklist"
  },
  {
    "title": "Sugar Land officials hear community feedback on T.E. Harman Center expansion plans",
    "description": "Sugar Land officials hosted a Jan. 29 open house to hear community feedback on plans for the T.E. Harman Center’s expansion.",
    "source": "Communityimpact",
    "publishedAt": "2026-01-30 20:09:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://communityimpact.com/houston/sugar-land-missouri-city/government/2026/01/30/sugar-land-officials-hear-community-feedback-on-te-harman-center-expansion-plans/"
  },
  {
    "title": "QURE Investigation Alert: Kessler Topaz Meltzer & Check, LLP Encourages uniQure N.V. (NASDAQ: QURE) Investors with Significant Losses to Contact the Firm",
    "description": "RADNOR, Pa., Jan. 30, 2026 (GLOBE NEWSWIRE) -- The law firm of Kessler Topaz Meltzer & Check, LLP (www.ktmc.com) is currently investigating potential violations of the federal securities laws on behalf of investors of uniQure N.V. (NASDAQ: QURE) (“uniQure”).",
    "source": "Globenewswire_fr",
    "publishedAt": "2026-01-30 20:09:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.globenewswire.com/fr/news-release/2026/01/30/3229750/0/en/QURE-Investigation-Alert-Kessler-Topaz-Meltzer-Check-LLP-Encourages-uniQure-N-V-NASDAQ-QURE-Investors-with-Significant-Losses-to-Contact-the-Firm.html"
  },
  {
    "title": "Lake-Effect Snow Can Turn Into a Whiteout in Seconds: Here's How to Stay Safe",
    "description": "Lake-effect snow is the sneakiest kind. The sky looks “fine,” then you hit a band and it’s instant whiteout—no shoulder, no lines, just brake lights and panic. That’s why an “arctic blast” story only matters when it’s roads-first: sudden drops...",
    "source": "Capjournal",
    "publishedAt": "2026-01-30 20:09:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.capjournal.com/arena/men_s_journal/lake-effect-snow-can-turn-into-a-whiteout-in-seconds-heres-how-to-stay-safe/article_a22657e7-c40a-5fad-bcd2-d4da18d41f96.html"
  },
  {
    "title": "Peel school board supervision a 'smokescreen' for underfunding, chair says",
    "description": "The chair of a school board recently taken over by Ontario's minister of education is defending the management and finances of the board, saying the supervision is a \"smokescreen\" to distract from provincial underfunding.",
    "source": "The Star",
    "publishedAt": "2026-01-30 20:09:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.thestar.com/news/gta/peel-school-board-supervision-a-smokescreen-for-underfunding-chair-says/article_c39e9bcc-5a05-57fd-9d53-7e97e3d9d917.html"
  },
  {
    "title": "Bagging up – supporting your rifle at the bench",
    "description": "The methods and means of supporting a rifle on the shooting bench are as varied as the rifles themselves and the men and women who shoot them. Take a walk along the firing line of any range and one will find that range benches and shooting setups take on a personality entirely their own. While [...]",
    "source": "Observer-reporter",
    "publishedAt": "2026-01-30 20:08:59",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.observer-reporter.com/uncategorized/2026/jan/30/bagging-up-supporting-your-rifle-at-the-bench/"
  },
  {
    "title": "Josh Heupel, Tennessee Receive Strong Message From 5-Star RB",
    "description": "It's high remarks.",
    "source": "Capjournal",
    "publishedAt": "2026-01-30 20:08:56",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.capjournal.com/arena/athlon_sports/josh-heupel-tennessee-receive-strong-message-from-5-star-rb/article_b5094885-6394-59d9-8ead-56fc0ea2d14b.html"
  },
  {
    "title": "$13M project aims to remake Congress Avenue downtown into people-focused corridor",
    "description": "The initiative aims to remake Congress Avenue between Cesar Chavez and 7th streets into people-focused corridor over the next 18 months.",
    "source": "Austin American-statesman",
    "publishedAt": "2026-01-30 20:08:55",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.statesman.com/news/local/article/austin-congress-avenue-redesign-21320787.php"
  },
  {
    "title": "Israel Denies Rift With Egypt Over Rafah Crossing Amid Conflicting Reports",
    "description": "Ahmed Kamel – Egypt Daily News The office of Israeli Prime Minister Benjamin Netanyahu has denied reports of a dispute with Egypt over the operation of the Rafah border crossing, even as Israeli and regional media continue to cite unresolved disagreements between the two sides regarding the terms of its reopening. In a statement to [...]The post Israel Denies Rift With Egypt Over Rafah Crossing Amid Conflicting Reports first appeared on Egypt Daily News - Egypt News.",
    "source": "Egypt Daily News",
    "publishedAt": "2026-01-30 20:08:55",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://egyptdailynews.com/israel-denies-rift-with-egypt-over-rafah-crossing-amid-conflicting-reports/"
  }
]