[
  {
    "title": "Richard “Dick” David Waller",
    "description": "It is with overwhelming sadness that we announce the death of Richard Waller, loving father, grandfather, great-grandfather, uncle, and friend, at the age of 88, so soon after the passing of our wonderful mom, his beautiful wife Marilyn, five months prior. Richard was born on March 28, 1937, in Milwaukee, WI. He and his younger [...]",
    "source": "Daily Breeze",
    "publishedAt": "2026-01-18 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.dailybreeze.com/obituaries/richard-dick-david-waller-rancho-palos-verdes-ca/"
  },
  {
    "title": "Jane Marie Solaro",
    "description": "Jane passed away peacefully on January 4, 2026 at the age of 91. Jane was born in Pacific Grove, CA on December 14, 1934 and lived in San Pedro her entire life. She is preceded in death by her loving husband John Solaro and her parents Matthew Bodul & Ann (Berkovich) Bodul. Jane enjoyed the [...]",
    "source": "Daily Breeze",
    "publishedAt": "2026-01-18 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.dailybreeze.com/obituaries/jane-marie-solaro-san-pedro/"
  },
  {
    "title": "Michael Eggleston",
    "description": "Michael Dennis (Mike) Eggleston, aged 77, passed away at his home on November 26th, 2025. Born in Chico to Floyd and Joy Eggleston on December 15th, 1947, Michael is survived by his wife of 57 years, Carol Eggleston (Hopper), his three daughters, Michelle Seipert, Becky Johnson and Mandi Atkinson, his grandchildren, Luke and Miranda Seipert, [...]",
    "source": "Chicoer",
    "publishedAt": "2026-01-18 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.chicoer.com/obituaries/michael-eggleston/"
  },
  {
    "title": "Fallout Season 2 Episode 6 Release Date, Time, Where to Watch",
    "description": "Fallout Season 2 Episode 6 release date and time are not far away. In the previous episode, titled “The Wrangler,” the Ghoul and Lucy encounter not one but an entire pack of Deathclaws. After deciding to run for their lives, the two narrowly escape. Meanwhile, Hank experiments with the mind control device on a random person he [...]The post Fallout Season 2 Episode 6 Release Date, Time, Where to Watch appeared first on ComingSoon.net - Movie Trailers, TV & Streaming News, and More.",
    "source": "Coming Soon",
    "publishedAt": "2026-01-18 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.comingsoon.net/guides/news/2084188-fallout-season-2-episode-6-release-date-time-where-to-watch"
  },
  {
    "title": "Donald Drowty",
    "description": "Donald Drowty, remembered both for his music and his lifelong commitment to helping others, passed away at the age of 87 on December 28, 2025, leaving a legacy of creativity, compassion, and service. Don was best known as a member of Dante and the Evergreens, the early rock-and-roll group that helped define the West Coast [...]",
    "source": "Chicoer",
    "publishedAt": "2026-01-18 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.chicoer.com/obituaries/donald-drowty/"
  },
  {
    "title": "John Michael Wichman",
    "description": "John Michael Wichman, known fondly as Moke, 75, was born in Seattle, Washington, on April 15, 1950. John went on his heavenly drive on December 28th, 2025, in Chico, California. John was the child of Dr. John Wilfred Wichman and Ruth Florence Wichman, raised in Washington, England, Nevada, France, Hawaii, and California. John graduated from [...]",
    "source": "Chicoer",
    "publishedAt": "2026-01-18 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.chicoer.com/obituaries/john-michael-wichman/"
  },
  {
    "title": "Daniel Arthur Perry",
    "description": "Daniel Arthur Perry, born July 29, 1960, in Willows, California, passed away while enjoying one of his favorite pastimesriding his motorcycle. He leaves behind a legacy of a life well lived. Dan was the beloved son of John and Jessie Perry and a brother to Linda and Larry, Nancy and Jeffrey, John and Patricia, and [...]",
    "source": "Chicoer",
    "publishedAt": "2026-01-18 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.chicoer.com/obituaries/daniel-arthur-perry/"
  },
  {
    "title": "Shane Edwin Simpson",
    "description": "Shane passed away quietly at home at the age of 45. He leaves behind his mother Bobbie Rhea, his wife Natalie (Moreno) Simpson, and several cousins and friends. Shane had a big heart and always greeted his community with joy and humor, and will be missed deeply by all.",
    "source": "Santacruzsentinel.com",
    "publishedAt": "2026-01-18 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.santacruzsentinel.com/obituaries/shane-edwin-simpson-santa-cruz-ca/"
  },
  {
    "title": "Doris A. Graves MD",
    "description": "Doris A. Graves MD, a pediatrician, died Jan. 6, 2026, in Alhambra, after a short illness. She was 91.She was born July 14, 1934, in Los Angeles. She graduated from Alhambra High School, Occidental College in Los Angeles, and the University of Southern California School of Medicine.Dr. Graves had a pediatric practice in Pasadena for [...]",
    "source": "Pasadenastarnews",
    "publishedAt": "2026-01-18 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.pasadenastarnews.com/obituaries/doris-a-graves-md-alhambra-ca/"
  },
  {
    "title": "John Hall",
    "description": "John was born October 7, 1933 in Chico, California to John and Alice Hall. He was raised on the family ranch in Cana and then served in the United States Army. After his service in the army he married and spent time in Corning where he worked for an olive plant. He then moved with [...]",
    "source": "Chicoer",
    "publishedAt": "2026-01-18 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.chicoer.com/obituaries/john-hall/"
  }
]