[
  {
    "title": "Tigrayan women return to abuse, not safety",
    "description": "The war between Tigray and Ethiopia is “over” and many Tigrayan migrants are being sent back. Amongst those returning migrants are many who suffered exploitation and violence before they fled or while abroad. Some of the most egregious accounts are from women who left due to systematic sexual and gender-based violence. And of these returning refugees who have already endured trauma, particularly the women, many are now being subjected to a lack of gender‐sensitive screening, support, or safe shelter on return.Further, in some cases, refugees are experiencing modern slavery conditions at the hands of officials. All these factors are turning what should be a safe return into survivor re‐victimization. It also underlines the perils of a new migration policy trend, “migration externalization”.Refugees facing modern slavery on arrivalHorrific accounts of sexual violence are well documented as part of a brutal war that engulfed Tigray between 2020 and 2022. Now the war is over, and many women and girls who fled to other locations are returning along with the men. But among those interviewed, some were transferred to remote detention centers, farms, or informal holding facilities. Once there, they experienced beatings, forced labor, denial of food or medical care, and were not allowed to contact relatives. All indicators of modern slavery.Gender Empowerment Movement Tigray (GEM Tigray) writing for Addiss Standard stated:“The story of Tigrayan women—deported, displaced, abused—shows what happens when migration governance becomes about deterrence, removal, and externalization, rather than protection, dignity, and rights. For many, “return” is not a return to home—it is a spiral of detention, invisibility, re‐victimization, and trauma.”GEM Tigray shares that this treatment “raises pressing human rights, moral, and policy questions.” It also follows a global trend of governments embracing an “externalization” of migration control. The forced returns of Tigrayans underline this global shift. Destination states are increasingly outsourcing border control, returns, and “migration management” to third or transit countries. In addition, harsh deportation and readmission policies are voted in that lack basic human rights standards. A cruel shift from the protection and asylum refugees should be given. Further, the trend does not fulfill the moral and practical obligations international law places on the treatment of refugees.Are current policies renewing hope—or perpetuating harm?According to international law, everyone has the right to life, security, non‐discrimination, protection from torture or ill‐treatment, and the right to seek asylum and refuge. And those laws impose clear obligations on states in regard to refugees. Particularly the principle of non-refoulement. This principle prohibits returning anyone to a place where they face a real risk of serious harm. States are also prohibited from arbitrary detention, torture, and enforced disappearance and must provide safe conditions, access to legal remedy, and non-discriminatory treatment. But GEM Tigray and other rights groups are crying foul.GEM Tigray stated:“International human rights law—including the right to life, security, non‐discrimination, protection from torture or ill‐treatment, and the right to seek asylum and refuge—imposes clear obligations on states...(and) externalization policies—through deportations, returns without screening, detention of returnees, or deals with transit states—often flout these obligations.”Contrary to the stated aim, GEM Tigray feels the externalization of migration policy will only deepen the migration crisis, not solve it. Migration policy focused on deterrence, removal, and externalization instead of protection, dignity, and rights raises an important question. Are we renewing hope, or perpetuating harm?Time to demand accountability, transparency, and policy changeGEM Tigray is calling for an immediate halt to arbitrary deportations and detentions. They also highlight the urgent need to establish gender‐sensitive return and reintegration mechanisms. In addition, governments must ensure transparency in all return, readmission, and migration-management agreements. They must publicly disclose any deals with foreign states or transit partners, subject them to oversight, and condition them on clear human-rights safeguards. They are also calling for safe, legal, humanitarian pathways for migration.Freedom United stands beside GEM Tigray and all those who are demanding an end to the externalization of migration and demand safe migration pathways. Add your voice to ours and tell governments everywhere hostile immigration policies only perpetuate exploitation, we say “not in our name.”*Freedom United is a global community that unites individuals and organizations in the fight against human trafficking and modern slavery, registered in the US as a nonprofit.",
    "source": "Dailykos",
    "publishedAt": "2026-01-10 08:06:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.dailykos.com/stories/2026/1/10/2362327/-Tigrayan-women-return-to-abuse-not-safety"
  },
  {
    "title": "Restaurant forced to close after 'damage caused by migrants' now houses homeless people",
    "description": "A local campaigner says the situation \"highlights the double standard of Government funding for migrants instead of our own local homeless\".",
    "source": "Express",
    "publishedAt": "2026-01-10 08:06:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.express.co.uk/news/uk/2156002/asylum-seeker-hotel-restaurant-homeless"
  },
  {
    "title": "Kendrick Tigers’ historic 2025 picked as sports story of the year",
    "description": "Kendrick wins football, boys basketball, baseball state triple crown in one school year; extends football state title streak to five",
    "source": "Dnews",
    "publishedAt": "2026-01-10 08:06:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.dnews.com/sports/kendrick-tigers-historic-2025-is-tribune-sports-story-of-the-year-b22e546d"
  },
  {
    "title": "Is Milk Enough to Fulfill Children's Nutritional Needs?",
    "description": "Milk only complements the primal meals for children as it provides protein and calcium.",
    "source": "Tempo.co",
    "publishedAt": "2026-01-10 08:06:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://en.tempo.co/read/2079410/is-milk-enough-to-fulfill-childrens-nutritional-needs"
  },
  {
    "title": "Scores and schedule",
    "description": "Friday's scores",
    "source": "Nwaonline",
    "publishedAt": "2026-01-10 08:06:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.nwaonline.com/news/2026/jan/10/scores/"
  },
  {
    "title": "Liverpool: New Slot replacement target ‘completes’ four manager ‘shortlist’ in ‘contingency plan’",
    "description": "According to reports, Liverpool have a 'contingency plan' regarding their head coach situation as they have four managers on their 'exciting shortlist'.",
    "source": "Football365",
    "publishedAt": "2026-01-10 08:05:54",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.football365.com/news/liverpool-slot-replacement-target-completes-four-manager-shortlist-contingency-plan-sack"
  },
  {
    "title": "Emirates Blocking Citizens From Studying at British Universities Over Campus Islamism Fears",
    "description": "British universities removed from generous funding programme over fears young people influenced by Muslim Brotherhood on radicalised campuses.The post Emirates Blocking Citizens From Studying at British Universities Over Campus Islamism Fears appeared first on Breitbart.",
    "source": "Brietbart",
    "publishedAt": "2026-01-10 08:05:53",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.breitbart.com/europe/2026/01/10/uae-blocking-citizens-studying-at-uk-universities-over-islamism-fears/"
  },
  {
    "title": "Cold Spell Intensifies In West Bengal As Temperatures Dip Across Districts",
    "description": "According to the Regional Meteorological Centre in Kolkata's Alipore, the temperature dropped as cold northerly winds are freely entering the state, resulting in biting cold. There is also a significant presence of fog at several places.",
    "source": "Zee News",
    "publishedAt": "2026-01-10 08:05:46",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://zeenews.india.com/india/cold-spell-intensifies-in-west-bengal-as-temperatures-dip-across-districts-3005172.html"
  },
  {
    "title": "Test Captain Najmul Hossain Shanto Highlights Mental Impact of Bangladesh's ICC T20 World Cup 2026 Scheduling Stalemate",
    "description": "Bangladesh Test captain Najmul Hossain Shanto discusses the mental impact of ongoing ICC T20 World Cup 2026 scheduling uncertainties between the Bangladesh Cricket Board (BCB) and the International Cricket Council (ICC), highlighting player frustration and the need for clarity.",
    "source": "Latestly",
    "publishedAt": "2026-01-10 08:05:42",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.latestly.com/sports/cricket/test-captain-najmul-hossain-shanto-highlights-mental-impact-of-bangladeshs-icc-t20-world-cup-2026-scheduling-stalemate-7269741.html"
  },
  {
    "title": "Mustafa Speaks Out as He Raises Money for Sudan and Palestine With Pedro Pascal and Bella Hadid",
    "description": "Recording artist Mustafa has teamed up with actors Pedro Pascal and Bella Hadid to raise funds for humanitarian relief in Sudan and Palestine. Speaking about his motivations, Mustafa says artists have a responsibility to preserve stories and use their voices when violence unfolds. He explains that for many creatives, music becomes the language of protest when words fail. The collaboration aims to mobilize global attention and support for vulnerable communities affected by ongoing conflict.",
    "source": "The Times Of India",
    "publishedAt": "2026-01-10 08:05:40",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://timesofindia.indiatimes.com/short-videos/briefs/mustafa-speaks-out-as-he-raises-money-for-sudan-and-palestine-with-pedro-pascal-and-bella-hadid/videoshow/126449396.cms"
  }
]