[
  {
    "title": "AREA ROUNDUP: Colfax boys basketball advances to NE 2B district finals",
    "description": "2A Whitepine League boys basketball district tourney also underway",
    "source": "The Lewiston Tribune Online",
    "publishedAt": "2026-02-19 08:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.lmtribune.com/sports/colfax-boys-basketball-advances-to-ne-2b-district-finals-21523020"
  },
  {
    "title": "[Breaking] Ex-president Yoon sentenced to life in prison for leading insurrection",
    "description": null,
    "source": "Hani",
    "publishedAt": "2026-02-19 08:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.hani.co.kr/arti/english_edition/e_national/1245555.html"
  },
  {
    "title": "Yoon Suk Yeol gets life sentence over 2024 martial law bid, court calls it insurrection",
    "description": "South Korea jails former president for life after ruling his 2024 martial-law move was an attempt to crush political opposition and seize power.",
    "source": "Moneycontrol",
    "publishedAt": "2026-02-19 08:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.moneycontrol.com/world/yoon-suk-yeol-gets-life-sentence-over-2024-martial-law-bid-court-calls-it-insurrection-article-13835659.html"
  },
  {
    "title": "Arsenal injury update after Bukayo Saka and Leandro Trossard concerns for Tottenham derby",
    "description": "Bukayo Saka was forced off with an injury scare in Arsenal's 2-2 draw against Wolves.",
    "source": "Express",
    "publishedAt": "2026-02-19 08:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.express.co.uk/sport/football/2172821/Arsenal-injury-news-update-Saka-Trossard"
  },
  {
    "title": "NEWS Briefs & NOTES from your editor 2/19/26",
    "description": "NEWS BRIEFS::::: warmest winter // sheriff awards, graduations // Mardi Gras parade // poker fundraiser // blood drive // Boulder new parking schedule // Election // Pinewood craft day // LEAP heating bill relief // post office, cash only // help design bike path // recycle // wildfire, Limon // library winners // Black History Month events // 4 music events // backcountry survival author speak // Longmont 150 years artifacts // Imagination library, free toddler books // Adams Family musical // GS cookies //students food bank fundraiser // teacher filming boys // REED bikes celebrates // robin and mtn lion spottings // solar eclipse // ballot box location // State of CO news // sign up for your caucus // 8 changes in Wash DC politics // 4 sports news // 4 highlights of Olympics, with Colorado // 4 special entertainment",
    "source": "The Lyons Recorder",
    "publishedAt": "2026-02-19 08:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://lyonsrecorder.org/2026/02/19/news-briefs-notes-from-editor-2-19-26/"
  },
  {
    "title": "Sharks name JP Pietersen as permanent head coach",
    "description": "Sharks name JP Pietersen as permanent head coachNokuthula KhanyileThu, 02/19/2026 - 10:10 DURBAN - The Sharks have named JP Pietersen as permanent head coach after seven matches in an interim role. The appointment comes amid several internal and structural changes by the Durban franchise. Pietersen has a good record so far, overseeing five wins and two losses. ALSO READ | Springbok captain Kolisi to rejoin StormersThe former Springbok and Sharks winger took over after a string of poor results at the beginning of the season under former coach John Plumtree. Pietersen was previously the attack coach at the Shark Tank. Other changes include former Cheetahs CEO Rory Duncan taking on a new role as chief of staff.",
    "source": "Enca",
    "publishedAt": "2026-02-19 08:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.enca.com/sport/sharks-name-jp-pietersen-permanent-head-coach"
  },
  {
    "title": "Celebrate the best of British film and TV as the BAFTAs stream live on Lionsgate Play",
    "description": "Enjoy a front-row experience from the comforts of your own home with the Lionsgate Play Awards season is in full swing, and film enthusiasts are surely thriving. Pinoy cinephiles won’t need to miss a thing, because once again, the glitz and glamor of the annual British Academy Film Awards (BAFTAs) are streaming exclusively on Lionsgate Play, live from London’s Royal Festival Hall on Feb. 22, 2026, Sunday, at 7 p.m. GMT.**media[80438]**Filipino audiences can join the festivities through Lionsgate Play’s real-time stream on Feb. 23, Monday, 1:30 AM (Philippine time). The full program will also be available on demand for streaming, so viewers can revisit the highlights anytime.What to expect at the 2026 BAFTAsEach year, the BAFTAs gather the most brilliant talents for a night of celebration, high-stakes competition, and tributes. Similar to the United States’ Academy Awards, the BAFTAs celebrateand honor the best in the British and international film industry.This year, the prestigious awards ceremony will recognize many notable works in film. Paul Thomas Anderson’s One Battle After Another leads with 14 nominations, followed by Ryan Coogler’s genre-defying supernatural thriller Sinners with 13 nods, and Chloe Zhao’s haunting historical drama Hamnet with 11 nominations.Josh Safdie’s directorial debut for Marty Supreme comes strong, with his high-voltage sports comedy drama starring Timothee Chalamet, earning 11 nominations, including Best Film and Director.It’s a big year for gothic films, as Guillermo del Toro’s gothic epic Frankenstein earns 8 nods, with Jacob Elordi nominated for Best Supporting Actor and Dan Laustsen for Best Cinematography.After hosting the BAFTAs for two consecutive years, David Tennant bids goodbye to the stage. This year, viewers can look forward to Alan Cumming’s charisma and bold fashion choices. Making the glamorous event more special, the award-winning British singer-songwriter Jessie Ware will be taking the stage to perform a special tribute during the In-Memoriam Segment.Why the 2026 BAFTAs are a must-watchThe excitement of the glamorous night doesn’t stop there as the singing stars of K-pop Demon Hunters will perform outside the US for the first time. Ejae (Rumi), Audrey Nuna (Mira), and Rei Ami (Zoey), the singing voice behind HUNTR/X, will perform the record-breaking anthem “Golden.”The 2026 BAFTA Fellowship award will be given to NBCUniversal Entertainment’s Chairman Dame Donna Langley DBE, who championed some of the most influential films in the last two decades, including Oppenheimer, The Holdovers, Jurassic World, Bridesmaids, and the record-breaking 2024 adaptation of Wicked.How to watch the 2026 BAFTAs in the PhilippinesTune in for all the excitement on Monday, Feb. 23, as the BAFTAs will be livestreamed in real time in the Philippines exclusively on Lionsgate Play. Here’s the schedule:- 1:45 AM (PH time) – Red Carpet Coverage begins, and see British and international stars donning the most fashionable suits and gowns.- 3:00 AM (PH time) – The Main Broadcast starts.Lionsgate Play: The Home of Global AwardsBeyond streaming the 2026 British Film Academy Awards exclusively, Lionsgate Play is a sanctuary for cinephiles, housing award-winning titles you can stream year-round. Get started with Michael B. Jordan’s 13-time nominated Sinners, or Celine Song’s indie darling Past Lives.If you missed Christopher Nolan’s 2024 BAFTA Champion Oppenheimer in the cinemas, learn about its gripping story and see Cillian Murphy’s stellar performance. Lionsgate Play also hosts award-winning series such as Sherlock, Normal People, and Gangs of London.Set your alarms and get ready to witness cinematic excellence when you stream the 2026BAFTAs on Lionsgate Play. And don’t worry if you miss it or simply want to relive one of the film industry’s biggest nights, as the magic of the silver screen is just one tap away. Get front-row seats to the BAFTAs when you sign up for Lionsgate Play via PLDT Home, Smart, and Cignal. (Robert Requintina)",
    "source": "Manila Bulletin",
    "publishedAt": "2026-02-19 08:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://mb.com.ph/article/10906385/entertainment/movies-and-tv/span-stylecolor-rgb0-0-0-font-family-gilroy-font-size-15px-font-weight-400-text-align-left-white-space-collapse-collapse-display-inline-importantcelebrate-the-best-of-british-film-and-tv-as-the-baftas-stream-live-on-lionsgate-playspan"
  },
  {
    "title": "James Van Der Beek’s financial woes started with ‘Dawson’s Creek’ contract",
    "description": "Friends of the family launched a GoFundMe campaign to help the actor's family which had raised RM9mil as of Feb 13. Read full story",
    "source": "The Star",
    "publishedAt": "2026-02-19 08:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.thestar.com.my/lifestyle/entertainment/2026/02/19/james-van-der-beeks-financial-woes-started-with-dawsons-creek-contract"
  },
  {
    "title": "Arkansas Outdoors: New rifle cartridges are purpose driven, maximize potential",
    "description": "At face value, new rifle cartridges are ballistically equal to existing classics, but the differences are actually significant.",
    "source": "Nwaonline",
    "publishedAt": "2026-02-19 08:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.nwaonline.com/news/2026/feb/19/arkansas-outdoors-new-rifle-cartridges-are/"
  },
  {
    "title": "Mum and sons hit by car outside preschool",
    "description": "A mother and her two young sons are reeling after a terrifying near-death experience, when they were struck by a car outside a preschool.",
    "source": "News",
    "publishedAt": "2026-02-19 08:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.news.com.au/lifestyle/real-life/news-life/horror-footage-shows-mum-2-sons-hit-by-alleged-drunk-driver-outside-us-preschool/news-story/b7f77a30f77f4e49985bb4daa3d8b369?from=rss-basic"
  }
]