[
  {
    "title": "Pedestrian killed in hit-and-run near Midtown, Anchorage police say",
    "description": "Nov. 1—A pedestrian was killed by a suspected intoxicated driver in a hit-and-run collision on Thursday night, the Anchorage Police Department said...",
    "source": "Yahoo! News",
    "publishedAt": "2025-11-01 22:11:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.yahoo.com/news/articles/pedestrian-killed-hit-run-near-221100039.html"
  },
  {
    "title": "King Charles and Queen Camilla's huge move amid Andrew's title drama",
    "description": "King Charles and Queen Camilla have made a charitable donation to the people of Jamaica after damage caused by Hurricane Melissa﻿ this week.It was reported that after the monarch shared a statement on how ﻿\"deeply concerned\" he was over the weather event, he and his wife made a private donation to the Red Cross for the relief efforts in affected countries.Chief executive of the British Red Cross Beatrice Butsana-Sita said: \"King Charles and Queen Camilla's donation will help the IFRC network continue its lifesaving work, particularly in Jamaica, such as through search and rescue and ensuring people have access to healthcare, safe shelter, clean water, food and other essential supplies.\"Secretary General of the IFRC Jagan Chapagain added, \"We are very grateful for this donation and hope it will encourage others to donate, too. Hurricane Melissa hit Jamaica hard. Our emergency appeal is essential to raise the funds needed to help people rebuild their lives over the months and years to come.\"The International Federation of Red Cross and Red Crescent (IFRC) is currently engaging volunteers to distribute emergency supplies and manage shelters in Jamaica, Cuba, Haiti, the Dominican Republic, and is now preparing for the Bahamas as the storm heads north.The UK government has also pledged to match up to £1 million (approx. $2 million) in public donations for aid.READ MORE: The 'magical' tradition Jules and Guy Sebastian are passing down to their kids﻿READ MORE: From Mick Jagger's 'painful' family history to a Hollywood heartthrob's gap year - Stars with a surprising connection to AustraliaREAD MORE: It's a decision every bride has to make, but this Sydney woman admits she's copped some flack for it.Charles and Camilla's personal donation comes after they released a long statement on October 29.﻿\"My wife and I have been deeply concerned and profoundly saddened to see the catastrophic damage caused by the ferocity of Hurricane Melissa in Jamaica and across the Caribbean.\"As we continue to follow the situation closely, our anxious thoughts are with all those who have been so cruelly affected by this awful storm. Above all, our most heartfelt sympathy is with the families, friends and loved ones of those who have tragically lost their lives.\"He added that he has the \"﻿greatest affection\" for Jamaica after serving in the Royal Navy on the West Indies station over fifty years ago, believing in the country's resilience and sharing admiration for the emergency services, frontline workers and volunteers working in rescue and recovery efforts.The private donation also comes amid Charles' directive to ﻿strip his younger brother Andrew of his Prince title.On October 30 (October 31 in Australia), Buckingham Palace confirmed that the royal formerly known as Prince Andrew will now be known as Andrew Mountbatten Windsor.For a daily dose of 9honey, subscribe to our newsletter here.Andrew will leave the Royal Lodge and move to Sandringham, in Norfolk, one of two privately owned residences ﻿by King Charles.His two daughters, Princess Eugenie and Princess Beatrice, will retain their titles, as they are the daughters of the son of a Sovereign, in line with King George V's Letters Patent of 1917.﻿It is the latest move from the palace, weeks after it was announced Andrew would no longer use his Duke of York title following renewed scrutiny on his ties with convicted sex offender Jeffrey Epstein.",
    "source": "9news",
    "publishedAt": "2025-11-01 22:11:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://honey.nine.com.au/royals/king-charles-iii-queen-camilla-news-charity-donation-jamaica-hurricane-melissa/bf44dff8-f370-445e-ac3e-ff40d6e801a2"
  },
  {
    "title": "Staff and parents voice concerns over proposed Anchorage school closures",
    "description": "Nov. 1—The Anchorage School District this week heard criticism from parents and staff from two elementary schools it proposes to close next school year. Many...",
    "source": "Yahoo! News",
    "publishedAt": "2025-11-01 22:11:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.yahoo.com/news/articles/staff-parents-voice-concerns-over-221100021.html"
  },
  {
    "title": "Temperatures to warm up in upcoming week",
    "description": "According to the local National Weather Service on Saturday, the upcoming week is looking to warm up in the Killeen-Fort Hood area. No weather warnings are posted to the NWS official website, and skies this week are expected to be...",
    "source": "Killeen Daily Herald",
    "publishedAt": "2025-11-01 22:11:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://kdhnews.com/news/local/temperatures-to-warm-up-in-upcoming-week/article_6202f4f4-e027-4c0f-8b8b-9ddbd995704e.html"
  },
  {
    "title": "Hamlin snatches Phoenix pole with Byron, Larson hot on his heels",
    "description": "Denny Hamlin will begin his NASCAR Cup Series championship quest from the pole Sunday afternoon at Phoenix Raceway. William Byron and Kyle Larson, two of the three other Cup Series title contenders, qualified second and third.",
    "source": "Racer",
    "publishedAt": "2025-11-01 22:10:59",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://racer.com/2025/11/01/Hamlin-snatches-Phoenix-pole-with-Byron-Larson-hot-on-his-heels"
  },
  {
    "title": "France arrests Afghan with suspected links to Islamic State offshoot",
    "description": "PARIS: A 20-year-old man from Afghanistan suspected of having links to an offshoot of the Islamic State group has been arrested in France, anti-terrorism prosecutors said on Saturday.The man was charged with participating in a criminal terrorist organisation and financing a terrorist enterprise, the National Anti-Terrorism Prosecutor’s Office (PNAT) said.The suspect, who was arrested in Lyon last week, was placed in pre-trial detention.“Clearly adhering to jihadist ideology, he is suspected of having been in contact with IS-K (Islamic State in Khorasan),” the anti-terrorism unit said.The man is suspected of “sending funds” and helping translate and relay “the propaganda of this terrorist organisation,” PNAT added.The Islamic State Khorasan (IS-K), the jihadist group’s branch in Afghanistan, also operates in Pakistan and former Soviet countries in Central Asia including Uzbekistan.The group has been responsible for deadly attacks in Afghanistan and Russia, including an attack on a Moscow concert hall in March 2024 that killed 150 people.According to French daily Le Parisien, the Afghan, who arrived in France several years ago, was arrested by officers from the DGSI domestic intelligence agency when he was already in an administrative detention centre in Lyon.",
    "source": "Business Recorder",
    "publishedAt": "2025-11-01 22:10:54",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.brecorder.com/news/40390460/france-arrests-afghan-with-suspected-links-to-islamic-state-offshoot"
  },
  {
    "title": "‘Equitable global climate action a must to ensure security’",
    "description": "ISLAMABAD: Ali Rehman Malik, Chairman of the Institute of Research and Reforms International (IRR International), on Saturday, called for an immediate and equitable global climate action to safeguard human security and a shared future.IRR International said that a coordinated, urgent, and equitable global action is the need of the hour to address the escalating climate emergency, describing it as a defining threat to human security, food systems, and long-term global stability.He emphasised that Pakistan, despite contributing less than one percent to global emissions, continues to suffer disproportionately from intensifying climate impacts. The catastrophic floods that displaced millions and devastated livelihoods across Pakistan remain a stark reminder of the widening climate injustice faced by frontline nations and the profound human cost of delayed international response, he said.Welcoming recent United Nations initiatives to accelerate climate finance, adaptation frameworks and accountability mechanisms, IRR International’s chairman stressed that high-level commitments must now be translated into measurable outcomes and tangible support for vulnerable states.“Climate justice must move from pledges to delivery,” he stated. “Frontline countries require predictable financing, transparent mechanisms, technology transfer and institutional support, not procedural delays or symbolic rhetoric,” Malik added.He urged the global community to enhance cooperation on climate-resilient infrastructure, clean energy transitions, nature-based solutions and inclusive, community-led adaptation strategies.Reaffirming IRR International’s commitment to sustainable development and inclusive green growth, he underscored that global responsibilities must be met with urgency, fairness and collective resolve.Copyright Business Recorder, 2025",
    "source": "Business Recorder",
    "publishedAt": "2025-11-01 22:10:54",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.brecorder.com/news/40390447/equitable-global-climate-action-a-must-to-ensure-security"
  },
  {
    "title": "F&V delegation to visit central Asia",
    "description": "ISLAMABAD: Considering Pakistan’s export of Kinnow & potato to Central Asia and the untapped market of Kazakhstan, Tajikistan & Uzbekistan, a 12-members’ TDAP sponsored F&V delegation is visiting Central Asian Republics (Kazakhstan, Tajikistan & Uzbekistan) from 29th October to 4th November, 2025 in coordination with Pakistan’s Trade Mission in respective countries.The delegates will visit trade bodies and markets on 29 - 30 October, 2025 in Kazakhstan, then the Pakistan Trade Mission in Dushanbe will organise their visits and meetings in Tajikistan during the next couple of days. Later on the F&V delegation will hold meetings with the regulatory bodies, B2B sessions with trade bodies and visits of local markets till 4th November with the support of Pak Trade Mission in Tashkent, Uzbekistan.Copyright Business Recorder, 2025",
    "source": "Business Recorder",
    "publishedAt": "2025-11-01 22:10:54",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.brecorder.com/news/40390423/fv-delegation-to-visit-central-asia"
  },
  {
    "title": "Capital city witnesses sharp rise in criminal activities",
    "description": "ISLAMABAD: The federal capital has witnessed a sharp rise in criminal activities over the past week, with more than 70 incidents — including murders, armed robberies, car-jacking, and street crimes — have been reported from different areas of the city. According to data collected from police sources, a total of 70 criminal cases were registered during the week, comprising 49 carjacking incidents, eight cases of mobile phone and cash snatching, 10 robberies, and three murders. Police records show that several areas have emerged as crime hotspots, including Industrial Area, Khanna, Karachi Company, Shalimar, and Bhara Kahu. These localities reported the highest number of incidents and appear to be the primary focus of criminal gangs currently operating in the city. Among the most shocking cases was the brutal murder of a cab driver, Muhammad Ali, a resident of Parachinar located in the restive Kurram District of Khyber Pakhtunkhwa. Ali had migrated to Islamabad from his native village due to bad law and order situation and he was residing in Bhara Kahu in a rented house. Ali was abducted on October 27 and his bullet riddled body was recovered on October 29.According to a police official, Muhammad Ali went missing on the afternoon of Monday, October 27, around 3:00 PM. His body was recovered the next day in the Shahdara forest on the outskirts of the city. Police shifted the body to Pakistan Institute of Medical Sciences (PIMS) for post-mortem. According to preliminary investigations, unknown assailants shot Muhammad Ali multiple times, leaving him dead on the spot. He sustained five bullet wounds, and his Toyota Corolla car was taken away by the attackers. Police have launched an investigation into the brutal murder, and efforts are underway to trace and arrest the culprits. In another incident, a young man was shot dead when unidentified motorcyclists opened fire at a video game shop in Shahzad Town, Islamabad. According to police sources, the victim has been identified as Mujahid Abbasi, who died on the spot as a result of the gunshots. The assailants managed to flee the scene immediately after the attack. Upon receiving information about the incident, Shahzad Town’s police reached the spot, collected evidence, and shifted the body to a hospital for post-mortem examination.A major broad daylight robbery took place within the jurisdiction of Industrial Area Police Station, where unidentified assailants looted Rs. 5.5 million from a petrol pump manager in I-8 Markaz, police sources said.According to details, the victim, Bilal Iqbal, was on his way to deposit the cash in his bank when three armed motorcyclists intercepted him and snatched the money at gunpoint.Copyright Business Recorder, 2025",
    "source": "Business Recorder",
    "publishedAt": "2025-11-01 22:10:54",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.brecorder.com/news/40390422/capital-city-witnesses-sharp-rise-in-criminal-activities"
  },
  {
    "title": "Punjab’s governance becomes role model: Azma",
    "description": "LAHORE: Punjab Minister for Information and Culture Azma Bokhari has said that Chief Minister Maryam Nawaz has permanently eliminated land mafias by approving the new Property Ordinance. She stated that it will now be impossible for anyone to illegally occupy the land of poor or vulnerable citizens in Punjab.Azma Bokhari highlighted that in the past, land dispute cases lingered in courts for decades—some for as long as 40 years—without resolution. However, under the new law, every land-grabbing case will be decided within 90 days, ensuring timely justice, she added.She said that Maryam Nawaz is practically transforming Punjab’s system into the “State as a Mother” model, where protection of citizens’ rights, merit, and justice are top priorities.She further clarified that no one in Punjab will be allowed to engage in illegal activities, display weapons, or spread fear and intimidation. She added that protection of life and property, a safe environment for business, and citizens’ prosperity are among the foremost goals of Maryam Nawaz’s government.Azma Bokhari said the transparent and efficient governance system introduced by Chief Minister Maryam Nawaz has now become a benchmark for other provinces.She further noted that the Chief Minister is launching new initiatives every day to improve the people’s quality of life, and that the effective use of resources, merit, and transparency have become the distinct identity of the Punjab government’s projects.Copyright Business Recorder, 2025",
    "source": "Business Recorder",
    "publishedAt": "2025-11-01 22:10:54",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.brecorder.com/news/40390418/punjabs-governance-becomes-role-model-azma"
  }
]