[
  {
    "title": "Iran warns US troops and Israel will be targets if America strikes over protests",
    "description": "Nationwide protests challenging Iran’s theocracy saw protesters flood the streets in the country’s capital and its second-largest city into Sunday, ...",
    "source": "Irish Examiner",
    "publishedAt": "2026-01-11 08:06:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.irishexaminer.com/world/arid-41773490.html"
  },
  {
    "title": "IND vs NZ, 1st ODI: Shubman Gill makes bold call at toss - WATCH - Times of India",
    "description": "IND vs NZ, 1st ODI: Shubman Gill makes bold call at toss - WATCH Times of IndiaCricket commentary | India vs New Zealand, 1st ODI, New Zealand tour of India, 2026 Cricbuzz.comLive Cricket Update - IND vs NZ 1st ODI - Live - Conway, Nicholls, Mitchell fifties take New Zealand to 300 ESPNcricinfoIndia vs New Zealand LIVE Score, 1st ODI : Virat Kohli Breaks Sachin Tendulkar's Huge World Record, India Cruise In Chase vs NZ NDTV SportsVirat Kohli, Rohit Sharma's 'out of the box' felicitation has social media in splits India Today",
    "source": "Google News",
    "publishedAt": "2026-01-11 08:06:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://news.google.com/rss/articles/CBMi5wFBVV95cUxNLVNJTDVqbFVnSC1lelNOOWVvSFpZRnlnamVsX0puQnp4WHNDeV83Rmo2WkdNSFFfRlIxRTBwLU5ZRHY3V0QyOHNhQmo3RGl1NWRTckxYVjYzSWhuWHFrNjF6cWpQV0Q5SFZHeTNEbF9uNHNtalFFYVljT3lHakRILTkwY0ozc1p5TmF6aGwtWm5lRWRWVnhsckxiZ2tyclNOa3RtNXFlYzdxaUFrWnhKWVRROVkycFBZeTlIV2thQm9kcjhJU29QVmgzOFJHRU42VGJtLUl3SnI2N0Y2QnhvQWNpazZfeVk?oc=5"
  },
  {
    "title": "'Siya yung nag-iingay!': Lacson flags P2.5-B ‘allocables’ tied to Imee Marcos in 2025 NEP",
    "description": "Senate President Pro Tempore Panfilo “Ping” Lacson on Sunday, January 11 denounced Sen. Imee Marcos’s allegations of “soft pork barrel” in the 2026 General Appropriations Act (GAA), disclosing that the President’s sister in fact, has an allocable fund worth at least P2.5-billion in the 2025 National Expenditure Program (NEP) based on the so-called “Cabral files.”**media[71201]**Lacson is referring to the documents that allegedly came from the late Department of Public Works and Highways (DPWH) undersecretary Maria Catalina Cabral.“Siya naman nagbuklat nito, sinabi niyang ‘giniling, tinadtad, pero merong pork’ (ang 2026 budget). Si Sen. Imee, meron siyang allocable dun na P2.5-billion dun sa NEP (National Expenditure Program), (based) dun sa Cabral files...(She’s the one who raised this, she claims that the 2026 budget is chopped, mixed but still had soft pork. But Sen. Imee has an allocable there worth P2.5-billion in the NEP, based on the Cabral files),” Lacson said in an interview over Radio DZBB.“Yung iba naman for later release (FLR); meron din si Sen. Imee dun, kung di ako nagkakamali, kung hindi P2.5-billion, nasa P3.5-billion. At yung FLR niya, may mga na-release duon (The others are ‘for later release; Sen. Imee also has the same, if I’m not mistaken, if not P2.5-billion, it’s around P3.5-billion. And some of her FLRs have already been released),” he said.“Eh kung ganun definition niya ng pork, eh siya yung merong pork. So wala siyang moral ascendancy para icriticize ...unang-una member siya ng bicam. Bakit hindi siya nag-raise ng issue? Na ‘uy tadtad ng pork barrel to’—wala naman tayong narinig sa kanya. Pero nandoon siya sa bicam (If that is her definition of pork, then she’s the one who has ‘pork.’ So she has no moral ascendancy to criticize (the budget), first of all, she’s a member of the bicameral conference committee. Why didn’t she raise the issue back then? Say ‘the budget is so full of pork barrel’—we didn’t hear anything from her. But she was present during the bicam),” Lacson pointed out.But other than this, the Senate Blue Ribbon Committee chairman said he cannot understand Marcos’ criticisms against the panel which is investigating the anomalies in the government’s flood control projects. Lacson is pointing to Marcos’ claims that she and other members of the Senate minority bloc are being limited or blocked from speaking during the Blue Ribbon hearing’s investigations.“Di ko alam sinong sinasabi niyang nagbabawal: ako ba yun? Or Malacañang ba nagbabawal? Na hindi naman totoo (I don’t know who she was referring: was it me? Or was it Malacañang that is prohibiting them)?” “Kasi kung may pressure, kilala niyo naman ako, hindi niyo naman ako maiimpluwensiyahan, kung sabihin na huwag niyo idawit si (former) Speaker (Martin) Romualdez (Because if there was ever some pressure, you know me. I’m can’t be influenced. If someone says not to mention former House Speaker Martin Romualdez),” “Sa katunayan, nababanggit nga si Speaker Romualdez, pero wala naman magagawa ang Senate blue ribbon committee kasi di ba sinabi ko kung saan kami dadalhin ng ebidensya, dun kami pupunta (In fact, the former Speaker Romualdez was mentioned, but the Senate blue ribbon committee cannot do anything, as I’ve said, we will go where the evidence will lead us),” “Eh wala naman talagang direktang nag-implicate kay Speaker Romualdez kundi si (Sgt. Orly) Guteza (But no one really directly implicated Romualdez except Guteza),” Lacson argued.Unfortunately, the former Philippine National Police (PNP) chief said Guteza has yet to back up his claims on Romualdez’s and former Rep. Zaldy Co’s involvement in the alleged anomalous and ghost flood control projects. “Eh si Guteza naman nawawala, kung si Guteza sumulpot lang sa DOJ, sa Ombudsman or sa ICI, pagkatapos ng pagdinig sa BR, at itoy sinumpaan niya rin at inaffirm niya ang kanyang tinestify sa Senado, dun niya inimplicate si Speaker Romualdez at si Zaldy Co, at kung sino sino pa eh di sana buhay na buhay yung kaso against Speaker Romualdez (Guteza is missing, but if Guteza appeared before the Department of Justice, the Ombudsman or the Independent Commission for Infrastructure, and here ate the blue ribbon hearing, and he swore and affirmed and testimony before the Senate, since he implicated Romualdez and Co here, and the other personalities, then, maybe the case against Romualdez would still be very much alive,” he pointed out.“Ang problema sumulpot siya minsan tas nawala na siyang parang bula...Katunayan hanggang ngayon nawawala siya (the problem is, he appeared once then suddenly went missing. In fact, until now he is missing),” he lamented.Lacson said that by insulting the Blue Ribbon Committee, she is undermining its integrity. “Nasabi ko na ito (I’ve said it before): the best response to nonsense is silence, pero kapag nang-iinsulto na hindi rin mo na rin pwedeng i-disregard. Iniinsulto niya ang Blue Ribbon. Inuundermine niya ang itengridad ng komite na member din siya (but if she resorts to insulting, we cannot just disregard that. She is insulting the Blue Ribbon, she is undermining the integrity of the committee of which she is a member),” he pointed out.Senate’s counterpart ‘meow-meow’?Asked who he believe could be behind Sen. Marcos\\' actions, Lacson said he doesn’t know what their end game is.“Baka gusto niyang (Sen. Imee) mag-apply ng ‘meow meow’ ng Senado. Eh kung ano-ano ang sinasabi niya. Baka gusto niyang maging counterpart. Ayaw naming magkaroon ng ‘meow-meow’ sa Senate pero parang may gusto may mag apply (She might want to apply to be the ‘meow-meow’ of the Senate. She’s been saying whatever. She might want to be the counterpart. We don’t want a ‘meow-meow’ in the Senate but it seems she wants to apply),” he pointed out.Lacson said he is still puzzled why some senators, particularly Marcos and Sen. Rodante Marcoleta, seem intent on disrupting the Blue Ribbon hearings, with Marcoleta earlier questioning Lacson\\'s objectivity.Lacson also declined to speculate on claims that the “pork” in the 2026 budget would be dangled before House members for the impeachment of Vice President Sara Duterte.“Under the Constitution, the House has the power to impeach, and the Senate has the power to convict or acquit. So since we could be senator-judges in a potential impeachment case, we cannot comment especially on the merits of the case,” he pointed out.",
    "source": "Manila Bulletin",
    "publishedAt": "2026-01-11 08:06:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://mb.com.ph/article/10900977/philippines/national/span-stylecolor-rgb0-0-0-font-family-gilroy-font-size-15px-font-weight-400-text-align-left-white-space-collapse-collapse-display-inline-importantsiya-yung-nag-iingay-lacson-flags-p25-b-allocables-tied-to-imee-marcos-in-2025-nepspan"
  },
  {
    "title": "Scots brace for snow BLIZZARDS amid amber warning as cops warn ‘do not travel’",
    "description": "SCOTS have been warned to brace for more blizzards today after police issued a 'do not travel' warning and weather alerts were upgraded to amber by the Met Office. The severe warning was issued as the country prepares for more snow chaos and sub-zero temperatures, which could lead to flooding and black ice. The weather...",
    "source": "The Scottish Sun",
    "publishedAt": "2026-01-11 08:06:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.thescottishsun.co.uk/news/15786139/scots-brace-snow-blizzards-cops-warn-do-not-travel/"
  },
  {
    "title": "D-II quarterback transfer joins UA",
    "description": "FAYETTEVILLE-- Angelo State junior transfer quarterback Braeden Fuller signed to play at the University of Arkansas on Saturday during his official visit.",
    "source": "Nwaonline",
    "publishedAt": "2026-01-11 08:06:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.nwaonline.com/news/2026/jan/11/d-ii-quarterback-transfer-joins-ua/"
  },
  {
    "title": "'BBC' eyes Christine Lampard as new Strictly presenter",
    "description": "'BBC' eyes Christine Lampard as new Strictly presenterChristine Lampard reportedly has become the most desirable choice to host Strictly Come Dancing after leaving ITV's Lorraine.The presenter, 46, can now make use of her time following her final stint hosting the daytime TV show...",
    "source": "Geo Tv",
    "publishedAt": "2026-01-11 08:06:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.geo.tv/latest/644443-bbc-eyes-christine-lampard-as-new-strictly-presenter"
  },
  {
    "title": "Bomb attacks on Thailand petrol stations injure 4",
    "description": "BANGKOK: Assailants detonated bombs at nearly a dozen petrol stations in Thailand’s south early Sunday, injuring four people, the army said, the latest attacks in the insurgency-hit region.",
    "source": "New Straits Times",
    "publishedAt": "2026-01-11 08:05:59",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.nst.com.my/world/region/2026/01/1354552/bomb-attacks-thailand-petrol-stations-injure-4"
  },
  {
    "title": "Sourav Ganguly on coaching in SA20, India’s World Cup chances and more",
    "description": "Sourav Ganguly on coaching in SA20, India’s World Cup chances and more",
    "source": "The Times Of India",
    "publishedAt": "2026-01-11 08:05:56",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://timesofindia.indiatimes.com/videos/sports/cricket/sourav-ganguly-on-coaching-in-sa20-indias-world-cup-chances-and-more/videoshow/126462871.cms"
  },
  {
    "title": "Funeral Programme for the Late Darlington Sandati",
    "description": "By A Correspondent-The husband of former Zimbabwe Broadcasting Corporation (ZBC) vernacular news anchor Evermore Sandati, Mr Tendayi Darlington Sandati, who ... Continue reading \"Funeral Programme for the Late Darlington Sandati\"",
    "source": "Zimbabwe News",
    "publishedAt": "2026-01-11 08:05:53",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.zimeye.net/2026/01/11/funeral-programme-for-the-late-darlington-sandati/"
  },
  {
    "title": "New protests hit Iran as alarm grows over crackdown 'massacre'",
    "description": "New protests hit Iran as alarm grows over crackdown 'massacre'",
    "source": "Khaleej Times",
    "publishedAt": "2026-01-11 08:05:50",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.khaleejtimes.com/world/mena/new-protests-hit-iran-alarm-grows-over-crackdown-massacre"
  }
]