[
  {
    "title": "Fenerbahce vs Samsunspor - prediction, team news, lineups",
    "description": "Sports Mole previews Tuesday's Turkish Super Cup semi final between Fenerbahce and Samsunspor, including predictions, team news and possible lineups.",
    "source": "Sports Mole",
    "publishedAt": "2026-01-04 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.sportsmole.co.uk/football/fenerbahce/preview/fenerbahce-vs-samsunspor-prediction-team-news-lineups_589186.html"
  },
  {
    "title": "Operation Absolute Resolve: Why Trump Went Off Script And Why It Will Not Matter",
    "description": "Operation Absolute Resolve: Why Trump Went Off Script And Why It Will Not Matter Authored by Jonathan Turley,It can fairly be said that the most precarious jobs in the world are those of a golf ball collector at a driving range, a mascot at a Chuck E. Cheese, and a Trump Administration lawyer.That was evident at the press conference yesterday as President Donald Trump blew apart the carefully constructed narrative presented earlier for the seizure of Venezuelan President Nicolás Maduro and his wife, Cilia Flores. Some of us had written that Trump had a winning legal argument by focusing on the operation as the seizure of two indicted individuals in reliance on past judicial rulings, including the decisions in the case of former Panamanian dictator Manuel Noriega.Secretary of State Marco Rubio and General Dan Caine stayed on script and reinforced this narrative. Both repeatedly noted that this was an operation intended to bring two individuals to justice and that law enforcement personnel were part of the extraction team to place them into legal custody. Rubio was, again, particularly effective in emphasizing that Maduro was not the head of state but a criminal dictator who took control after losing democratic elections.However, while noting the purpose of the capture, President Trump proceeded to declare that the United States would engage in nation-building to achieve lasting regime change. He stated that they would be running Venezuela to ensure a friendly government and the repayment of seized U.S. property dating back to the government of Hugo Chávez.This city is full of self-proclaimed Trump whisperers who rarely score above random selection in their predictions. However, there are certain pronounced elements in Trump’s approach to such matters. First, he is the most transparent president in my lifetime with prolonged (at times excruciatingly long) press conferences and a brutal frankness about his motivations. Second, he is unabashedly and undeniably transactional in most of his dealings. He is not ashamed to state what he wants the country to get out of the deal.In Venezuela, he wants a stable partner, and he wants oil.Chávez and Maduro had implemented moronic socialist policies that reduced one of the most prosperous nations to an economic basket case. They brought in Cuban security thugs to help keep the population under repressive conditions, as a third fled to the United States and other countries.After an extraordinary operation to capture Maduro, Trump was faced with socialist Maduro allies on every level of the government. He is not willing to allow those same regressive elements to reassert themselves.The problem is that, if the purpose was regime change, this attack was an act of war, which is why Rubio struggled to bring the presser back to the law enforcement purpose. I have long criticized the erosion of the war declaration powers of Congress, including my representation of members of Congress in opposition to Obama’s Libyan war effort.The fact, however, is that we lost that case. Trump knows that. Courts have routinely dismissed challenges to undeclared military offensives against other nations. In fairness to Trump, most Democrats were as quiet as church mice when Obama and Hillary Clinton attacked Libya’s capital and military sites to achieve regime change without any authorization from Congress. They were also silent when Obama vaporized an American under this “kill list” policy without even a criminal charge. So please spare me the outrage now.My strong preferences for congressional authorization and consultation are immaterial. The question I am asked as a legal analyst is whether this operation would be viewed as lawful. The answer remains yes.The courts have previously upheld the authority of presidents to seize individuals abroad, including the purported heads of state. This case is actually stronger in many respects than the one involving Noriega. Maduro will now make the same failed arguments that Noriega raised. He should lose those challenges under existing precedent. If courts apply the same standards to Trump (which is often an uncertain proposition), Trump will win on the right to seize Maduro and bring him to justice.But then, how about the other rationales rattled off at Mar-A-Lago? In my view, it will not matter. Here is why.The immediate purpose and result of the operation was to capture Maduro and to bring him to face his indictment in New York. That is Noriega 2.0.The Administration put him into custody at the time of extraction with law enforcement personnel and handed him over to the Justice Department for prosecution.The Trump Administration can then argue that it had to deal with the aftermath of that operation and would not simply leave the country without a leader or stable government.Trump emphasized that “We’re going to run the country until such time as we can do a safe, proper and judicious transition.”I still do not like the import of those statements. Venezuelans must be in charge of their own country and our role, if any, must be to help them establish a democratic and stable government. Trump added that “We can’t take a chance that somebody else takes over Venezuela that doesn’t have the good of the Venezuelan people in mind.”The devil is in the details. Venezuelans must decide who has their best interests in mind, not the United States.However, returning to the legal elements, I do not see how a court could free Maduro simply because it disapproves of nation-building. Presidents have engaged in such policies for years. The aftermath of the operation is distinct from its immediate purpose.Trump can argue that, absent countervailing action from Congress, he has the authority under Article II of the Constitution to lay the foundation for a constitutional and economic revival in Venezuela.He will leave it to his lawyers to make that case. It is not the case that some of us preferred, but it is the case that he wants to be made. He is not someone who can be scripted. It is his script and he is still likely to prevail in holding Maduro and his wife for trial. Tyler DurdenSun, 01/04/2026 - 15:10",
    "source": "Zerohedge",
    "publishedAt": "2026-01-04 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.zerohedge.com/geopolitical/operation-absolute-resolve-why-trump-went-script-and-why-it-will-not-matter"
  },
  {
    "title": "Liverpool hero STAYING after major transfer failure",
    "description": "One Liverpool hero has been told he's staying after a major transfer failure. It's a bold decision but the correct one.The transfer window is now open and Liverpool have business to do. There's simply...",
    "source": "Yahoo! News",
    "publishedAt": "2026-01-04 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://ca.sports.yahoo.com/news/liverpool-hero-staying-major-transfer-201000929.html"
  },
  {
    "title": "U.S. lifts Caribbean airspace curbs after attack on Venezuela",
    "description": "The United States advised airlines on Saturday ‌that its Caribbean airspace curbs would expire at midnight ET (0500 GMT) and flights could resume as schedules are quickly updated, Transportation Secretary Sean Duffy said.",
    "source": "Hawaii News",
    "publishedAt": "2026-01-04 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.staradvertiser.com/2026/01/04/breaking-news/u-s-lifts-caribbean-airspace-curbs-after-attack-on-venezuela/"
  },
  {
    "title": "The Old-School Kitchen Appliance Nobody Uses Anymore",
    "description": "Modern kitchens rely on refrigeration, but that was not always the case. One once-essential appliance quietly faded as food storage methods evolved.",
    "source": "Yahoo! News",
    "publishedAt": "2026-01-04 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://ca.style.yahoo.com/old-school-kitchen-appliance-nobody-201000114.html"
  },
  {
    "title": "Cowboys DE Donovan Ezeiruaku ejected from loss to Giants early after ripping Greg Van Roten's helmet off",
    "description": "Things erupted in the third quarter on Sunday afternoon after a Giants touchdown extended their lead over the Cowboys.",
    "source": "Yahoo! News",
    "publishedAt": "2026-01-04 20:09:59",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://sports.yahoo.com/nfl/breaking-news/article/cowboys-de-donovan-ezeiruaku-ejected-from-loss-to-giants-early-after-ripping-greg-van-rotens-helmet-off-200959022.html"
  },
  {
    "title": "Cowboys DE Donovan Ezeiruaku ejected from game vs. Giants early after ripping Greg Van Roten's helmet off",
    "description": "Things erupted in the third quarter on Sunday afternoon after a Giants touchdown extended their lead over the Cowboys.",
    "source": "Yahoo! News",
    "publishedAt": "2026-01-04 20:09:59",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://sports.yahoo.com/nfl/breaking-news/article/cowboys-de-donovan-ezeiruaku-ejected-from-game-vs-giants-early-after-ripping-greg-van-rotens-helmet-off-200959308.html"
  },
  {
    "title": "Sanchez’s 18 lead Central Connecticut State over New Haven 72-61",
    "description": "NEW BRITAIN, Conn. (AP) — Melo Sanchez had 18 points in Central Connecticut State’s 72-61 victory over New Haven on Sunday. Sanchez went 6 of 8 from the field (6 for 7 from 3-point range) for the Blue Devils (7-6, 1-1 Northeast Conference). Jay Rodgers added 17 points and had seven assists. Darin Smith Jr. The post Sanchez’s 18 lead Central Connecticut State over New Haven 72-61 appeared first on Medicine Hat News.",
    "source": "Medicine Hat News",
    "publishedAt": "2026-01-04 20:09:58",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://medicinehatnews.com/sports/national-sports/2026/01/04/sanchezs-18-lead-central-connecticut-state-over-new-haven-72-61/"
  },
  {
    "title": "Sanchez’s 18 lead Central Connecticut State over New Haven 72-61",
    "description": "NEW BRITAIN, Conn. (AP) — Melo Sanchez had 18 points in Central Connecticut State’s 72-61 victory over New Haven on Sunday. Sanchez went 6 of 8 from the field (6 for 7 from 3-point range) for the Blue Devils (7-6, 1-1 Northeast Conference). Jay Rodgers added 17 points and had seven assists. Darin Smith Jr. The post Sanchez’s 18 lead Central Connecticut State over New Haven 72-61 appeared first on The Lethbridge Herald - News and Sports from around Lethbridge.",
    "source": "The Lethbridge Herald",
    "publishedAt": "2026-01-04 20:09:58",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://lethbridgeherald.com/sports/national-sports/2026/01/04/sanchezs-18-lead-central-connecticut-state-over-new-haven-72-61/"
  },
  {
    "title": "Sanchez's 18 lead Central Connecticut State over New Haven 72-61",
    "description": "NEW BRITAIN, Conn. (AP) — Melo Sanchez had 18 points in Central Connecticut State's 72-61 victory over New Haven on Sunday.",
    "source": "The Star",
    "publishedAt": "2026-01-04 20:09:58",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.thestar.com/sports/basketball/sanchezs-18-lead-central-connecticut-state-over-new-haven-72-61/article_beb8fce4-5583-500a-bdfe-3878ca78e0f8.html"
  }
]