[
  {
    "title": "U.S. aircraft carrier arrives in the Middle East as tensions with Iran remain high",
    "description": "WASHINGTON — The aircraft carrier USS Abraham Lincoln and three accompanying warships have arrived in the Middle East, bringing a renewed potential that President Donald Trump could opt to order airstrikes on Iran over its crackdown on protesters.",
    "source": "Home | Triblive.com",
    "publishedAt": "2026-01-26 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://triblive.com/news/world/u-s-aircraft-carrier-arrives-in-the-middle-east-as-tensions-with-iran-remain-high/"
  },
  {
    "title": "Australia news LIVE: Ley’s allies confident she will remain party leader; Melbourne to swelter in worst heatwave since Black Saturday",
    "description": "Follow along as we bring you the latest live news updates from Australia and beyond.",
    "source": "The Age",
    "publishedAt": "2026-01-26 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.theage.com.au/national/australia-news-live-ley-s-allies-confident-she-will-remain-party-leader-melbourne-to-swelter-in-worst-heatwave-since-black-saturday-20260127-p5nx6r.html"
  },
  {
    "title": "Builder buys 53 townhouse sites in St. Pete waterfront development for $12M",
    "description": "Mattamy Homes has bought 53 townhouse sites in St. Petersburg’s Amara Bay Residences & Marina master-planned community currently under construction.The sites at 12000 Gandy Blvd. sold for $12.64 million.Collier, which brokered the deal and announced the sale, says in a statement that the lots are fully entitled and approved as part of the master-planned community.Construction of the townhouses is expected to begin in coming weeks with sales starting in the summer.Mattamy Homes, Collier says in a statement, will develop two townhome designs with two stories of living space. They will range from 2,371 square feet to 2,470 square feet with three to four bedrooms, two-and-a-half baths and two-car garages. Pricing is expected to start in the $700,000s.Amara Bay is a 39-acre mixed-use development just as you come into Pinellas County from the Gandy Bridge.It is being developed by the Miami firm Key Development, which sold the lots to Mattamy Homes.Plans for the master-planned community call for 415 luxury apartments, a 150-slip marina, an 8,000-square-foot restaurant and 3,000 feet of walkable waterfront. Other amenities will include two pools, a clubhouse and a boardwalk with fitness paths and a kayak launch.Key Development, which secured a $120 million construction loan last year, began work on the project in 2024 with the first buildings are expected to be done later this year.Mark Eilers of Colliers represented Key International in the sale.",
    "source": "Business Observer",
    "publishedAt": "2026-01-26 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://businessobserverfl.com/news/2026/jan/26/homebuilder-pays-12-m-for-53-st-petersburg-lots-in-waterfront-development/"
  },
  {
    "title": "Australia news LIVE: Ley’s allies confident she will remain party leader; Melbourne to swelter in worst heatwave since Black Saturday",
    "description": "Follow along as we bring you the latest live news updates from Australia and beyond.",
    "source": "Brisbane Times",
    "publishedAt": "2026-01-26 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.brisbanetimes.com.au/national/australia-news-live-ley-s-allies-confident-she-will-remain-party-leader-melbourne-to-swelter-in-worst-heatwave-since-black-saturday-20260127-p5nx6r.html"
  },
  {
    "title": "Hand Shape Found in Indonesian Cave May Be the Oldest Rock Art Ever Discovered",
    "description": "A faded outline of a human hand found on a cave wall in Indonesia may officially be the oldest known rock art in the world, according to archaeologists who...",
    "source": "Yahoo! News",
    "publishedAt": "2026-01-26 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.yahoo.com/news/articles/hand-shape-found-indonesian-cave-201000281.html"
  },
  {
    "title": "'Surprisingly productive' - Hadjar's verdict as Red Bull top first testing day",
    "description": "Isack Hadjar admitted his surprise at Red Bull's \"productive\" and \"smooth\" performance after topping the timesheet at the first day of Formula 1 pre-season testing in Barcelona.",
    "source": "Sky Sports",
    "publishedAt": "2026-01-26 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.skysports.com/f1/news/12040/13499374/f1-testing-red-bull-driver-isack-hadjar-surprised-by-strong-performance-on-first-day-in-barcelona-as-george-russell-also-impressed"
  },
  {
    "title": "New data show reduced overall PFAS exposures in subarctic ocean",
    "description": "Beginning in the early 2000s, some of the most common and well-studied PFAS were phased out through a combination of industry shifts and international regulations. A new study from Harvard has found that since that phaseout, North Atlantic pilot whales have 60% lower concentrations of these chemicals in their bodies. PFAS, or per- or polyfluoroalkyl substances, are ubiquitous in modern life. First produced at the end of World War II, these chemicals are in everything from furniture and cosmetics to food packaging, nonstick pans and clothing. They have also infiltrated our water, soil, and food, making PFAS a major concern for human and ecological health.",
    "source": "Phys.org",
    "publishedAt": "2026-01-26 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://phys.org/news/2026-01-pfas-exposures-subarctic-ocean.html"
  },
  {
    "title": "Decatur City Schools on two-hour delay Tuesday",
    "description": "Decatur City Schools will be on a two-hour delay Tuesday.",
    "source": "Decatur Daily",
    "publishedAt": "2026-01-26 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.decaturdaily.com/news/morgan_county/decatur/decatur-city-schools-on-two-hour-delay-tuesday/article_2eb69965-6f9d-4944-a53f-3887b528cd51.html"
  },
  {
    "title": "U.S. business borrowing for equipment rises over 5% in December, ELFA says - Mon, 26 Jan 2026 PST",
    "description": "U.S. companies borrowed 5.9% more to finance equipment purchases in December than a year earlier, reaching the second-highest level ever, the Equipment Leasing and Finance Association said on Monday.",
    "source": "Spokesman",
    "publishedAt": "2026-01-26 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "http://www.spokesman.com/stories/2026/jan/26/us-business-borrowing-for-equipment-rises-over-5-i/"
  },
  {
    "title": "Teen fighting for life after alleged hit and run by South Coast driver high on cocaine, ecstasy",
    "description": "A teenager was standing on a footpath when a vehicle allegedly left the road and struck him.",
    "source": "Illawarra Mercury",
    "publishedAt": "2026-01-26 20:09:59",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.illawarramercury.com.au/story/9161417/teen-critical-after-alleged-ulladulla-hit-and-run-crash/"
  }
]