[
  {
    "title": "City Announces Closing, Delays Due to Impending Winter Storm",
    "description": "Republic Services has informed the City of Sweetwater that due to anticipated inclement weather, Friday trash routes will begin early at 4:30 a.m. Residents should make sure your bins are at the curb before then for collection.",
    "source": "Sweetwater Reporter",
    "publishedAt": "2026-01-22 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.sweetwaterreporter.com/news/city-announces-closing-delays-due-to-impending-winter-storm/article_6edad2cc-9c5d-4593-b316-14a6062c79af.html"
  },
  {
    "title": "US airlines offer to waive fees ahead of big winter storm",
    "description": "U.S. airlines are already announcing backup plans for passengers ahead of an expected winter storm this weekend that could be the biggest of the season and cause massive disruptions to air traffic nationwide.",
    "source": "Unionleader",
    "publishedAt": "2026-01-22 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.unionleader.com/news/business/us-airlines-offer-to-waive-fees-ahead-of-big-winter-storm/article_c82be69c-bcde-42e2-8a0a-2066cf445ed6.html"
  },
  {
    "title": "View: Everton may have suffered double transfer blow after Man United exit announcement",
    "description": "Everton had been linked with a move to sign Kobbie Mainoo. David Moyes needs to start seeing transfer movement at Everton if they are to...The post View: Everton may have suffered double transfer blow after Man United exit announcement appeared first on Goodison News.",
    "source": "Goodison News",
    "publishedAt": "2026-01-22 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.goodisonnews.com/2026/01/22/man-united-announcement-serves-as-double-blow-for-everton-as-kobbie-mainoo-answer-comes-clear/"
  },
  {
    "title": "The Indie Bestseller List for the week ending Jan. 18, 2026",
    "description": "Hardcover Fiction 1. The Correspondent: Virginia Evans, Crown, $28. 2. Heart the Lover: Lily King, Grove Press, $28. 3. The First Time I Saw Him: Laura Dave, Scribner, $29. 4. The Loneliness of Sonia and Sunny: Kiran Desai, Hogarth, $32. 5. Wild Dark Shore: Charlotte McConaghy, Flatiron Books, $28.99. 6. My Friends: Fredrik Backman, Atria Books, [...]",
    "source": "Daily Freeman",
    "publishedAt": "2026-01-22 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.dailyfreeman.com/2026/01/22/the-indie-bestseller-list-for-the-week-ending-jan-18-2026/"
  },
  {
    "title": "West Virginia men's basketball hopes hard times are in the past, but time is running out",
    "description": "MORGANTOWN, W.Va. — Time, West Virginia men's basketball coach Ross Hodge warned on Wednesday night, is not on his Mountaineers' side this year.",
    "source": "Wv News",
    "publishedAt": "2026-01-22 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.wvnews.com/bluegoldnews/west-virginia-mens-basketball-hopes-hard-times-are-in-the-past-but-time-is-running/article_55c326d6-578b-4b18-a903-7ecff50d7f57.html"
  },
  {
    "title": "Road salt shortage in Worcester County town prompts travel concerns",
    "description": "\"We appreciate residents' patience and cooperation as we work through this temporary supply issue,\" police said.",
    "source": "Wcvb",
    "publishedAt": "2026-01-22 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.wcvb.com/article/templeton-winter-storm-salt-shortage/70093853"
  },
  {
    "title": "Tax season alert: Scammers target your money and data",
    "description": "Tax season is here, and with it comes the potential for tax preparer scams.",
    "source": "Wink News",
    "publishedAt": "2026-01-22 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.winknews.com/news/consumer/tax-season-alert-scammers-target-your-money-and-data/article_3c9ed330-3bdd-46df-b030-0ca17a1730b5.html"
  },
  {
    "title": "Air Search plane cleared for take off",
    "description": "A GLOBAL administrative issue which left the Channel Islands without a search and rescue plane has been resolved, clearing the Lions’ Pride for take off. The Channel Islands Air Search plane had been forced out of service after the United States Federal Aviation Administration ruled that the registration company handling its paperwork was found to [...]The post Air Search plane cleared for take off appeared first on Jersey Evening Post.",
    "source": "Jersey Evening Post",
    "publishedAt": "2026-01-22 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://jerseyeveningpost.com/news-ge/2026/01/22/cias-plane-cleared-for-take-off/"
  },
  {
    "title": "High-end Tampa home remodeling firm expanding into Orlando, plans 70 jobs",
    "description": "Revive Design and Renovation, a Tampa-based home remodeling company, is expanding into the Orlando market with a new $750,000 showroom and 70 employees.The new Revive showroom will be at 601 S. New York Ave. in Winter Park. The 5,000-square-foot shop is currently under construction and expected to open this spring.(The property is the former home of Ethos Vegan Kitchen, a restaurant that closed in 2024.)Justin Caballero, Revive’s founder and president, says in a statement that the company is investing in the Orlando market because it “sees the same dynamics that fueled our success in Tampa, rapid growth, strong home values, and a high concentration of homes ready for thoughtful, award-winning, high-end renovations.”The company says it expects to profit from a strong demand for remodels in Orlando’s Windemere neighborhood and Winter Park.Revive Design and Renovation’s Tampa showroom and design center is at 3102 W. Kennedy Blvd. Founded in 2020, it serves clients both in the Tampa Bay and Sarasota markets, with, a spokesperson says, its Sarasota work focused on high-end beach front homes and in Lakewood Ranch.The spokesperson says in an email that the Tampa operation supports more than 200 jobs, including full-time project managers, designers and in-house craftsmen, as well as subcontractors and suppliers.The Orlando center, according to the statement, will create those 70 jobs mostly in the same categories.Revive was ranked No. 81 on the Inc. 5000 list of fastest growing companies in the U.S. in August. According to the publication, it saw 3,947% growth over three years.",
    "source": "Business Observer",
    "publishedAt": "2026-01-22 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://businessobserverfl.com/news/2026/jan/22/tampa-remodler-expanding-orlando/"
  },
  {
    "title": "U.S. dollar ticks down",
    "description": "NEW YORK, Jan. 22 (Xinhua) -- The U.S. dollar weakened in late trading on Thursday. Read full story",
    "source": "The Star",
    "publishedAt": "2026-01-22 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.thestar.com.my/news/world/2026/01/23/us-dollar-ticks-down"
  }
]