[
  {
    "title": "Federal officials double down on Border Patrol actions in deadly Minneapolis shooting",
    "description": "Border Patrol Commander-at-Large Greg Bovino continued to defend the actions of federal agents during a news conference on Sunday in the deadly shooting of 37-year-old Alex Pretti in south Minneapolis on Saturday. CBS News' Lilia Luciano and Nicole Sganga have more.",
    "source": "Cbs News",
    "publishedAt": "2026-01-25 20:11:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.cbsnews.com/video/federal-officials-double-down-on-border-patrol-actions-in-deadly-minneapolis-shooting/"
  },
  {
    "title": "Bad Bunny Has Already Been a Part of the Most ‘Culturally Relevant’ Super Bowl Halftime Show of All Time",
    "description": "In February, Bad Bunny will get onstage at the Super Bowl for the second time. His first performance was very culturally relevant.",
    "source": "Showbiz Cheatsheet",
    "publishedAt": "2026-01-25 20:11:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.cheatsheet.com/news/bad-bunny-already-part-culturally-relevant-super-bowl-halftime-show-time.html/"
  },
  {
    "title": "‘She’s fun to coach’: Why Geno Auriemma embraces chaos in UConn freshman Blanca Quinonez",
    "description": "SOUTH ORANGE, N.J. — Any time Blanca Quinonez steps on the court for the UConn women’s basketball team, her presence is an instant antidote to sluggishness. The freshman forward made her first appearance in Saturday’s win at Seton Hall three minutes into the first quarter while Huskies were in the midst of their worst start of the season. They gave up a 6-0 opening run to the Pirates, and ...",
    "source": "Yahoo! News",
    "publishedAt": "2026-01-25 20:11:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://sports.yahoo.com/articles/she-fun-coach-why-geno-201100921.html"
  },
  {
    "title": "Minnesota Gov. Tim Walz says \"this is an inflection point\" after fatal shooting of Alex Pretti",
    "description": "Minnesota Gov. Tim Walz and the state's Attorney General Keith Ellison gave an update on Sunday in the aftermath of Border Patrol's fatal shooting of Alex Pretti.",
    "source": "Cbs News",
    "publishedAt": "2026-01-25 20:11:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.cbsnews.com/video/minnesota-gov-tim-walz-says-this-is-an-inflection-point-after-fatal-shooting-of-alex-pretti/"
  },
  {
    "title": "Scientists Pioneer Reverse Solar Panels To Create Energy At Night",
    "description": "Scientists Pioneer Reverse Solar Panels To Create Energy At Night By Haley Zaremba of OilPrice Scientists at the University of New South Wales (UNSW) are developing a \"reverse solar\" panel, called a thermoradiative diode, which generates electricity by emitting infrared light (heat) into cold...",
    "source": "Biztoc",
    "publishedAt": "2026-01-25 20:10:57",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://biztoc.com/x/f11503045ec09f09"
  },
  {
    "title": "Dozens of Airports Close as Winter Storm Fern Cancels Thousands of Flights",
    "description": "A massive winter storm known as Fern forced airlines to cancel more than 10,000 U.S. flights Sunday and effectively shut down operations at some of the nation’s busiest airports across the Northeast and Mid-Atlantic.The National Airspace System Status listed 30 airports that were closed as of...",
    "source": "Biztoc",
    "publishedAt": "2026-01-25 20:10:52",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://biztoc.com/x/ef19bd39ad7ffbdb"
  },
  {
    "title": "NNPP crisis: Kano governor’s defection was inevitable — Former party leaders",
    "description": "Three former National Officers of the New Nigeria Peoples Party (NNPP) have described the defection of Kano State Governor, Abba Kabir Yusuf, as the most difficult yet strategically necessary decisionThe post NNPP crisis: Kano governor’s defection was inevitable — Former party leaders appeared first on The Nation Newspaper.",
    "source": "The Nation Newspaper",
    "publishedAt": "2026-01-25 20:10:52",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://thenationonlineng.net/nnpp-crisis-kano-governors-defection-was-inevitable-former-party-leaders/"
  },
  {
    "title": "Does TikTok's new Terms of Service track race, gender identity, and immigration status?",
    "description": "When U.S.-based TikTok users opened up the app on the morning of Jan. 23, many were met with a fresh pop-up. It was time to read the app's new Terms of Service (ToS) and there was only one option to continue using the app: Agree.The prompt came along with a change in the platform's ownership,...",
    "source": "Biztoc",
    "publishedAt": "2026-01-25 20:10:51",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://biztoc.com/x/c89a0cc837616017"
  },
  {
    "title": "The real reason Trump and MAGA are so quick to blame Minneapolis shooting victims",
    "description": "Alex Pretti was shot to death on the sidewalk of a street in Minneapolis after he didn’t leave when federal agents demanded he leave. Renee Good was shot to death in her car on a street in Minneapolis because she tried to leave when federal agents demanded she not.Advocates of President Donald...",
    "source": "Biztoc",
    "publishedAt": "2026-01-25 20:10:50",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://biztoc.com/x/918e7c59152a0105"
  },
  {
    "title": "US-India Relations Stronger on Republic Day",
    "description": "In a statement on Indias Republic Day US Secretary of State Marco Rubio extended warm regards underscoring the deep collaboration through the Quad between the US and India",
    "source": "Devdiscourse",
    "publishedAt": "2026-01-25 20:10:48",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.devdiscourse.com/article/law-order/3782449-us-india-relations-stronger-on-republic-day"
  }
]