[
  {
    "title": "Warrant: argument led to Waffle House shooting",
    "description": "According to an arrest warrant, a shooting at a Cookeville Waffle House last week allegedly occurred during an argument between the suspect and two others.",
    "source": "The Herald Citizen",
    "publishedAt": "2025-11-24 20:08:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.herald-citizen.com/news/warrant-argument-led-to-waffle-house-shooting/article_1dfe481c-afd8-5051-b937-3504c3faa938.html"
  },
  {
    "title": "Trump’s rhetoric may have escalated insecurity in Nigeria, Omojuwa tells US senator",
    "description": "Japheth Omojuwa, an author and political commentator, saysUS President Donald Trump’s remarks on Nigeria may have led to an upsurge ininsecurity in the country. He added that he did not share the notion that NigerianChristians feel reassured by Trump’s offer of protection from “persecution”. Omojuwa offered his perspective while posing a question toKevin Cramer, US senator, at the three-day Halifax International Security Forumin Canada. Omojuwa is a member of the Halifax Forum board. Before the influencer’s comments, Cramer said Christians inNigeria today are probably feeling “pretty good” about Trump’s position. Trump had threatened to send US troops “guns-a-blazing” intoNigeria, a country he called “disgraced”, to wipe out the “Islamist terrorists”he said were killing Christians. In a clip of his response to Cramer shared on X on Monday,Omojuwa said he offered a different view because he speaks as a Christianliving in Nigeria. “I do not feel good about Donald Trump. He called Nigeria adisgraced country. Frankly speaking, that’s not so bad, because he used to callus a shit hole country. So it’s a kind of improvement,” Omojuwa said. He followed by asking if powerful nations could offerassistance more respectfully, and without doing so in a way that leaves othersworse off. “For instance, America went to Libya. Libya has a causativeeffect on the terrorism challenges Nigeria and the Sahel are facing. I don’twant to talk about the other places America went to. Let’s just take it toNigeria,” he added. “Since Donald Trump said what he said for NigerianChristians, Christians have been abducted in the church in the north-west ofNigeria. “Muslim students have been abducted. I do not speak to thecausation but there’s a correlation from the point Donald Trump spoke aboutNigeria’s challenges and the escalation of terrorism. “So decency apart, there are rules of engagement, there’s arules based global order. Is there a way to speak about Nigeria, first of all,in a respectful, decent way, not even just as president of America, but as ahuman being?” Omojuwa also pointed to the failed arms deal between the USand Nigeria as playing a role in the weakened fight against terrorism. “Is there a way to decently help Nigeria without makingthings worse and without disrespecting Nigerian Christians and Muslims?” heasked. The US senator replied in the affirmative. “The right words help. A more delicate way of sayingsomething is obviously better than a more brutal way,” Cramer said. “A lot of people will say the right thing and do the wrongthing. Other people will maybe say the wrong thing and mean to do the rightthing. Is there a better way to say? Certainly.” However, the senator said he believed that foreign aidassistance would be more effective in stemming terrorism, noting that he hadpublicly disagreed with Trump multiple times on the aid cuts. “I think, globally speaking, aid to friends, and would-befriends, and possible friends is a bargain compared to munitions,” he said. Cramer also posited that assistance would need to suit localcontexts.",
    "source": "Nigeria News",
    "publishedAt": "2025-11-24 20:08:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.nigerianeye.com/2025/11/trumps-rhetoric-may-have-escalated.html"
  },
  {
    "title": "US judge tosses cases against ex-FBI chief Comey, New York AG James",
    "description": "WASHINGTON (Reuters) -A federal judge on Monday dismissed criminal charges against two perceived adversaries of President Donald Trump, FBI Director James Comey and New York Attorney General Letitia James, ruling the U.S. attorney he hand picked to prosecute them was unlawfully appointed. Read full story",
    "source": "The Star",
    "publishedAt": "2025-11-24 20:08:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.thestar.com.my/news/world/2025/11/25/us-judge-tosses-cases-against-ex-fbi-chief-comey-new-york-ag-james"
  },
  {
    "title": "Georgia lineman Nyier Daniels is dismissed from the team after his arrest following a police chase",
    "description": "Georgia offensive lineman Nyier Daniels has been dismissed from the team following his weekend arrest on multiple charges resulting from a high-speed police chase in the city of Commerce.",
    "source": "The Times And Democrat",
    "publishedAt": "2025-11-24 20:08:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://thetandd.com/article_970d390a-4eaa-4fd7-9226-cb81859a71a7.html"
  },
  {
    "title": "Netflix’s ‘The Herd’ sparks controversy over portrayal of Fulani herders",
    "description": "A new Nollywood crime thriller ‘The Herd‘ has ignited afierce online debate, with critics accusing it of unfairly stereotyping Fulaniherders as terrorists. The film, directed by Daniel Etim-Effiong, recently becameavailable on Netflix. Its plot follows a couple whose wedding day in south-westNigeria turns into a nightmare when their celebratory convoy is ambushed bygunmen disguised as cattle herders. The story quickly shifts from a joyous celebration to abrutal fight for survival.However, the movie’s central conflict has drawn significantcriticism on the social media platform X. Prominent voices, including former presidential aide BashirAhmad, have condemned the film for what they call “a dangerous profiling of anethnic group”. In a lengthy post, Ahmad argued that the scene depicting theattack “paints a picture that is dangerously inaccurate”. He expressed concern that the stereotyping fuels suspicionand violence against innocent Fulani people and could create an internationalstigma against the entire community. Ahmad concluded by calling on the Nigerian Film Corporation,led by Ali Nuhu, to investigate the film.The reason why some Arewa people are angry about The Herd movie is not because we are denying the reality of banditry, far from it. It is about the dangerous consequences of profiling an entire ethnic group and region that has already suffered immensely from years of insecurity.... pic.twitter.com/pOK69GCpWy— Bashir Ahmad, OON (@BashirAhmaad) November 22, 2025“Incredible timing by an American platform. But that’sprobably just a conspiracy theory, you see,” David Hundeyin, the Nigerianjournalist, wrote. Incredible timing by an American platform.But that's probably just a conspiracy theory, you see. https://t.co/ThzuIm5AO9— David Hundeyin (@DavidHundeyin) November 21, 2025Conversely, other social media users defended the film as anecessary reflection of Nigeria’s security realities. One user argued that ‘The Herd’ does not attack the Fulaniculture or innocent citizens, but rather “exposed armed Fulani terrorists whoare attacking Nigerians”. Below are some of the mixed reactions: For decades Nollywood portrayed Igbo people as r|tualists and pastors as false prophets. Christians didn’t raise any petition or outrage about canceling Netflix or banning the movies. THE HERD portrayed a Pastor as a co-conspirator, False prophet and Organ harvester. He... pic.twitter.com/seWi4i70KP— First Daughter (@Amakah101) November 22, 2025 For decades Nollywood portrayed Igbo people as r|tualists and pastors as false prophets. Christians didn’t raise any petition or outrage about canceling Netflix or banning the movies. THE HERD portrayed a Pastor as a co-conspirator, False prophet and Organ harvester. He... pic.twitter.com/seWi4i70KP— First Daughter (@Amakah101) November 22, 2025 I just finished watching The Herd. If you're angry because of the way any tribe was portrayed in that movie, then you're definitely part of Nigeria problem.This is the reality of what is going on in Nigeria.— Emmanuel....i ⚕️ (@AshE_Nuel) November 22, 2025 The anger from some of us in Arewa over \"The Herd\" isn't a denial of banditry, but a rejection of the film's dangerous stereotyping. The teaser explicitly portrays Fulani herders as synonymous with armed kidnappers, which is a facile and inaccurate narrative.We have... pic.twitter.com/MGAEfLuCEm— Arewa Ustaz (@UstazofArewa) November 22, 2025 I watched “The Herd” on Netflix, currently at No. 1 in Nigeria—and all I can say is this: it is a cinematic masterpiece. The storyline, the plot twists, the pacing... everything was brilliantly executed. If I have one thing to criticize, it’s the characterization. Some of the... pic.twitter.com/TqEjZFb5kr— Mubarak Umar (@Mubarack_Umar) November 22, 2025 The herd is a movie that speaks about Nigeria— oseni rufai (@ruffydfire) November 22, 2025 For decades Nollywood portrayed Igbo people as r|tualists and pastors as false prophets. Christians didn’t raise any petition or outrage about canceling Netflix or banning the movies. THE HERD portrayed a Pastor as a co-conspirator, False prophet and Organ harvester. He... pic.twitter.com/seWi4i70KP— First Daughter (@Amakah101) November 22, 2025 The Herd is one of the most engaging films I've seen this year. Everyone acted their hats off, especially the guys and girl that played bandits 💯— Ebuka Obi-Uchendu (@Ebuka) October 17, 2025 Ban Netflix Ban the herd Delete Netflix in your phone As a Muslim you have no business with this movie.Ban Netflix Repost https://t.co/ftXHCOwx4c— voice-of-Fulɓe (@Fulani_Tutor) November 21, 2025 \"The Herd\" movie is a poor attempt in trying to represent our reality in Nigeria. While the movie can be praised for its visuals and cinematography, the film pushes negative sterotypes, has a poor storyline, and ending.1. Negative sterotypes:-The movie portrays the Hausas as... pic.twitter.com/sHIirhIMvg— Daniel Regha (@DanielRegha) November 22, 2025 The HERD is an attempt by the Nollywood to spread hate and misinformation about the North.CANCEL NETFLIX ❌ for promoting this nonsense.These are IPOB Christian terrorists disguising as Boko Haram & Fulani herdsmen, warning president Tinubu and vowing to continue killing... pic.twitter.com/IvAhheXAPC— F A A R E E S 💫 🇵🇸 (@MFaarees_) November 23, 2025 For decades Nollywood portrayed Igbo people as r|tualists and pastors as false prophets. Christians didn’t raise any petition or outrage about canceling Netflix or banning the movies. THE HERD portrayed a Pastor as a co-conspirator, False prophet and Organ harvester. He... pic.twitter.com/seWi4i70KP— First Daughter (@Amakah101) November 22, 2025 The anger from some of us in Arewa over \"The Herd\" isn't a denial of banditry, but a rejection of the film's dangerous stereotyping. The teaser explicitly portrays Fulani herders as synonymous with armed kidnappers, which is a facile and inaccurate narrative.We have... pic.twitter.com/MGAEfLuCEm— Arewa Ustaz (@UstazofArewa) November 22, 2025 The Herd is a GREAT movie. I was locked in start to finish. This is what Nollywood needs!— VEE. (@veeiye) November 22, 2025 The Herd couldn’t have dropped at a more fitting moment. It mirrors Nigeria right now. Perfect casting, uncomfortable accuracy. @etimeffiong_ 💐 pic.twitter.com/p5OkEdXhwM— Sam OtigbaTM️ (@SamuelOtigba) November 21, 2025 The herd is a movie that speaks about Nigeria— oseni rufai (@ruffydfire) November 22, 2025 The anger over The Herd is surprising among the Northerners. A simple scene of cows on the road suddenly becomes an insult? Come on. That’s the everyday reality of herding in Nigeria. We can’t deny what we all see just because it touched a nerve. 🎬🐄 pic.twitter.com/M8PJevrcKx— Oboh Raphael (@WhizRaphidoo) November 22, 2025 The Herd couldn’t have dropped at a more fitting moment. It mirrors Nigeria right now. Perfect casting, uncomfortable accuracy. @etimeffiong_ 💐 pic.twitter.com/p5OkEdXhwM— Sam OtigbaTM️ (@SamuelOtigba) November 21, 2025The development comes as Nigeria is gripped by a severe andescalating security crisis in recent weeks, marked by a relentless wave ofbandit attacks and mass kidnappings. Several students and members of staff from the St. Mary’sSchool in Papiri, Agwara LGA of Niger state were abducted by gunmen in theearly hours of Friday. The incident followed the abduction of 25 female studentsfrom Government Girls Secondary School, Maga, Kebbi state on November 17. On Tuesday, a video of armed men attacking a branch of theChrist Apostolic Church (CAC) in Oke Isegun, Eruku community, Kwara state, wentviral.",
    "source": "Nigeria News",
    "publishedAt": "2025-11-24 20:08:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.nigerianeye.com/2025/11/netflixs-herd-sparks-controversy-over.html"
  },
  {
    "title": "Robert (Bob) Reid: Obituary",
    "description": "June 26, 1936 – October 16, 2025",
    "source": "Prince George Citizen",
    "publishedAt": "2025-11-24 20:08:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.princegeorgecitizen.com/obituaries/robert-bob-reid-obituary-11533367"
  },
  {
    "title": "A.J. Brown talks about the reasons for the loss to the Cowboys and 'winks' at Jalen Hurts",
    "description": "The Eagles' wide receiver spoke a lot and a little at the same time in a postgame interview following Sunday's loss in Dallas Leer",
    "source": "Marca Claro",
    "publishedAt": "2025-11-24 20:07:58",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.marca.com/en/nfl/philadelphia-eagles/2025/11/24/6924b7b0e2704eb2428b4575.html"
  },
  {
    "title": "Twitter’s Foreign Influence Problem Is Nothing New",
    "description": "Late last week, the X social media platform rolled out a new “location indicator” tool, plans for which had first been announced in October. Suddenly, it became much easier to get information on where in the world the site’s users are actually posting from, theoretically helping to illuminate inauthentic behavior, including attempted foreign influence. “It [...]",
    "source": "Mother Jones",
    "publishedAt": "2025-11-24 20:07:58",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.motherjones.com/politics/2025/11/twitters-foreign-influence-problem-is-nothing-new/"
  },
  {
    "title": "US judge tosses cases against ex-FBI chief Comey, New York AG James",
    "description": "WASHINGTON - A federal judge on Monday dismissed criminal charges against two perceived adversaries of President Donald Trump, FBI Director James Comey and New York Attorney General Letitia James, ruling the U.S. attorney he hand picked to prosecute them was unlawfully appointed.",
    "source": "Straitstimes",
    "publishedAt": "2025-11-24 20:07:57",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.straitstimes.com/world/us-judge-tosses-cases-against-ex-fbi-chief-comey-new-york-ag-james"
  },
  {
    "title": "Insecurity: FG should not shut down schools but protect them – Galadima",
    "description": "According to Galadima, the government should do away with physical security and deploy technology to protect Nigerians.The post Insecurity: FG should not shut down schools but protect them – Galadima appeared first on Vanguard News.",
    "source": "Vanguard News",
    "publishedAt": "2025-11-24 20:07:55",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.vanguardngr.com/2025/11/insecurity-fg-should-not-shut-down-schools-but-protect-them-galadima/"
  }
]