[
  {
    "title": "5-year wait ends: Bengaluru’s delayed Hosakerehalli flyover finally set to open in November",
    "description": "The project began in August 2020 with an initial deadline of just 15 months.",
    "source": "Hindustan Times",
    "publishedAt": "2025-10-30 05:23:26",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.hindustantimes.com/cities/bengaluru-news/5year-wait-ends-bengaluru-s-delayed-hosakerehalli-flyover-finally-set-to-open-in-november-101761801078575.html"
  },
  {
    "title": "Trump cuts China tariffs to 47pc after ‘amazing’ Xi meeting",
    "description": "BUSAN, Oct 30 — US President Donald Trump said today he had agreed to reduce tariffs on China to 47 per cent in ex...",
    "source": "Malay Mail",
    "publishedAt": "2025-10-30 05:22:52",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.malaymail.com/news/world/2025/10/30/trump-cuts-china-tariffs-to-47pc-after-amazing-xi-meeting/196589"
  },
  {
    "title": "Alausa’s skills-focused agenda gets support",
    "description": "With Nigeria’s over 230 million citizens under the age of 25, experts have harped on the need to equip the youth population with marketable skills to create a globally competitiveThe post Alausa’s skills-focused agenda gets support appeared first on The Nation Newspaper.",
    "source": "The Nation Newspaper",
    "publishedAt": "2025-10-30 05:22:07",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://thenationonlineng.net/alausas-skills-focused-agenda-gets-support/"
  },
  {
    "title": "Air Conditioning Compressor Market Projected to Reach US$ 41.1 Billion by 2032, Reports Persistence Market Research",
    "description": "The global Air Conditioning Compressor Market is entering a period of sustained growth, propelled by the increasing global demand for energy-efficient cooling solutions, rapid urbanization, and stringent environmental regulations. Valued at US$ 28.8 billion in 2025, the market is forecast",
    "source": "Openpr.com",
    "publishedAt": "2025-10-30 05:21:45",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.openpr.com/news/4246109/air-conditioning-compressor-market-projected-to-reach-us-41-1"
  },
  {
    "title": "Australia Courier, Express and Parcel Market Projected to Reach USD 17.7 Billion by 2033",
    "description": "The latest report by IMARC Group, titled \"Australia Courier, Express and Parcel (CEP) Market Report by Service Type (B2B (Business-to-Business), B2C (Business-to-Consumer), C2C (Customer-to-Customer)), Destination (Domestic, International), Type (Air, Ship, Subway, Road), End Use Sector (Services (BFSI- Banking, Financial Services",
    "source": "Openpr.com",
    "publishedAt": "2025-10-30 05:21:41",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.openpr.com/news/4246108/australia-courier-express-and-parcel-market-projected-to-reach"
  },
  {
    "title": "The Grand Egyptian Museum showcasing 50,000 artifacts is finally opening",
    "description": "article author: APAuthor: APID: 1761801406123663200Thu, 2025-10-30 05:11CAIRO: After two decades of anticipation and countless delays, the Grand Egyptian Museum is finally having its grand reveal.The museum, which is set to officially open Saturday, highlights Egypt’s ancient civilization and is a centerpiece of the government’s drive to boost the tourist industry, a major source of foreign currency in the cash-strapped country.Main category: Middle-EastTags: Ancient EgyptGrand Egyptian Museum (GEM)",
    "source": "Arab News Pk",
    "publishedAt": "2025-10-30 05:21:41",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.arabnews.pk/node/2620817/middle-east"
  },
  {
    "title": "UAE: Emirates named 2025 Best International Airline, wins multiple global awards",
    "description": "Emirates has been named Best International Airline for the second consecutive year, receiving multiple awards for its First Class and lounge services. The airline also won Best Long-Haul Airline and Middle East’s Leading Airline Brand. Recognized for its cabin crew, private suites, and network expansion to five new destinations, Emirates continues to lead in global air travel.",
    "source": "The Times Of India",
    "publishedAt": "2025-10-30 05:21:14",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://timesofindia.indiatimes.com/world/middle-east/uae-emirates-named-2025-best-international-airline-wins-multiple-global-awards/articleshow/124935101.cms"
  },
  {
    "title": "Trump says tariffs on China are dropping from 57% to 47% after talks on fentanyl curbs with Xi Jinping",
    "description": "ABOARD AIR FORCE ONE (AP) — President Donald Trump described his face-to-face with Chinese leader Xi Jinping on Thursday as a roaring success, saying he would cut tariffs on China, while Beijing had agreed to allow the export of rare earth elements and start buying American soybeans.",
    "source": "Boston Herald",
    "publishedAt": "2025-10-30 05:20:55",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.bostonherald.com/2025/10/30/trump-says-tariffs-on-china-are-dropping-from-57-to-47-after-talks-on-fentanyl-curbs-with-xi-jinping/"
  },
  {
    "title": "The Latest: Trump says he has deals with China after meeting Xi to solve months of trade tensions",
    "description": "President Donald Trump he has made deals with China after meeting Chinese leader Xi Jinping on the final day of his trip to Asia. The meeting Thursday was a chance for the leaders of the world’s two largest economies to...",
    "source": "Starbeacon",
    "publishedAt": "2025-10-30 05:20:46",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.starbeacon.com/region/the-latest-trump-says-he-has-deals-with-china-after-meeting-xi-to-solve-months/article_5dbbd784-5c5b-58a0-a59c-7835398d4bda.html"
  },
  {
    "title": "Virtusa Hosts Leadership From British Insurer CFC To Unveil Digital Service Hub In Sri Lanka",
    "description": "(MENAFN - Colombo Gazette) Virtusa Corporation, in partnership with CFC, a pioneer in insurance solutions for emerging risk and market leader in cyber, opened the doors to CFC's digital services hub ...",
    "source": "Menafn",
    "publishedAt": "2025-10-30 05:20:11",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://menafn.com/1110269546/Virtusa-Hosts-Leadership-From-British-Insurer-CFC-To-Unveil-Digital-Service-Hub-In-Sri-Lanka"
  }
]