[
  {
    "title": "NFL’s MVP: Pick Maye or Stafford",
    "description": "FOXBORO, Mass. -- A fierce debate is raging for NFL MVP, with one more game for Patriots quarterback Drake Maye and Rams QB Matthew Stafford to make their cases to voters.",
    "source": "Nwaonline",
    "publishedAt": "2026-01-03 08:07:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.nwaonline.com/news/2026/jan/03/nfls-mvp-pick-maye-or-stafford/"
  },
  {
    "title": "Gov Sanwo Olu confirms eight dead in GNI building fire",
    "description": "Lagos State Governor, Babajide Sanwo-Olu, on Friday, confirmed that eight people lost their lives in the fire that ravaged the 22-storey Great Nigeria Insurance, GNI, Building on Martins Street, Lagos Island, on Christmas Eve.The governor announced immediate measures, including the demolition of structurally compromised buildings within the affected area.Sanwo-Olu disclosed that five of the victims have been identified, while three were severely charred beyond recognition.DNA testing has been ordered to establish their identities.The governor made the statement during an on-site assessment, nine days after the inferno, noting that residual flames were still visible.He confirmed that 13 people were rescued alive during the disaster, while search and recovery operations have so far confirmed eight fatalities.Describing the incident as tragic and deeply distressing, the governor led his team in observing a minute of silence in honor of the deceased.He attributed the fire outbreak to human error and emphasised the importance of strict adherence to safety regulations in both commercial and residential buildings across the state.Sanwo-Olu noted that the fire affected several adjacent structures along Martins, Shitta, and Breadfruit streets.He highlighted the dangers posed by multiple generators discovered on different floors of nearby shopping plazas, warning that such practices significantly increase fire risks and endanger lives.The governor made it clear that the government would take firm action, including the demolition of any building failing structural integrity assessments, following thorough technical evaluations.Residents, traders, and passers-by were advised to avoid the area until phased and controlled demolition work is completed, with security agencies continuing to safeguard the site against secondary hazards.Sanwo-Olu also urged business owners to prioritise human life over property during emergencies. He noted that some victims had initially been evacuated safely but returned to retrieve belongings, resulting in fatal entrapment.Meanwhile, the Lagos State Emergency Management Agency, LASEMA, has established a help desk at the scene to register reports of missing persons whose businesses were located within the affected building.LASEMA is coordinating with other emergency responders to ensure proper documentation and support for affected families.The governor was accompanied on the inspection by Commissioner for Information and Strategy, Gbenga Omotoso; Commissioner for Special Duties and Intergovernmental Relations, Gbenga Oyerinde; LASEMA Permanent Secretary, Dr Olufemi Oke-Osanyintolu; General Manager of the Lagos Command and Control Centre, Femi Kennedy-Giwa; and other senior officials.As of the governor’s visit, Martins Street remained closed to commercial activities, with security personnel and emergency teams maintaining strict cordons.The state government assured residents that updates would be provided as recovery operations and structural evaluations continue.",
    "source": "Nigeria News",
    "publishedAt": "2026-01-03 08:07:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.nigerianeye.com/2026/01/gov-sanwo-olu-confirms-eight-dead-in.html"
  },
  {
    "title": "Rahul Narwekar Denies Allegations After Viral Video Allegedly Shows Him Threatening BMC Polls Candidates, Disrupting Nomination In Mumbai",
    "description": "A viral video of Maharashtra Assembly Speaker Rahul Narwekar allegedly threatening opposition leaders has led to calls for legal action by the Maharashtra Congress. Narwekar refutes claims, alleging he was under pressure. The incident raises questions about the Model Code of Conduct adherence.",
    "source": "The Free Press Journal",
    "publishedAt": "2026-01-03 08:07:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.freepressjournal.in/mumbai/rahul-narwekar-denies-allegations-after-viral-video-allegedly-shows-him-threatening-bmc-polls-candidates-disrupting-nomination-in-mumbai"
  },
  {
    "title": "Retiring Wawrinka winds back the clock with gutsy win",
    "description": "Stan Wawrinka's farewell tour has started with a gutsy win, the three-time grand slam champion beating world No.29 Arthur Rinderknech in a three-set thriller at the United Cup.",
    "source": "Yarrawonga Chronicle",
    "publishedAt": "2026-01-03 08:07:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.yarrawongachronicle.com.au/aap-tennis/retiring-wawrinka-winds-back-the-clock-with-gutsy-win/"
  },
  {
    "title": "Man Gives ₹501 Tip To Delivery Guy On NYE, He Uses It To Buy Petrol So He Can Work More",
    "description": "While many of us were busy planning parties, ordering food, or counting down to midnight on New Year’s...The post Man Gives ₹501 Tip To Delivery Guy On NYE, He Uses It To Buy Petrol So He Can Work More appeared first on Storypick.",
    "source": "Storypick",
    "publishedAt": "2026-01-03 08:06:56",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://storypick.com/man-gives-tip-to-delivery-guy/"
  },
  {
    "title": "Venezuela’s capital hit by explosions, smoke seen",
    "description": "Multiple explosions rocked Venezuela’s capital Caracas early on Saturday and columns of black smoke and aircraft could be seen, according to Reuters witnesses and images circulating on social media.A power outage affected the southern area of the city, near a major military base, witnesses said.It was not immediately clear what caused the disturbances, which began about 2 a.m. (0600 GMT), or exactly where they were occurring. Reuters could not immediately verify the social media videos.U.S. President Donald Trump has repeatedly promised land operations in Venezuela. He has not publicly detailed his aims but has privately pressured President Nicolas Maduro to flee the nation, Reuters has reported. Trump said on Monday it would be “smart” for Maduro to leave power.The Pentagon referred questions to the White House, which declined to comment.Trump says would be ‘smart’ for Maduro to step downMaduro has accused the Trump administration of seeking a change in government to gain access to Venezuela’s vast oil reserves.Trump last month announced a blockade of all sanctioned vessels going in or out of Venezuelan waters as part of a strategy to pressure Maduro.“At this moment they are bombing Caracas“ Colombian President Gustavo Petro posted on X. “Alert everyone — they have attacked Venezuela. They are bombing with missiles. The (Organization of American States) and the UN must meet immediately.”Petro, who did not provide further information or indicate the source of his assertions, has repeatedly expressed opposition to the U.S. pressure campaign.The U.S. has made a major military buildup in the region, including an aircraft carrier, warships and advanced fighter jets stationed in the Caribbean.In addition to the blackade announcement, Trimp has expanded sanctions and staged more than two dozen strikes on vessels the U.S. alleges were involved in trafficking drugs in the Pacific Ocean and Caribbean Sea.Last week, Trump said the United States had “hit” an area in Venezuela where boats are loaded with drugs, marking the first known time Washington has carried out land operations in Venezuela since the pressure campaign began.He did not say whether those strikes were carried out by the CIA or not. Other media outlets have reported that the spy agency was behind them.Trump has accused the South American country of flooding the U.S. with drugs, and his administration has for months been bombing boats originating in South America that it alleges were carrying drugs. Many nations have condemned the attacks as extrajudicial killings and Maduro’s government has always denied any involvement with drug trafficking.",
    "source": "Business Recorder",
    "publishedAt": "2026-01-03 08:06:54",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.brecorder.com/news/40400452/venezuelas-capital-hit-by-explosions-smoke-seen"
  },
  {
    "title": "NCC plans to train 1 lakh cadets as first responders for disasters, raise 10,000 'cyber warriors'",
    "description": "The National Cadet Corps plans to train one lakh cadets as disaster first responders. These cadets will be known as Yuva Apda Mitras. The NCC is also establishing hubs for drone training and developing ten thousand cadets as cyber warriors. These initiatives aim to bolster national security and disaster management capabilities for future needs.",
    "source": "The Economic Times",
    "publishedAt": "2026-01-03 08:06:53",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "http://economictimes.indiatimes.com/news/defence/ncc-plans-to-train-1-lakh-cadets-as-first-responders-for-disasters-raise-10000-cyber-warriors/articleshow/126319172.cms"
  },
  {
    "title": "British fugitive arrested over horror Marbella shooting that put children’s lives ‘at serious risk’",
    "description": "A BRITISH fugitive wanted over a terrifying Marbella shooting that put children’s lives “at serious risk” has been captured in Colombia. Polemos Michael George was dramatically arrested by Colombian police",
    "source": "The Olive Press",
    "publishedAt": "2026-01-03 08:06:53",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.theolivepress.es/spain-news/2026/01/03/british-fugitive-arrested-over-horror-marbella-shooting-that-put-childrens-lives-at-serious-risk/"
  },
  {
    "title": "NCC plans to train 1 lakh cadets as first responders for natural disasters",
    "description": "The National Cadet Corps plans to train one lakh cadets as disaster first responders. These cadets will be known as Yuva Apda Mitras. The NCC is also establishing hubs for drone training and developing ten thousand cadets as cyber warriors. These initiatives aim to bolster national security and disaster management capabilities for future needs.",
    "source": "The Economic Times",
    "publishedAt": "2026-01-03 08:06:53",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://economictimes.indiatimes.com/news/defence/ncc-plans-to-train-1-lakh-cadets-as-first-responders-for-natural-disasters/articleshow/126319172.cms"
  },
  {
    "title": "Gospel singer Sinach holds medical outreach in Abia, commends Otti",
    "description": "Gospel singer Sinach praises Governor Alex Otti for his visionary leadership in Abia State after a successful medical outreach by her foundation.Read More: https://punchng.com/gospel-singer-sinach-holds-medical-outreach-in-abia-commends-otti/",
    "source": "Punch",
    "publishedAt": "2026-01-03 08:06:50",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://punchng.com/gospel-singer-sinach-holds-medical-outreach-in-abia-commends-otti/"
  }
]