[
  {
    "title": "Empty seats",
    "description": "The debate on the budget is meant to be a parliamentary process of great significance. Yet the scene in the plenary hall during the first three days (Friday-Sunday) was deeply offensive to citizens, culture and democracy.",
    "source": "Ekathimerini.com",
    "publishedAt": "2025-12-24 20:09:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.ekathimerini.com/opinion/1290547/empty-seats/"
  },
  {
    "title": "ACP arrested for accepting Rs 30K bribe",
    "description": "Bengaluru: An assistant commissioner of police was trapped and arrested by Lokayukta police Wednesday for accepting a bribe of Rs 30,000 from a hotel .",
    "source": "The Times Of India",
    "publishedAt": "2025-12-24 20:09:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://timesofindia.indiatimes.com/city/bengaluru/acp-arrested-for-accepting-rs-30k-bribe/articleshow/126164904.cms"
  },
  {
    "title": "Leyla Aliyeva, Arzu Aliyeva, and Alena Aliyeva visit Special Boarding General Education School No. 5 in Baku",
    "description": "On December 24, Vice-President of the Heydar Aliyev Foundation and founder and head of the IDEA Public Union, Leyla Aliyeva, along with Arzu Aliyeva and Alena Aliyeva, visited Special Boarding General Education School No. 5 in Baku.",
    "source": "Azernews",
    "publishedAt": "2025-12-24 20:09:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.azernews.az/culture/252126.html"
  },
  {
    "title": "New Brunswick workers are helping rebuild Jamaica’s electrical system this holiday season",
    "description": "About 180 workers, mostly from New Brunswick and the Maritimes, are in Jamaica this holiday season helping to rebuild electrical infrastructure destroyed when Hurricane Melissa hit the island nation on Oct. 28. Louis Leger of New Brunswick-based Greystone Group says it takes a special kind of person to go to work in a disaster zone.",
    "source": "Cbc",
    "publishedAt": "2025-12-24 20:09:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.cbc.ca/news/canada/new-brunswick/new-brunswick-workers-helping-rebuild-jamaica-electrical-9.7027756?cmp=rss"
  },
  {
    "title": "Brooks Nader Dissolves Her Lip Filler and Jokes It's a 'Christmas Present' to Her Parents",
    "description": "The model has been open about her past enhancements from her use of Botox to her nose job",
    "source": "Yahoo! News",
    "publishedAt": "2025-12-24 20:08:59",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://ca.news.yahoo.com/brooks-nader-dissolves-her-lip-200859232.html"
  },
  {
    "title": "Drone Attack Sparks Massive Fire at Russian Oil Port",
    "description": "A fire erupted in two oil product tanks at the southern Russian port of Temryuk on Thursday Regional authorities in the Krasnodar region claim the cause was a Ukrainian drone attack",
    "source": "Devdiscourse",
    "publishedAt": "2025-12-24 20:08:58",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.devdiscourse.com/article/headlines/3741335-drone-attack-sparks-massive-fire-at-russian-oil-port"
  },
  {
    "title": "How Mexican cartels and Chinese criminal networks are moving 'cocaine of the sea' through Canadian ports",
    "description": "Chinese crime networks and Mexican cartels are using Canadian ports to trade highly lucrative fish bladders for the precursor chemicals needed to produce fentanyl.",
    "source": "Cbc",
    "publishedAt": "2025-12-24 20:08:58",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.cbc.ca/news/canada/british-columbia/fish-bladders-traded-for-fentanyl-precursors-1.7458395?cmp=rss"
  },
  {
    "title": "Marvel’s Blade Gets New Update After Years of Silence",
    "description": "Marvel’s Blade, a new video game based on the beloved vampire slayer, has received a new update after being announced in 2023. The Marvel universe has dominated movie theaters for the last 15 or so year thanks to a mostly strong run across over 30 films. It took a bit for Marvel to figure out [...]The post Marvel’s Blade Gets New Update After Years of Silence appeared first on ComicBook.com.",
    "source": "Comic Book",
    "publishedAt": "2025-12-24 20:08:57",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://comicbook.com/gaming/news/marvels-blade-gets-new-update-after-years-of-silence/"
  },
  {
    "title": "Children recreate the journey of Mary and Joseph in this ‘Posada in Nature’ at San Gabriel River Park",
    "description": "A Posada in nature within the new San Gabriel River Park created a different take on a traditional Christmas celebration.",
    "source": "Sgvtribune",
    "publishedAt": "2025-12-24 20:08:55",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.sgvtribune.com/2025/12/24/children-recreate-the-journey-of-mary-and-joseph-in-this-posada-in-nature-at-san-gabriel-river-park/"
  },
  {
    "title": "Bari Weiss turned against Megyn Kelly after she spurned CBS debate proposal: report",
    "description": "Kelly was reportedly courted by Weiss to take part in a high-profile feminism debate as part of a new town hall series under Weiss’s leadership.",
    "source": "New York Post",
    "publishedAt": "2025-12-24 20:08:54",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://nypost.com/2025/12/24/media/bari-weiss-turned-against-megyn-kelly-after-she-spurned-cbs-debate-proposal-report/"
  }
]