[
  {
    "title": "Two more warming centers open in Sunbury",
    "description": "SUNBURY — Two more warming center's and one 24/7 shelter are joining with the Stonington Volunteer Fire Company and the Shikellamy School District to help those in need during the upcoming winter storm.",
    "source": "Daily Item",
    "publishedAt": "2026-01-24 20:09:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.dailyitem.com/news/two-more-warming-centers-open-in-sunbury/article_e9857770-0c7c-4f6f-a9ff-857a9d710d5c.html"
  },
  {
    "title": "TEXAS 87, NO. 21 GEORGIA 67",
    "description": "FGFTRebGEORGIAMinM-AM-AO-TAPFPTSCatchings171-21-10-0003Cyril255-82-42-50412Cain242-61-21-2115Ross243-64-41-33011Wilkinson324-126-70-24217Millender283-91-21-4319Abson153-40-01-3036Wilkins141-32-40-0014Stagg130-00-13-4010James80-10-00-0010Totals20022-5117-259-23111467",
    "source": "News-gazette",
    "publishedAt": "2026-01-24 20:08:59",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.news-gazette.com/ap/sports/agate/texas-87-no-21-georgia-67/article_ec81042b-5b9a-5b5e-a579-6413bcc24790.html"
  },
  {
    "title": "TEXAS 87, NO. 21 GEORGIA 67",
    "description": "FGFTRebGEORGIAMinM-AM-AO-TAPFPTSCatchings171-21-10-0003Cyril255-82-42-50412Cain242-61-21-2115Ross243-64-41-33011Wilkinson324-126-70-24217Millender283-91-21-4319Abson153-40-01-3036Wilkins141-32-40-0014Stagg130-00-13-4010James80-10-00-0010Totals20022-5117-259-23111467",
    "source": "Bluefield Daily Telegraph",
    "publishedAt": "2026-01-24 20:08:59",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.bdtonline.com/sports/national_sports/texas-87-no-21-georgia-67/article_6ff6327f-7e44-590b-b247-ea41e0d4698c.html"
  },
  {
    "title": "High Falls artist’s artwork focus of exhibition opening Jan. 31 in Kingston",
    "description": "KINGSTON, N.Y. — “Megaphones and Monoliths,” an art exhibition featuring the works of High Falls artist Don Johnson, is set to open Saturday, Jan. 31, according to an announcement from the O+ Festival. The exhibition will open with a reception from 5 to 8 p.m. at the O+ Exchange Space, 334 Wall St. The release [...]",
    "source": "Daily Freeman",
    "publishedAt": "2026-01-24 20:08:56",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.dailyfreeman.com/2026/01/24/high-falls-artists-artwork-focus-of-exhibition-openimg-jan-31-in-kingston/"
  },
  {
    "title": "Sabb drops 25 as Glassboro shuts down Seneca -- Boys basketball recap",
    "description": "Sabb drops 25 as Glassboro shuts down Seneca -- Boys basketball recap",
    "source": "Nj",
    "publishedAt": "2026-01-24 20:08:56",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.nj.com/highschoolsports/2026/01/sabb-drops-25-as-glassboro-shuts-down-seneca-boys-basketball-recap.html"
  },
  {
    "title": "Fitchburg, Leominster take storm precautions",
    "description": "FITCHBURG — Due to the forecasted storm, which is expected to start at midday today and go all night, with predictions of up to a foot of snow, the city of Fitchburg will institute a parking ban from noon today to 5 p.m. on Tuesday.",
    "source": "Sentinel And Enterprise",
    "publishedAt": "2026-01-24 20:08:55",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.sentinelandenterprise.com/2026/01/24/fitchburg-leominster-take-storm-precautions/"
  },
  {
    "title": "Data Dystopia: 149 Million Gmail, Facebook, Instagram Passwords Exposed In Massive Cyber Breach",
    "description": "Experts are urging users to perform deep system scans using reputable antivirus software and to enable Multi-Factor Authentication (MFA) on all sensitive accounts",
    "source": "News 18",
    "publishedAt": "2026-01-24 20:08:54",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.news18.com/tech/data-dystopia-149-million-gmail-facebook-instagram-passwords-exposed-in-massive-cyber-breach-9854776.html"
  },
  {
    "title": "Trump threatens 100% tariff on all Canadian goods over China trade deal",
    "description": "US President Donald Trump has warned Canada that if it concludes a trade deal with China, he will impose a 100% tariff on all goods coming over the border.Relations between the United States and its northern neighbour have been rocky since Trump returned to the White House a year ago, with spats over trade and Canadian Prime Minister Mark Carney decrying a “rupture” in the US-led global order.During a visit to Beijing last week, Carney hailed a “new strategic partnership” with China that resulted in a “preliminary but landmark trade agreement” to reduce tariffs – but Trump warned of serious consequences should that deal be realised.If Carney “thinks he is going to make Canada a ‘Drop Off Port’ for China to send goods and products into the United States, he is sorely mistaken”, Trump wrote on his Truth Social platform.“China will eat Canada alive, completely devour it, including the destruction of their businesses, social fabric, and general way of life,” he said.“If Canada makes a deal with China, it will immediately be hit with a 100% Tariff against all Canadian goods and products coming into the USA.”Trump insulted Carney by calling him “Governor” - a swipe referring to the US President’s repeated insistence that Canada should be the 51st US state.Trump this week posted an image on social media of a map with Canada – as well as Greenland and Venezuela – covered by the American flag.Canada’s minister responsible for trade with the United States, Dominic LeBlanc, pushed back against Trump’s latest threat.“There is no pursuit of a free trade deal with China. What was achieved was resolution on several important tariff issues,” he wrote on X.‘Canada thrives because we are Canadian’The two leaders have sharpened their rhetorical knives in recent days, beginning with Carney’s speech on Tuesday at the World Economic Forum in Davos, where he earned a standing ovation for his frank assessment of a “rupture” in the US-led global order.His comment was widely viewed as a reference to Trump’s disruptive influence on international affairs, although Carney did not mention the US leader by name.Trump fired back at Carney a day later in his own speech, and then withdrew an invitation for the Canadian Prime Minister to join his “Board of Peace” – his self-styled body for resolving global conflict.Initially designed to oversee the situation in postwar Gaza, the body appears now to have a far wider scope, sparking concerns that Trump wants to create a rival to the United Nations.“Canada lives because of the United States. Remember that, Mark, the next time you make your statements,” Trump said.Carney shot back on Thursday: “Canada doesn’t live because of the United States. Canada thrives because we are Canadian.” He nevertheless acknowledged the “remarkable partnership” between the two nations.Trade spatsCanada heavily relies on trade with the United States, the destination for more than three quarters of Canadian exports.Key Canadian sectors like auto, aluminium and steel have been hit hard by Trump’s global sectoral tariffs, but the levies’ impacts have been muted by the President’s broad adherence to an existing North American free trade agreement.Negotiations on revising that deal are set for early this year, and Trump has repeatedly insisted the United States doesn’t need access to any Canadian products - which would have sweeping consequences for its northern neighbour.Matthew Holmes, executive vice president of the Canadian Chamber of Commerce, said in a statement that he hoped the two governments would “come to a better understanding quickly that can alleviate further concerns for businesses”.The two nations, with Mexico, are set to host the World Cup later this year.- Agence France-Presse",
    "source": "Newstalkzb",
    "publishedAt": "2026-01-24 20:08:53",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.newstalkzb.co.nz/news/world/trump-threatens-100-tariff-on-all-canadian-goods-over-china-trade-deal/"
  },
  {
    "title": "‘Reason gives way’: victims describe trauma of ‘digital arrest’",
    "description": "More than three weeks have passed since Indira, 77, and Om Taneja, 81, were placed under a ‘digital arrest’ and defrauded of ₹14.85 crore. However, the highly educated couple — a doctor and an engineer respectively — who lived in the U.S. for 45 years before returning to India after retirement in 2015, still remember vividly how they were kept under “total surveillance” for a fortnight, during which “officers” from the “telecom department” and “Maharashtra Police” grilled and sweet-talked them into parting with almost all of their life’s savings. “They convinced us that we had committed a crime. Reason doesn’t work in such situations. By the end, I felt relieved that my name would be cleared of all the cases. The truth, however, dawned on me when an actual police officer explained exactly what had happened,” said Dr. Indira Taneja. The police have arrested three persons in the case so far — two from Gujarat and one from Prayagraj — and traced around ₹4 crore, of which they have frozen ₹2 crore that was diverted to various accounts. “Two of the accused had offered their accounts for transactions on a commission while the third acted as a facilitator who provided mule accounts to the scamsters,” said an officer, adding that further probe is under way.",
    "source": "The Hindu",
    "publishedAt": "2026-01-24 20:08:50",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.thehindu.com/news/cities/Delhi/reason-gives-way-victims-describe-trauma-of-digital-arrest/article70546456.ece"
  },
  {
    "title": "Occupied Alchevsk Left Without Electricity",
    "description": "(MENAFN - UkrinForm) This was reported on Telegram by the Head of the Luhansk Regional Military Administration, Oleksii Kharchenko, according to Ukrinform.–In Alchevsk, which has been occupied ...",
    "source": "Menafn",
    "publishedAt": "2026-01-24 20:08:49",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://menafn.com/1110645621/Occupied-Alchevsk-Left-Without-Electricity"
  }
]