[
  {
    "title": "Noel Clarke arrested over alleged attempted rape - The Telegraph",
    "description": "Noel Clarke arrested over alleged attempted rape The TelegraphDoctor Who star Noel Clarke arrested over historic 'attempted rape and sexual assault of woman in her 20s' The SunActor Noel Clarke arrested over allegation of attempted rape in 2007 The GuardianNoel Clarke arrested on suspicion of attempted rape, reports say BBCNoel Clarke arrested over alleged 2007 attempted rape The Times",
    "source": "Google News",
    "publishedAt": "2026-02-11 08:11:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNUW9LUVFxXzR1cE0xYWYyX2VlOUlFMnBxSHVmcm1EdTNjNjVBc0VlSHZFd2JoUkpIdWRJZUJ5VE8tQXZmMzJDUUNYcWN6LTRab05YSV8tOUZGNmowUHRFVHZ2M2xvNkNjQUxGX0JsNmw3dkFMX3pYYjZaM3NsTE5yZDR2bkVwVWY2Rmc5OE1rOUkyT01Dc2hwTg?oc=5"
  },
  {
    "title": "World's richest man Elon Musk uses 20-minute hiring trick that's nothing to do with CV",
    "description": "Elon Musk says he doesn't focus on CVs when hiring job candidates, instead believing that 'goodness of heart' is important",
    "source": "Express",
    "publishedAt": "2026-02-11 08:11:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.express.co.uk/news/us/2169388/world-s-richest-man-elon-musk-uses-20-minute-hiring-trick-s-nothing-do-cv"
  },
  {
    "title": "Boy arrested over double stabbing at London school is former pupil, police say",
    "description": "A 13-year-old boy suspected of stabbing two boys at a secondary school is a former pupil, police have confirmed.",
    "source": "Skynew",
    "publishedAt": "2026-02-11 08:11:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://news.sky.com/story/boy-arrested-over-double-stabbing-at-kingsbury-high-school-in-london-was-former-pupil-police-say-13506085"
  },
  {
    "title": "Ryanair to operate four new routes from Malta in summer 2026",
    "description": "Ryanair has announced additions to its summer schedule.",
    "source": "Times Of Malta",
    "publishedAt": "2026-02-11 08:11:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://timesofmalta.com/article/ryanair-operate-new-routes-malta-summer-2026.1123893"
  },
  {
    "title": "CRA soul-searching begins with vote to elect new leader",
    "description": "After its disastrous defeat on Sunday, the fledgling Centrist Reform Alliance is hoping a new face at the top will help it find its bearings.",
    "source": "The Japan Times",
    "publishedAt": "2026-02-11 08:11:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.japantimes.co.jp/news/2026/02/11/japan/politics/centrist-reform-alliance-leadership-election/"
  },
  {
    "title": "Volfovich describes pace of Belarus’ Armed Forces inspection",
    "description": "State Secretary of the Security Council of Belarus Aleksandr Volfovich told the media that the inspection of the Armed Forces of Belarus, ordered by the president, is proceeding with high intensity.",
    "source": "Белта",
    "publishedAt": "2026-02-11 08:11:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://eng.belta.by/society/view/volfovich-describes-pace-of-belarus-armed-forces-inspection-176760-2026/"
  },
  {
    "title": "13th-ranked Mumford beats Snook to remain a game back of fourth-ranked Hearne",
    "description": "Hearne will be at Mumford on Friday in battle of state-ranked teams",
    "source": "The Eagle",
    "publishedAt": "2026-02-11 08:11:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://theeagle.com/sports/high-school/basketball/boys/article_2673e699-ccd7-4016-a35f-caf9bbe9c7ca.html"
  },
  {
    "title": "Physical AI Is Here Today – Unikie Innovation Summit 2026 Recap",
    "description": "Tampere, Finland, Feb. 11, 2026 (GLOBE NEWSWIRE) -- Unikie's recent Innovation Summit at Nokia Arena brought together companies and experts interested in applying innovative AI solutions in their industries.An overarching theme for the keynotes and expert panels was Physical AI. Also a hot topic at CES 2026 and in Davos, Physical AI is an umbrella concept for solutions ranging from robotics, automation, edge computing and AI-powered factories, for example. In essence, Physical AI represents the shift from cloud-based AI to AI embodied in machines and real-world systems.With its extensive expertise in embedded software engineering, Unikie aims at no less than becoming the world's leading Physical AI company. The case studies and solutions showcased in Unikie's expo area showcased the various applications of Physical AI available already today.As Unikie CEO, Juha Ala-Laurila, stated in his closing remarks:\"Physical AI is not a thinking game, it is an acting game. Global competitors are moving fast. A fundamental piece of success is dedication, communication and teamwork – Unikie's team is well-prepared to execute rapidly and win together with its customers.\"Keynotes: Lights-Out Factories Address Tomorrow's ChallengesBoth keynotes at the Innovation Summit addressed the same problem that the European manufacturing industry is facing: stagnating growth combined with productivity decline and workforce scarcity challenges.Sami Karttunen, Director at consulting company PwC Strategy&, has worked with ...Full story available on Benzinga.com",
    "source": "Benzinga",
    "publishedAt": "2026-02-11 08:10:57",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.benzinga.com/pressreleases/26/02/g50533334/physical-ai-is-here-today-unikie-innovation-summit-2026-recap"
  },
  {
    "title": "Constitutional Commission Proposes Broader Property and Housing Guarantees",
    "description": "The Astana Times provides news and information from Kazakhstan and around the world.ASTANA – Members of the Constitutional Commission discussed proposals to expand protections for property and housing rights during a Feb. 10 meeting. One of the key proposals would explicitly recognize all forms of ownership in the draft new Constitution. Currently, concerns have been raised that the existing wording does not cover all possible forms of...The post Constitutional Commission Proposes Broader Property and Housing Guarantees appeared first on The Astana Times.",
    "source": "Stamford Latest News",
    "publishedAt": "2026-02-11 08:10:57",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://astanatimes.com/2026/02/constitutional-commission-proposes-broader-property-and-housing-guarantees/"
  },
  {
    "title": "Canada school shooting student 'barricaded himself in classroom' as shots fired",
    "description": "Ten people have died and dozens have been injured in a fatal shooting at a secondary school in Canada - with students instructed to close classroom doors as the building went into lockdown",
    "source": "Mirror",
    "publishedAt": "2026-02-11 08:10:56",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.mirror.co.uk/news/world-news/canada-school-shooting-student-barricaded-36702849"
  }
]