[
  {
    "title": "Louise Medina",
    "description": "Louise Medina, 83, passed away peacefully at her home in San Pedro, CA, on November 26th, 2025. Louise is survived by her loving husband, Ralph, her daughter Julie (Dave) Alesso, grand daughters Taylor (Nick) Licouris and Madison Alesso; son John (Yvette) Medina and grandson Christian Medina. A Visitation will be at McNerney’s Mortuary, December 3, [...]",
    "source": "Daily Breeze",
    "publishedAt": "2025-12-02 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.dailybreeze.com/obituaries/louise-medina-san-pedro-ca/"
  },
  {
    "title": "Virginia Formichi",
    "description": "Virginia J. Formichi, a lifelong San Franciscan, dedicated humanitarian, and woman of deep Catholic faith, passed away on July 23, 2025, at the age of 99. Born on November 16, 1925, at St. Francis Hospital to John and Lena (Toboni) Formichi, Virginia lived a life that touched people across the globe while always remaining rooted [...]",
    "source": "Marin Independent Journal",
    "publishedAt": "2025-12-02 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.marinij.com/obituaries/virginia-formichi-san-francisco-ca/"
  },
  {
    "title": "Ingrid McGuire",
    "description": "Ingrid McGuire, former Mayor of Dana Point and longtime public servant, passed away after a life defined by resilience, leadership, and a deep commitment to her community.Born in Austria, Ingrid studied chemistry at the University of Graz and received a scholarship to the United States, where she met her future husband, Jim. Ingrid became an [...]",
    "source": "Ocregister",
    "publishedAt": "2025-12-02 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.ocregister.com/obituaries/ingrid-mcguire-laguna-niguel-ca/"
  },
  {
    "title": "Newcastle United want Manchester City goalkeeper James Trafford in winter",
    "description": "Newcastle United want to sign Manchester City goalkeeper James Trafford during the winter transfer window, according to the Daily Mail. Newcastle wanted the Englishman at the St James’ Park club dur...",
    "source": "Yahoo! News",
    "publishedAt": "2025-12-02 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://sports.yahoo.com/articles/newcastle-united-want-manchester-city-080500232.html"
  },
  {
    "title": "Russell Ellis",
    "description": "Russell Samuel Ellis, 93, passed away peacefully on August 5, after a very short illness. Russell was born in Ventura, California and shortly after his family moved to Willows and later Sonoma before settling in Vallejo where he lived the rest of his life. He attended Franklin Junior High and graduated from Vallejo Senior High [...]",
    "source": "Times Herald Online",
    "publishedAt": "2025-12-02 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.timesheraldonline.com/obituaries/russell-ellis-vallejo-ca/"
  },
  {
    "title": "Nvidia invest $2 billion in Synopsys",
    "description": "Nvidia and Synopsys announced Monday an expanded strategic partnership aimed at integrating accelerated computing and AI into engineering workflows across multiple industries.",
    "source": "Evertiq",
    "publishedAt": "2025-12-02 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://evertiq.com/design/2025-12-02-nvidia-invest-2-billion-in-synopsys"
  },
  {
    "title": "Grandkids identify victim of 50-year-old robbery after Clarkston High grad’s public confession",
    "description": "Answers to an Ayers family mystery",
    "source": "The Lewiston Tribune Online",
    "publishedAt": "2025-12-02 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.lmtribune.com/local-news/answers-to-an-ayers-family-mystery-20950247"
  },
  {
    "title": "Elaine Jimenez Alvarado",
    "description": "Elaine Jimenez Alvarado, age 58, of Santa Ana, California, passed away peacefully on November 11, 2025. Born on August 23, 1967, at St. Joseph Hospital in Orange, CA, Elaine was the beloved daughter of Gilbert and Eustolia Alvarado.Elaine spent her entire life in Santa Ana, where she was a member of the Floral Park community. [...]",
    "source": "Ocregister",
    "publishedAt": "2025-12-02 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.ocregister.com/obituaries/elaine-jimenez-alvarado-santa-ana-ca/"
  },
  {
    "title": "Dora (Dori) Missirlian Crawford",
    "description": "A devoted and loving wife, mother, sister, grandmother, aunt, sister-in-law, mother-in-law, teacher, and friend to many. Dori touched every life she encountered. She was kind, humble, wise, independent, adventurous, fun, loyal, compassionate, giving, and spiritual.....a beautiful human being in every way. Dori passed away peacefully on November 1, 2025 in the loving company of her [...]",
    "source": "Marin Independent Journal",
    "publishedAt": "2025-12-02 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.marinij.com/obituaries/dora-dori-missirlian-crawford-marin-ca/"
  },
  {
    "title": "Celebrating Christmas in and around Larnaca",
    "description": "The city, the suburbs and the villages of Larnaca all get into the festive mood this season as dozens of Christmas events pop up. All around the Larnaca region, markets, workshops and performances will share magical moments for visitors. The SanTa Lefkara Christmas Village is on until January 6 with artists’ stalls, entertainment, craft workshops, [...]",
    "source": "Cyprus Mail",
    "publishedAt": "2025-12-02 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://cyprus-mail.com/2025/12/02/celebrating-christmas-in-and-around-larnaca"
  }
]