[
  {
    "title": "Canada Post collective agreements could be finalized this week",
    "description": "The Crown corporation said the main components of the collective agreement language have been agreed upon and the “fine-tuning a single item” remains.",
    "source": "Brampton News",
    "publishedAt": "2026-01-13 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.bramptonguardian.com/news/canada-post-collective-agreement-ontario/article_c180cd52-a51c-502c-80b0-60c5c2a8594c.html"
  },
  {
    "title": "Mumbai BMC Elections 2026: Firecrackers Overshadow Green Promises In Campaign Trail",
    "description": "Ahead of the 2026 BMC elections, political parties’ eco-friendly manifestos contrast sharply with campaign practices, as candidates celebrate nominations and rallies with firecrackers, raising smog and worsening Mumbai’s air quality. Environmentalists criticize the hypocrisy.",
    "source": "The Free Press Journal",
    "publishedAt": "2026-01-13 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.freepressjournal.in/mumbai/mumbai-bmc-elections-2026-firecrackers-overshadow-green-promises-in-campaign-trail"
  },
  {
    "title": "Truemed and ThrivePass Partner to Expand Access to Healthcare Through HSA/FSA Dollars",
    "description": "New partnership empowers employees to use pre-tax dollars for functional medicine and health interventions, while enhancing flexibility and engagement. AUSTIN, Texas, Jan. 13, 2026 /PRNewswire/ -- Truemed, the leading platform enabling qualified health purchases with Health Savings...",
    "source": "Pr Newswire",
    "publishedAt": "2026-01-13 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.prnewswire.com/news-releases/truemed-and-thrivepass-partner-to-expand-access-to-healthcare-through-hsafsa-dollars-302660264.html"
  },
  {
    "title": "Nancy Mulhern",
    "description": "Nancy Mulhern, 71, passed away on January 8, 2026, in Colorado Springs, Colorado.Born on September 1, 1954 in St Peter, MN, Nancy pursued her education at the University of Minnesota in Minneapolis. Her lifelong dedication to knowledge and history led to a distinguished career in library sciences. She served as a librarian and department head at the Chester Fritz Library at the University of North Dakota for 17 years. Following that, she continued her work as a Historic Collections Consultant at the Wisconsin Historical Society Library in Madison, WI for two decades, preserving and curating invaluable historical resources.Nancy was known for her love of reading and her deep interest in genealogy. These passions reflected her thoughtful nature and enduring curiosity about the world and its stories. Those who knew her remember her as kind, loving, and wise—qualities that shaped both her personal relationships and professional contributions.She is lovingly remembered by her son, Connor Mulhern; stepdaughter, Angie Madoll; stepson, Alan Mulhern; and brother, Jon Boettcher. She was preceded in death by her husband, Thomas Mulhern, and her sister, Judith Sannes.May Nancy’s memory bring comfort to those who knew and loved her.",
    "source": "Grandforksherald",
    "publishedAt": "2026-01-13 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.grandforksherald.com/obituaries/obits/nancy-mulhern-z44kewottxndxwftd2kk"
  },
  {
    "title": "George Weiss, Hedge Fund Veteran, Recognized for Philanthropic Leadership",
    "description": "NEW YORK, Jan. 13, 2026 /PRNewswire/ -- George Weiss, a hedge fund veteran with decades of experience in the financial markets, is being recognized for his philanthropic leadership and ongoing commitment to education, opportunity, and community-focused initiatives. Known for a career defined by disciplined investment strategy and long-term thinking, Weiss has increasingly dedicated his time and resources to charitable efforts that reflect a broader vision of responsibility and impact.Throughout his professional life, George Weiss built a reputation as a hedge fund manager operating in a complex and highly regulated industry. Success in this environment required analytical rigor, accountability, and strategic foresight—qualities that now inform his philanthropic approach. Rather than viewing giving as a passive endeavor, Weiss has approached philanthropy with the same structure and intentionality that characterized his work in finance.\"True leadership extends beyond professional achievement,\" Weiss said. \"Philanthropy is about investing in people and creating pathways for opportunity that endure.\"A Career Grounded in Discipline and PerspectiveAs a hedge fund veteran, he navigated multiple market cycles, economic shifts, and industry changes over the course of his career. This experience shaped a long-term perspective that emphasized sustainability over short-term gains. That same philosophy ...Full story available on Benzinga.com",
    "source": "Benzinga",
    "publishedAt": "2026-01-13 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.benzinga.com/pressreleases/26/01/n49890094/george-weiss-hedge-fund-veteran-recognized-for-philanthropic-leadership"
  },
  {
    "title": "Great Plains Food Bank names new CEO",
    "description": "The Great Plains Food Bank is proud to announce Ann Prifrel as its new Chief Executive Officer, effective January 13, 2026. A Midwest native with a lifelong commitment to ensuring neighbors have access to nourishing food, Prifrel brings more than...",
    "source": "Willistonherald",
    "publishedAt": "2026-01-13 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.willistonherald.com/news/great-plains-food-bank-names-new-ceo/article_a8af46e4-8aa5-4e22-8e0e-c734d5ee29b9.html"
  },
  {
    "title": "MAULT, Patricia",
    "description": "Patricia (Pat) died at the age of 86 at the Youville Home in St. Albert",
    "source": "St. Albert News",
    "publishedAt": "2026-01-13 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.stalbertgazette.com/obituaries/mault-patricia-11733346"
  },
  {
    "title": "Telecoms fraud cost South African operators over R5 BILLION in 2025 alone",
    "description": "'We always have to be on our toes because the nature of cybercrime changes every day' - COMRiC CEO Thokozani Mvelase",
    "source": "Ewn",
    "publishedAt": "2026-01-13 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.ewn.co.za/2026/01/13/telecoms-fraud-cost-south-african-operators-over-r5-billion-in-2025-alone"
  },
  {
    "title": "Oprah’s favorite coat brand has a bestselling puffer under $100 today",
    "description": "Grab it before temperatures drop even lower this month.",
    "source": "New York Post",
    "publishedAt": "2026-01-13 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://nypost.com/2026/01/13/shopping/oprahs-favorite-coat-brand-dropped-under-100-on-this-puffer/"
  },
  {
    "title": "President Zardari arrives in Bahrain to strengthen trade, defense and strategic ties",
    "description": "President welcomed by Bahrain National Guard Commander and Foreign Minister upon arrival in Manama First Lady Aseefa Bhutto-Zardari accompanies the president on the four-day official visit Meetings scheduled with King Hamad bin Isa Al Khalifa and Crown Prince/PM Salman bin Hamad Al Khalifa President to address Bahrain Economic Development Board on Pakistan’s economic potential Visit [...]",
    "source": "Pakistan Today",
    "publishedAt": "2026-01-13 20:10:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.pakistantoday.com.pk/2026/01/14/president-zardari-arrives-in-bahrain-to-strengthen-trade-defense-and-strategic-ties/"
  }
]