[
  {
    "title": "Federico Rufino Nepomuceno, Jr.",
    "description": "Master Chief Petty Officer Federico “Nep” Rufino Nepomuceno Jr. passed away peacefully at his home on December 21, 2025, at the age of 90.Born on June 14, 1935, in Manila, Philippines, Nep lived a life marked by service, dedication, and deep love for family and community. He was preceded into eternal life by his beloved [...]",
    "source": "Times Herald Online",
    "publishedAt": "2025-12-30 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.timesheraldonline.com/obituaries/federico-rufino-nepomuceno-jr-vallejo-ca/"
  },
  {
    "title": "Infosys Ltd eases for fifth straight session",
    "description": "Infosys Ltd is quoting at Rs 1635.9, down 0.54% on the day as on 13:19 IST on the NSE. The stock tumbled 12.98% in last one year as compared to a 9.53% rally in NIFTY and a 12% fall in the Nifty IT index.",
    "source": "Business Standard",
    "publishedAt": "2025-12-30 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.business-standard.com/markets/capital-market-news/infosys-ltd-eases-for-fifth-straight-session-125123000489_1.html"
  },
  {
    "title": "Aegis Logistics Ltd eases for fifth straight session",
    "description": "Aegis Logistics Ltd is quoting at Rs 704.9, down 1.02% on the day as on 13:19 IST on the NSE. The stock jumped 4.47% in last one year as compared to a 9.53% rally in NIFTY and a 1.33% spurt in the Nifty Energy index.",
    "source": "Business Standard",
    "publishedAt": "2025-12-30 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.business-standard.com/markets/capital-market-news/aegis-logistics-ltd-eases-for-fifth-straight-session-125123000481_1.html"
  },
  {
    "title": "Debra Pelletier",
    "description": "Debra Ann Pelletier 66 of Aptos, California passed away peacefully in her home on November 19th 2025. Born in Lowell, Mass she was the daughter of Joseph Raymond Pelletier and Lorraine (Langlois) Pelletier. Debra attended Notre Dame Academy and graduated with the class of 1976. After High School she attended college and spent summers working [...]",
    "source": "Santacruzsentinel.com",
    "publishedAt": "2025-12-30 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.santacruzsentinel.com/obituaries/debra-pelletier-aptos-ca/"
  },
  {
    "title": "Inside China | Kishore Mahbubani: APEC meeting in Shenzhen could inspire global development",
    "description": "GUANGZHOU, China, Dec. 30, 2025 /PRNewswire/ -- News report from South: Shenzhen recently hosted the Asia-Pacific Economic Cooperation (APEC) Informal Senior Officials' Meeting and has been confirmed as the venue for the 2026 APEC Economic Leaders' Meeting. Singapore's former ambassador to the United Nations, Kishore Mahbubani — who attended the first APEC Economic Leaders' Meeting in 1993 — recently returned to the city. He approached Shenzhen, which he has described as \"the fastest-developing city in world history,\" with analytical curiosity. \"When APEC leaders come here, they will be very impressed,\" Mahbubani said. \"What Shenzhen has achieved can offer genuine inspiration for the world.\" That inspiration, he argues, lies in the city's industrial transformation. Standing atop a skyscraper overlooking Shenzhen Bay, Mahbubani recalled looking across from Hong Kong decades ago. \"There was nothing here — just rice fields,\" he said. \"Today, the skyline rivals that of major global cities.\" At BYD, the Shenzhen-based electric vehicle maker, Mahbubani test-drove new models and observed safety demonstrations of its blade battery technology. Founded three decades ago, BYD now operates in 116 countries and regions. For Mahbubani, its rise reflects Shenzhen's broader shift from basic manufacturing to advanced technology. This year marks the 45th anniversary of Shenzhen's designation as a special economic zone. Over that period, the city has grown into one of the largest urban economies on the Chinese mainland, widely seen as a testing ground for China's development policies. Shenzhen's strengths, Mahbubani noted, are also institutional. At the Qianhai Shenzhen-Hong Kong Youth Innovation and Entrepreneur Hub, he met start-ups and Hong Kong-funded firms benefiting from integrated government services and policy support — an approach he described as effective and replicable. In Mahbubani's view, Shenzhen's 45-year development is also the story of how relations with Hong Kong have shifted — from one-directional spillover to mutual reinforcement. With a young population and a dense innovation ecosystem, Shenzhen continues to attract emerging industries, from electric vehicles to augmented reality. At a time when global growth is slowing, Mahbubani said the city offers a different way of thinking about development. \"What Shenzhen has accomplished can be a real source of inspiration for countries to see how much progress can be made in such a short period of time,\" Mahbubani said.",
    "source": "Pr Newswire Apac",
    "publishedAt": "2025-12-30 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://en.prnasia.com/story/517521-0.shtml"
  },
  {
    "title": "Fraudsters steal €30,000 from single mum’s divorce settlement after posing as bank employees",
    "description": "Gardaí advised victim that ‘suspects within the State have been identified’, but just over €4,600 has been recovered",
    "source": "Sundayworld",
    "publishedAt": "2025-12-30 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.crimeworld.com/ireland/fraudsters-steal-30000-from-single-mums-divorce-settlement-after-posing-as-bank-employees/a/120622640.html"
  },
  {
    "title": "Bajaj Finserv Ltd slips for fifth straight session",
    "description": "Bajaj Finserv Ltd is quoting at Rs 1990.9, down 1.05% on the day as on 13:19 IST on the NSE. The stock jumped 26.96% in last one year as compared to a 9.53% rally in NIFTY and a 15.97% spurt in the Nifty Financial Services index.",
    "source": "Business Standard",
    "publishedAt": "2025-12-30 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.business-standard.com/markets/capital-market-news/bajaj-finserv-ltd-slips-for-fifth-straight-session-125123000482_1.html"
  },
  {
    "title": "BSE Ltd slips for fifth straight session",
    "description": "BSE Ltd is quoting at Rs 2591.6, down 1.4% on the day as on 13:19 IST on the NSE. The stock jumped 46% in last one year as compared to a 9.53% rally in NIFTY and a 15.97% spurt in the Nifty Financial Services index.",
    "source": "Business Standard",
    "publishedAt": "2025-12-30 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.business-standard.com/markets/capital-market-news/bse-ltd-slips-for-fifth-straight-session-125123000483_1.html"
  },
  {
    "title": "Wipro Ltd drops for fifth straight session",
    "description": "Wipro Ltd is quoting at Rs 263.82, down 0.16% on the day as on 13:19 IST on the NSE. The stock tumbled 12.6% in last one year as compared to a 9.53% rally in NIFTY and a 12% fall in the Nifty IT index.",
    "source": "Business Standard",
    "publishedAt": "2025-12-30 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.business-standard.com/markets/capital-market-news/wipro-ltd-drops-for-fifth-straight-session-125123000484_1.html"
  },
  {
    "title": "Persistent Systems Ltd slips for fifth straight session",
    "description": "Persistent Systems Ltd is quoting at Rs 6203.5, down 0.4% on the day as on 13:19 IST on the NSE. The stock tumbled 3.94% in last one year as compared to a 9.53% rally in NIFTY and a 12% fall in the Nifty IT index.",
    "source": "Business Standard",
    "publishedAt": "2025-12-30 08:05:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.business-standard.com/markets/capital-market-news/persistent-systems-ltd-slips-for-fifth-straight-session-125123000485_1.html"
  }
]