[
  {
    "title": "Google Messages rolling out big photo viewer redesign - 9to5Google",
    "description": "Google Messages rolling out big photo viewer redesign 9to5GoogleGoogle Messages update adds cleaner link and YouTube video previews Android CentralGoogle Messages preps useful changes to saving media, sharing location, and more Android AuthorityWhat Google Messages features are rolling out [November 2025] 9to5GoogleGoogle Messages redesigning link and YouTube previews 9to5Google",
    "source": "Google News",
    "publishedAt": "2025-12-04 20:08:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE1CQlhKVlRtSG4tVzVuWkJBYy1kRldodUhaWGdtelhPcHFqVnFZVVZQV1ZaVWRXMDNxVlV6RUhLaVRweUU3SGpJWHVVVnNyZE9wRWg0VkVFV3duMWg4d2VEdEJWbFFWSlNRQ0NIV2pfaU1mTHdyMHNhWTduRXc?oc=5"
  },
  {
    "title": "As President of Nigeria, I won’t appoint past INEC chair as ambassador – Atiku",
    "description": "Former Vice President Atiku Abubakar has criticisedPresident Bola Tinubu’s nomination of the immediate past Chairman of theIndependent National Electoral Commission (INEC), Mahmood Yakubu, for anambassadorial position, saying he would never make such a move if he werepresident. Atiku, who contested the 2023 presidential election underthe Peoples Democratic Party (PDP), said the decision raises “serious concerns”and risks being interpreted as a political reward rather than a merit-basedappointment. “Let me state without ambiguity: under no circumstance wouldI, as President of the Federal Republic of Nigeria, nominate the immediate pastINEC Chairman for an ambassadorial position,” Atiku wrote in a post on his Xaccount on Thursday. He argued that the nomination “presents terrible optics foran administration already struggling with credibility,” adding that it sendsthe wrong message to the electoral body. “It risks appearing as a quid pro quo rather than arecognition of merit. It sends the wrong message to the current @inecnigerialeadership; that partisan, compromised, or poorly executed elections mayultimately be rewarded,” he said. Atiku added that it was “morally indefensible” for anelectoral umpire at the centre of one of Nigeria’s most disputed elections tobecome a beneficiary of its outcome. “This is not the path to strengthening our democracy orrestoring public trust in our institutions,” he said. Meanwhile, President Tinubu’s nomination of Yakubu iscurrently awaiting legislative consideration.",
    "source": "Nigeria News",
    "publishedAt": "2025-12-04 20:08:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.nigerianeye.com/2025/12/as-president-of-nigeria-i-wont-appoint.html"
  },
  {
    "title": "Blockbuster Dodgers Trade Idea Would Break Baseball",
    "description": "The Los Angeles Dodgers are an aggressive team, and one writer proposed a deal that would outrage baseball fans.",
    "source": "Newsweek",
    "publishedAt": "2025-12-04 20:08:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.newsweek.com/sports/mlb/blockbuster-dodgers-trade-idea-would-break-baseball-11156803"
  },
  {
    "title": "St. Louis City SC begins US Open Cup play in April; tournament shorter due to World Cup",
    "description": "City SC and BOHFS St. Louis, an amateur team, will both be in the U.S. Open Cup in 2026; BOHFS will play in March, City SC in April.",
    "source": "Stltoday",
    "publishedAt": "2025-12-04 20:08:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.stltoday.com/sports/professional/mls/city-sc/article_8ea0de27-0b5d-4536-9881-ef2bcee55abd.html"
  },
  {
    "title": "Klein hiring announcement coming Friday, public appearance Saturday",
    "description": "Collin Klein will be introduced as the new K-State football coach Friday, and the plan is to have him appear Saturday afternoon at the men’s basketball game at Bramlage Coliseum.",
    "source": "Themercury",
    "publishedAt": "2025-12-04 20:08:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://themercury.com/k_state_sports/klein-hiring-announcement-coming-friday-public-appearance-saturday/article_5766a7d2-d258-4326-809b-5adfd11c4f4f.html"
  },
  {
    "title": "VerifiedX and Blockdaemon Announce Strategic Partnership to Bring Scalable DeFi Access Globally",
    "description": "NEW YORK, Dec. 04, 2025 (GLOBE NEWSWIRE) -- VerifiedX (VFX) network (verifiedx.io), the people’s network and a decentralized global leader in self-custody and Web3 wallet financial infrastructure powering institutional and consumer-grade blockchain utility and Blockdaemon (blockdaemon.com), a leading U.S.- headquartered institutional-grade crypto infrastructure company, today announced a major first-mover strategic partnership. Together, Blockdaemon and VerifiedX will now deliver a new era of accessible, scalable, and secure decentralized finance (DeFi) for everyday users around the world.",
    "source": "Globenewswire_fr",
    "publishedAt": "2025-12-04 20:08:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.globenewswire.com/fr/news-release/2025/12/04/3200283/0/en/VerifiedX-and-Blockdaemon-Announce-Strategic-Partnership-to-Bring-Scalable-DeFi-Access-Globally.html"
  },
  {
    "title": "Klein hiring announcement coming Friday, public appearance Saturday - themercury.com",
    "description": "Klein hiring announcement coming Friday, public appearance Saturday themercury.comKSU's Klieman to retire; former QB Klein in line ESPNBill Snyder reflects on Klieman’s retirement, why Collin Klein is ready to lead K-State themercury.com'We have to get this thing under control': Kansas State AD says NIL isn't fair across country The Topeka Capital-JournalTexas A&M’s Offensive Coordinator Hot Board: 5 Names That Could Makes Sense Sports Illustrated",
    "source": "Google News",
    "publishedAt": "2025-12-04 20:08:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://news.google.com/rss/articles/CBMi6gFBVV95cUxOUDZfNnlENUZkVjZCUk0xVUtFZERVNmQ5Mzh3TjZVbW5pUjhGSy1JMFpXcHJCYzc5cDZWQm9raWFCOE5CMU5UOUlzQllWeTZhQktNRUlFX3dZLVdNMG9JZWxZYW9xSzBQX1lYQkNTeEVRNGVvdjREcDYtdm5Lc2x6NF8zMWRtNDAwaE5fMG1Ea0JnRnJ1M1ZqTzJXZjJJcDlYOG1wWXlma3c5QXpBNUtCdFNGXzZ0bHUzWkdwQS1YYjVsNTBvUzU5RHExNjBueTA4N3E3S0d4QTJWNlM4Q0huYVNRd2YxcVd1OGc?oc=5"
  },
  {
    "title": "H.S. BOYS WRESTLING ROUNDUP: Letchworth takes season opener against Le Roy",
    "description": "GAINESVILLE - The Letchworth boys wrestling team picked up a victory in its season opener against Le Roy on Wednesday, with a final score of 44-24.",
    "source": "Thedailynewsonline",
    "publishedAt": "2025-12-04 20:08:00",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.thedailynewsonline.com/sports/h-s-boys-wrestling-roundup-letchworth-takes-season-opener-against-le-roy/article_ea99d236-9a97-5d58-8879-843a95011062.html"
  },
  {
    "title": "Lakers' Luka Doncic (personal) out vs. Raptors",
    "description": "Los Angeles Lakers superstar guard Luka Doncic will not be available for Thursday's game against the host Toronto Raptors.,Doncic officially has been",
    "source": "Deadspin",
    "publishedAt": "2025-12-04 20:07:58",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://deadspin.com/lakers-luka-doncic-personal-out-vs-raptors/"
  },
  {
    "title": "Amazon's 'Thank My Driver' program returns: How to give $5 tip at no extra cost",
    "description": "The promotion was first introduced in 2022, allowing customers to thank their drivers at no cost.",
    "source": "9news",
    "publishedAt": "2025-12-04 20:07:55",
    "content": "ONLY AVAILABLE IN PAID PLANS",
    "url": "https://www.9news.com/article/news/nation-world/amazon-thank-my-driver-how-to-tip-after-delivery/507-0f2eb7bb-9887-4273-a9a9-38556f1d41df"
  }
]